{
  "id": "r03f43",
  "filename": "52246737.pdf",
  "upload_time": "17:35:11",
  "document_type": "resume",
  "original_text": "INFORMATION TECHNOLOGY PROVISIONING TECHNICIAN\nCareer Overview\nProcess driven, goal oriented, Information Security Leader with 5 \nyears of IT and security experience. A self-motivated \nGovernance manager that\nis adept at analyzing and remediating threat vectors on an enterprise level. Bolsters corporate strategy, enhances daily security operations and\ndelivers improved and optimized business protection, while leading a geographically diverse team adept at problem solving and risk analysis. \nAudit\nand Control Establishment \nImmediate Value Offered \nTechnical Acumen \nMaximize technology investment, effectively implement IT business\nstrategy, \ndrive innovation, improve business processes, expand service & technical \nSTRATEGIC PLANNING & ENABLEMENT \ncapabilities\nand maximize multi-million dollar cost savings\nQualifications\nBUSINESS PROCESS IMPROVEMENTS \nPartner with teams to create efficient cross-functional processes by eliminating \nCONTRACT\nNEGOTIATIONS \nCOST SAVINGS INITIATIVES AD, DNS, TCP/IP, Microsoft Exchange, Rapid7 Vulnerability Assessment Platform,\nFirewall, IDS/IPS, Web Filter/Proxy, Mail\nAccomplishments\nInfluential change agent focused on renewing quality initiatives for complex IT \nIT SOX GOVERNANCE & COMPLIANCE \nOutstanding\nMentoring skills, adept at coaching junior and senior personnel, \nportfolios while collaborating cross-functionally and interdepartmentally\nincreasing growth and confidence among team members \nFINANCIAL POLICIES & FORECASTING \nPROJECT Deployment &\nREPORTING \nPROJECT SCOPE AND SCHEDULING \nProvide ongoing management of Information Security practices, specifications,\nand architecture design facilitating continuous organizational improvement \nSecurity INFRASTRUCTURE \nIT ANALYTICS &\nORIENTATION \nProgressive experience with managing enterprise security initiatives and \nculture and the development of appropriate audit\nprocedures, policies, \nmanaging IT SOX governance & compliance to build a risk-based security \nescalation paths, tracking, documentation,\nand a highly trained team proficient \nManagement \nExperience \nin enforcing key SOX requirements throughout the enterprise \nPROGRAM\nMANAGEMENT \nCROSS FUNCTIONAL COLLABORATION \ncoupled with enterprise policy creation and negotiation acumen\nPossess comprehensive technical background and management experience \nRESOURCES UTILIZATION \nTRAINING &\nDEVELOPMENT \nEnsure business continuity and manage technology risks through information \nCHANGE MANAGEMENT \nassurance\nscoping, raising security awareness, bolstering systems, deploying.\nWork Experience\n08/2013\n \nto \n11/2013\n \nCompany Name\n \nï¼​ \nState\nMcAfee EEPC).\nWorked with multiple departments and executive teams to ensure a timely and complete roll-out of product.\nServed as a technical lead and a tier 2 escalation resource for multiple applications and operating systems.\nSupport included \nWindows (XP and 7), Linux (Red Hat), and Mac (OSX).\nAdministration, troubleshooting, reclamation, and issuance of RSA soft and hard tokens.\nServed as main escalation point \nfor de-synchronization issues and hardware-based troubles.\nLed the executive support team which provided \"white-glove\" support for director level and above \nActive Directory administration ranging\nfrom SSO integration to forest creation, to simple user administration.\nIdentified,.\nInformation Technology Provisioning Technician\n \n, \n10/2012\n \nto \n08/2013\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nresearched and resolved AD issues relating to advanced administration and GPO creation.\nProvided remote and local support to an employee base of over 7000 employees, contractors, and consultants.\nResolved \ncomplex hardware and software issues, and served as tier 2 and 3 support when needed.\nUtilized multiple ticketing systems to track customer issues, including Numara Footprints and Kayako \nProvisioned, troubleshot, and\nrepaired laptops, desktops, MiFi's, and corporate cellular phones \nManaged the network operations center, which serviced upwards of 100\nclients over multiple geographic locations with.\nInformation Technology Consultant\n \n, \n12/2011\n \nto \n02/2013\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nvarying degrees of service contracts, in significantly diverse environments.\nUtilization of N-Central monitoring and patch management platform to audit and report on customer compliance and \nsoftware usage\nstatistics to prepare and present recommendations to increase security and productivity of the business \nArchitected, implemented, and\ndocumented various Exchange and Active Directory deployments within each customer's \nindividual ecosystem, and tracked utilization\nstatistics to increase revenue for the operations center.\nCompany Name\n \nï¼​ \nCity\n \n, \nState\nResponsible for Enterprise Information Security and Architecture, Risk Management and Compliance, understanding business Information\nSecurity & Compliance Manager \nSolarCity, SAN MATEO, CA \nNovember 2013 - PRESENT issues and concerns, determining business\nand security requirements, designing architecture and applying Security Technologies to mitigate risk and ensure compliance with SolarCity\npolicies and standards.\nImplementation and administration of forensic imaging enterprise solution.\nUtilized to conduct covert and overt collection and analysis of at-risk employees \nCreation and maintenance of IT SOX \nidentified by our\nLegal team.\n\nGovernance and Compliance program \nOutstanding mentoring skills, adept at coaching junior and senior personnel, \nincreasing growth and\nconfidence among team members.\ndeployment of Vulnerability Assessment \nConcept-to-completion driver for the \nplatform \nInterdepartmental mediator focused on converting\nidentified risks, divergent - \nprogramming and non-compliant applications and software into enterprise- \nlevel solutions complete with policy\nguidance and remediation measures \nVendor assessment, negotiation and then \nimplementation of an upgraded security \nManaged Information\nSecurity projects, including planning and development of \nplatform including firewall, proxy, \nnew processes and technologies in areas of\nintrusion detection and response, \ncategory-based filter and VPN \nmanagement of vulnerability assessment practices, and vpn authentication.\nReduced the total cost of ownership for our \nAnti-Virus system by streamlining the \nIdentified technical/mobility improvements to physical\nsecurity designs, \nAuthor and maintain all Information \ndeployment and administration processes \nproviding a risk-based methodology,\nincreased incident management landscape \nTechnology, and Information Security \nand reduced operational expenditure \npolicies for the\nenterprise Administered and coordinated the conversion of existing whole disk encryption platform (Symantec PGP) to new platform.\nEducation and Training\nAssociates of Arts and Sciences (AAS)\n \n:\n \nBusiness Administration Software Technology\n \nBusiness Administration Software Technology\nAssociates of Arts (AA)\n \n:\n \nInformation Technology\n \nHeald College\n \nInformation Technology\nAssociate of Applied Sciences (AAS)\n \n:\n \nNetwork Security\n \nHeald College\n \nNetwork Security\nComptia A \nCertification Comptia Security \nCertification\nSkills\nA \nCertification, Active Directory, AD, Anti-Virus, BUSINESS PROCESS, coaching, Compliance Manager, CA, hardware, Concept,\nCONTRACT NEGOTIATIONS, contracts, conversion, encryption, clients, designing, desktops, Disaster Recovery, DNS, Firewall, functional,\nGateway, IDS, imaging, Information Security, laptops, Legal, Linux, Mac, director, McAfee, mediator, mentoring, Exchange, Microsoft Exchange,\nMail, Windows (XP, negotiation, Enterprise, network, Networking, operating systems, personnel, policies, processes, programming, Proxy, Red\nHat, RELATIONSHIP BUILDING, Risk Management, SAN, statistics, Symantec, TCP/IP, Technical Trainer, phones, troubleshooting, VPN,\nAuthor",
  "processed": {
    "clean_text": "information technology provisioning technician career overview process driven, goal oriented, information security leader with 5 years of it and security experience. a self-motivated governance manager that is adept at analyzing and remediating threat vectors on an enterprise level. bolsters corporate strategy, enhances daily security operations and delivers improved and optimized business protection, while leading a geographically diverse team adept at problem solving and risk analysis. audit and control establishment immediate value offered technical acumen maximize technology investment, effectively implement it business strategy, drive innovation, improve business processes, expand service  technical strategic planning  enablement capabilities and maximize multi-million dollar cost savings qualifications business process improvements partner with teams to create efficient cross-functional processes by eliminating contract negotiations cost savings initiatives ad, dns, tcp/ip, microsoft exchange, rapid7 vulnerability assessment platform, firewall, ids/ips, web filter/proxy, mail accomplishments influential change agent focused on renewing quality initiatives for complex it it sox governance  compliance outstanding mentoring skills, adept at coaching junior and senior personnel, portfolios while collaborating cross-functionally and interdepartmentally increasing growth and confidence among team members financial policies  forecasting project deployment  reporting project scope and scheduling provide ongoing management of information security practices, specifications, and architecture design facilitating continuous organizational improvement security infrastructure it analytics  orientation progressive experience with managing enterprise security initiatives and culture and the development of appropriate audit procedures, policies, managing it sox governance  compliance to build a risk-based security escalation paths, tracking, documentation, and a highly trained team proficient management experience in enforcing key sox requirements throughout the enterprise program management cross functional collaboration coupled with enterprise policy creation and negotiation acumen possess comprehensive technical background and management experience resources utilization training  development ensure business continuity and manage technology risks through information change management assurance scoping, raising security awareness, bolstering systems, deploying. work experience 08/2013 to 11/2013 company name ï¼ state mcafee eepc). worked with multiple departments and executive teams to ensure a timely and complete roll-out of product. served as a technical lead and a tier 2 escalation resource for multiple applications and operating systems. support included windows (xp and 7), linux (red hat), and mac (osx). administration, troubleshooting, reclamation, and issuance of rsa soft and hard tokens. served as main escalation point for de-synchronization issues and hardware-based troubles. led the executive support team which provided white-glove support for director level and above active directory administration ranging from sso integration to forest creation, to simple user administration. identified,. information technology provisioning technician , 10/2012 to 08/2013 company name ï¼ city , state researched and resolved ad issues relating to advanced administration and gpo creation. provided remote and local support to an employee base of over 7000 employees, contractors, and consultants. resolved complex hardware and software issues, and served as tier 2 and 3 support when needed. utilized multiple ticketing systems to track customer issues, including numara footprints and kayako provisioned, troubleshot, and repaired laptops, desktops, mifis, and corporate cellular phones managed the network operations center, which serviced upwards of 100 clients over multiple geographic locations with. information technology consultant , 12/2011 to 02/2013 company name ï¼ city , state varying degrees of service contracts, in significantly diverse environments. utilization of n-central monitoring and patch management platform to audit and report on customer compliance and software usage statistics to prepare and present recommendations to increase security and productivity of the business architected, implemented, and documented various exchange and active directory deployments within each customers individual ecosystem, and tracked utilization statistics to increase revenue for the operations center. company name ï¼ city , state responsible for enterprise information security and architecture, risk management and compliance, understanding business information security  compliance manager solarcity, san mateo, ca november 2013 - present issues and concerns, determining business and security requirements, designing architecture and applying security technologies to mitigate risk and ensure compliance with solarcity policies and standards. implementation and administration of forensic imaging enterprise solution. utilized to conduct covert and overt collection and analysis of at-risk employees creation and maintenance of it sox identified by our legal team. governance and compliance program outstanding mentoring skills, adept at coaching junior and senior personnel, increasing growth and confidence among team members. deployment of vulnerability assessment concept-to-completion driver for the platform interdepartmental mediator focused on converting identified risks, divergent - programming and non-compliant applications and software into enterprise- level solutions complete with policy guidance and remediation measures vendor assessment, negotiation and then implementation of an upgraded security managed information security projects, including planning and development of platform including firewall, proxy, new processes and technologies in areas of intrusion detection and response, category-based filter and vpn management of vulnerability assessment practices, and vpn authentication. reduced the total cost of ownership for our anti-virus system by streamlining the identified technical/mobility improvements to physical security designs, author and maintain all information deployment and administration processes providing a risk-based methodology, increased incident management landscape technology, and information security and reduced operational expenditure policies for the enterprise administered and coordinated the conversion of existing whole disk encryption platform (symantec pgp) to new platform. education and training associates of arts and sciences (aas) : business administration software technology business administration software technology associates of arts (aa) : information technology heald college information technology associate of applied sciences (aas) : network security heald college network security comptia a certification comptia security certification skills a certification, active directory, ad, anti-virus, business process, coaching, compliance manager, ca, hardware, concept, contract negotiations, contracts, conversion, encryption, clients, designing, desktops, disaster recovery, dns, firewall, functional, gateway, ids, imaging, information security, laptops, legal, linux, mac, director, mcafee, mediator, mentoring, exchange, microsoft exchange, mail, windows (xp, negotiation, enterprise, network, networking, operating systems, personnel, policies, processes, programming, proxy, red hat, relationship building, risk management, san, statistics, symantec, tcp/ip, technical trainer, phones, troubleshooting, vpn, author",
    "metadata": {
      "has_education": true
    },
    "sections": {},
    "keywords": [
      "security",
      "information",
      "technology",
      "business",
      "management",
      "process",
      "enterprise",
      "team",
      "compliance",
      "administration",
      "policy",
      "risk",
      "platform",
      "experience",
      "technical",
      "negotiation",
      "system",
      "support",
      "issue",
      "software",
      "governance",
      "adept",
      "contract",
      "exchange",
      "assessment",
      "sox",
      "deployment",
      "creation",
      "company",
      "name"
    ]
  },
  "file_path": "/Users/proxim/Desktop/Automated-First-Screener-and-AI-Job-Matching-NLP-WebEngine/data/raw/resumes/r03f43.pdf"
}