{
  "id": "r1437c",
  "filename": "13836471.pdf",
  "upload_time": "17:35:27",
  "document_type": "resume",
  "original_text": "INFORMATION TECHNOLOGY MANAGER\nExperience\nInformation Technology Manager\n \nApril 2007\n \nto \nCurrent\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nAnnual budget planning for department, network administration, implementation of new technology, developed company applications, daily\nbackups and technical support for 80 users.\nAdministration of security firewall, spam firewall and web filter.\nVLAN's and VPN setup and administration.\nWindows Server 2008 R2 administration, Microsoft Active Directory administration with 100 PCs on Windows 7 and Windows XP.\nMicrosoft DFS, DHCP, DNS and WSUS Services administration.\nFTP server implementation and administration.\nMicrosoft Exchange Server 2010 Administration, creation of new users, distribution groups and daily backup.\nServers and desktop backup with Symantec BackupExec 2012.\nAdministration, maintenance and daily backup for Sybase SQL Anywhere 11.0 databases.\nAdministration of Mac editing rooms on OS X 10.8 - 10.9 with SAN storage (Apple XSAN 30 TB Array administration on Promise\nVTrak Ex10 Series).\nSoftware installation and setup for editing rooms with Final Cut, Adobe Products, Cinema 4D etc; Hardware installation and configuration\nfor video capture with Aja, Kona and Black Magic video capture devices.\niNews (News Room Management System), Wide Orbit (Traffic, Sales and Revenue Software).\nKnowledge of Florical Systems (Software for Television Automation), Omneon video server, Streambox (Mobile Broadcast Streaming\nVideo) and some Miranda products.\nResponsible for research, quote, acquisition and configuration of all new network technology in the company.\nRepair, installation and updates of Software and Hardware for PCs and Mac Computers.\nInformation Technology Manager\n \nJuly 2001\n \nto \nMarch 2007\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nDevelop, maintain and support in-house applications.\nResponsibilities include software licensing, updating operating system for desktop computers and servers and technical support for 25 users.\nSupervised two employees for the department.\nIn 2004 developed a program to track inventory of all hardware being distributed to 300 branch offices as well as a user manual for the in\nhouse application detailing procedures and processes.\nNetwork Administration for a LAN with 30 desktop PCs and 5 Windows 2003 Standard Edition, Active Directory Service, DHCP and\nDNS Server administration.\nImplementation of FTP Server for large file transfer.\nImplementation of Distributed File System (DFS) to share files in each department.\nMicrosoft Exchange Server 2003 Administration, creation of new users, groups and policy groups, daily backup.\nInstallation and maintenance of Certification Authority in Windows Server 2003 for web application.\nAdministration, maintenance and daily backup for a database Sybase SQL Anywhere 9.0.\nMaintenance and Creation of desktop applications (Power Builder 6.5, Power Builder 9.0).\nTechnical support for 300 branch offices.\nNew installation and updates of Software and Hardware.\nInformation Systems Administrator\n \nJanuary 2001\n \nto \nJuly 2001\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nTechnical support for 10 network users and 100 branch offices.\nImplemented Terminal Service to be able to connect to five new branches in Colombia.\nDaily backup for Sybase SQL Anywhere 7.0 Database, Microsoft SQL Server 2000 Database, QuickBooks Pro Database and in house\nprogram.\nNetwork Administration, implementation of FTP service for 100 branches connections, creation of uses and security access.\nWindows 2000 Server Administration, Active Directory Service administration and maintenance.\nMicrosoft SQL Server 2000 administration.\nTechnical Support for branch offices.\nInstallation and updates of Software and Hardware.\nEducation\nBS\n \n: \nComputer System Engineer\n \n, \nJanuary 29 2000\n \nFundacion Universidad Autonoma de Colombia\n \nï¼​ \nCity\n \n, \nColombia\n \nComputer System\nEngineer\nComputer Technician\n \n: \nApril 26 1997\nCertification in LAN Network Administration\n \n: \nJanuary 1997\n \nCentro Colombiano de Estudios Profesionales Pontificia Universidad Javeriana\n \nï¼​\nCity\n \n, \nColombia\nSkills\n4D, Active Directory, Adobe Products, Apple, Automation, backup, Broadcast, budget planning, Computer Technician, Hardware installation\nand configuration, Hardware, databases, Database, DHCP, DNS, editing, Final Cut, firewall, FTP, inventory, LAN, Mac, Magic, access,\n\nMicrosoft Exchange Server, Windows 7, Windows, 2000, Windows XP, Network Administration, network, OS, operating system, Power\nBuilder 6.5, Power Builder 9.0, processes, QuickBooks Pro, research, Sales, SAN, Servers, Software installation, Microsoft SQL Server,\nStreaming Video, Sybase SQL Anywhere 7.0, Sybase SQL Anywhere 9.0, Sybase SQL Anywhere, Symantec, Technical support, Television,\nvideo, VPN, Windows Server, Windows 2000 Server",
  "processed": {
    "clean_text": "information technology manager experience information technology manager april 2007 to current company name ï¼ city , state annual budget planning for department, network administration, implementation of new technology, developed company applications, daily backups and technical support for 80 users. administration of security firewall, spam firewall and web filter. vlans and vpn setup and administration. windows server 2008 r2 administration, microsoft active directory administration with 100 pcs on windows 7 and windows xp. microsoft dfs, dhcp, dns and wsus services administration. ftp server implementation and administration. microsoft exchange server 2010 administration, creation of new users, distribution groups and daily backup. servers and desktop backup with symantec backupexec 2012. administration, maintenance and daily backup for sybase sql anywhere 11.0 databases. administration of mac editing rooms on os x 10.8 - 10.9 with san storage (apple xsan 30 tb array administration on promise vtrak ex10 series). software installation and setup for editing rooms with final cut, adobe products, cinema 4d etc; hardware installation and configuration for video capture with aja, kona and black magic video capture devices. inews (news room management system), wide orbit (traffic, sales and revenue software). knowledge of florical systems (software for television automation), omneon video server, streambox (mobile broadcast streaming video) and some miranda products. responsible for research, quote, acquisition and configuration of all new network technology in the company. repair, installation and updates of software and hardware for pcs and mac computers. information technology manager july 2001 to march 2007 company name ï¼ city , state develop, maintain and support in-house applications. responsibilities include software licensing, updating operating system for desktop computers and servers and technical support for 25 users. supervised two employees for the department. in 2004 developed a program to track inventory of all hardware being distributed to 300 branch offices as well as a user manual for the in house application detailing procedures and processes. network administration for a lan with 30 desktop pcs and 5 windows 2003 standard edition, active directory service, dhcp and dns server administration. implementation of ftp server for large file transfer. implementation of distributed file system (dfs) to share files in each department. microsoft exchange server 2003 administration, creation of new users, groups and policy groups, daily backup. installation and maintenance of certification authority in windows server 2003 for web application. administration, maintenance and daily backup for a database sybase sql anywhere 9.0. maintenance and creation of desktop applications (power builder 6.5, power builder 9.0). technical support for 300 branch offices. new installation and updates of software and hardware. information systems administrator january 2001 to july 2001 company name ï¼ city , state technical support for 10 network users and 100 branch offices. implemented terminal service to be able to connect to five new branches in colombia. daily backup for sybase sql anywhere 7.0 database, microsoft sql server 2000 database, quickbooks pro database and in house program. network administration, implementation of ftp service for 100 branches connections, creation of uses and security access. windows 2000 server administration, active directory service administration and maintenance. microsoft sql server 2000 administration. technical support for branch offices. installation and updates of software and hardware. education bs : computer system engineer , january 29 2000 fundacion universidad autonoma de colombia ï¼ city , colombia computer system engineer computer technician : april 26 1997 certification in lan network administration : january 1997 centro colombiano de estudios profesionales pontificia universidad javeriana ï¼ city , colombia skills 4d, active directory, adobe products, apple, automation, backup, broadcast, budget planning, computer technician, hardware installation and configuration, hardware, databases, database, dhcp, dns, editing, final cut, firewall, ftp, inventory, lan, mac, magic, access, microsoft exchange server, windows 7, windows, 2000, windows xp, network administration, network, os, operating system, power builder 6.5, power builder 9.0, processes, quickbooks pro, research, sales, san, servers, software installation, microsoft sql server, streaming video, sybase sql anywhere 7.0, sybase sql anywhere 9.0, sybase sql anywhere, symantec, technical support, television, video, vpn, windows server, windows 2000 server",
    "metadata": {
      "has_education": true
    },
    "sections": {},
    "keywords": [
      "administration",
      "server",
      "window",
      "sql",
      "network",
      "backup",
      "microsoft",
      "software",
      "installation",
      "system",
      "support",
      "database",
      "hardware",
      "new",
      "daily",
      "technical",
      "user",
      "sybase",
      "anywhere",
      "video",
      "computer",
      "branch",
      "2000",
      "technology",
      "company",
      "city",
      "implementation",
      "application",
      "service",
      "maintenance"
    ]
  },
  "file_path": "/Users/proxim/Desktop/Automated-First-Screener-and-AI-Job-Matching-NLP-WebEngine/data/raw/resumes/r1437c.pdf"
}