{
  "id": "r17617",
  "filename": "15118506.pdf",
  "upload_time": "17:35:26",
  "document_type": "resume",
  "original_text": "DIRECTOR OF INFORMATION TECHNOLOGY\nExecutive Profile\nInnovative executive and technology professional with strong work ethic and excellent communication skills, experienced in high-volume, multi-unit,\nretail and business operations. Desires a high-level position in a professional business environment.\nSkill Highlights\nMicrosoft Server 2003, 2008, 2012\nExchange Server 2007, 2010\nVMware ESXi\nVMware vCenter\nVMware Horizon ViewÂ 5.x, 6.x, and 7.x\nMicrosoft Hyper-V\nCisco UCM and Unity\nHelp Desk\nITIL Service Catalog\nVendor Management\nBudgeting\nProject Management\nSLA Management\nAsset Management\nProfessional Experience\nDirector of Information Technology\n \n11/2012\n \nto \nCurrent\n \nCompany Name\n \nCity\n \n, \nState\nDeveloped and implemented the IT strategy for the organization including software, support and infrastructure\nHired, developed, and managed IT staff\nNegotiated terms and products from external vendors, including changes needed as business needs changed\nMet and exceeded goals set by executive leadership accomplishing both time and financial gains\nSet annual budgets for organizational technology needs\nIT Administrator\n \n03/2008\n \nto \n11/2012\n \nCompany Name\n \nCity\n \n, \nState\nPlanned, installed and managed Microsoft domain environment utilizing Microsoft Server 2008\nUpgraded environment to Server 2012\nPlanned, installed and managed Microsoft Exchange server, successfully migrating end user data from third party non-Exchange environment\nPlanned, installed and managed VMware platform for a virtual environment. \nConverted all physical servers to virtual environment\nPlanned, installed and managed VMware Horizon View virtual desktop environment\nSuccessfully migrated 120 users from physical computers to zero clients utilizing the VDI environment\nMaintained Cisco routing, switching, VoIP, and camera infrastructure, implementing our design utilizing third party vendors\nManaged help desk, utilizing ITIL framework for 260 end users\nExecuted break/fix for computers, printers, security system, camera system, and all A/V systems\nNew Car Sales\n \n08/2005\n \nto \n02/2008\n \nCompany Name\n \nCity\n \n, \nState\nRecognized by Toyota as one of the top salespeople in the Chicago Region\nIT Consultant\n \n01/2000\n \nto \n08/2005\n \nCompany Name\n \nCity\n \n, \nState\nProvided IT consultation and implementation of retail cash register networks\nManaged staff of more than 10 independent IT contractors in implementation of contract projects\nActed as project manager for new equipment and software roll outs for some of the largest retail chains in the US including Wal-Mart, Mar-\nMaxx, and Toys 'R Us\nCertifications\nVMware Certified Professional 5 - Data Center Virtualization\nVMware Certified Professional 5 - Desktop Virtualization\nITIL Foundation Certified\nMicrosoft Certified Professional - Server 2012\nCore Accomplishments\nLeadership Skills:\nLed committee to successfully changeÂ our organization's dealership management system (DMS).Â  The DMS is similar to an ERP system\nfor auto dealerships\nCharged with maintaining compliance and security for customer data. \nSuccessfully manage data sharing relationships with more than ten third\nparty vendors. \nWorked closely with DMS provider to develop an acceptable secure data sharing platform.\n\nProject Management:\nCurrently managing the conversion of the dealership to a newÂ dealership management system.Â  Created and ran sub-committees,\nmapped out and executed the conversion plan, responsible for many key process changes and workflowsÂ \nServed as project manager for project creating a paperless work flow and digital storage process which resulted in 50% reduction of\nadministrative processing time, $30,000/year reduction in costs, while increasing document availability and storage accuracy.\nAs project manager, developed Smart Motors domain environment including group policy, DNS, multiple domain controllers, and OU\nstructure.\nManaged email conversion project, deploying Smart Motors' on-site Exchange server. \nConverted existing email accounts from non-\nExchange and provide access via Outlook Web App and mobile phone connectionsÂ \nServed as project manager on several projects developing Smart Motors' virtual environment, including 5 esxi hosts separated into two\nresource pools, vCenter, Horizon View for 120 users utilizing 2 view connection servers and a security server\nInstalled and mange TrendMicro agentless security for VMware View\nStaff Development:\nFrequently met one on one with staff to determine motivation and goals. \nGuided staff in creation of goals and the pursuit there of\nPresented daily topics in morning meetings to inform and reinforce company core values such as commitment to quality, customer\nsatisfaction, and continuous improvment\nDeveloped and implemented a training program for new employees, providing them with the technology skills necessary for efficient and\nsuccessful use of company technology tools\nOperations Management:\nManaged the infrastructure to support 260 users selling 500 vehicles and servicing 7,000Â vehicles each month\nHandled all technology vendor interactions including contract negotiations, SLA monitoring, and license utilization\nEducation\nBachelor of Science\n \n: \nManagement Information Systems\n \nCardinal Stritch University\n \nCity\n \n, \nState\nOnline Profile\nLinkedIn\nwww.linkedin.com/in/RobertRJordan\n Â",
  "processed": {
    "clean_text": "director of information technology executive profile innovative executive and technology professional with strong work ethic and excellent communication skills, experienced in high-volume, multi-unit, retail and business operations. desires a high-level position in a professional business environment. skill highlights microsoft server 2003, 2008, 2012 exchange server 2007, 2010 vmware esxi vmware vcenter vmware horizon viewâ 5.x, 6.x, and 7.x microsoft hyper-v cisco ucm and unity help desk itil service catalog vendor management budgeting project management sla management asset management professional experience director of information technology 11/2012 to current company name city , state developed and implemented the it strategy for the organization including software, support and infrastructure hired, developed, and managed it staff negotiated terms and products from external vendors, including changes needed as business needs changed met and exceeded goals set by executive leadership accomplishing both time and financial gains set annual budgets for organizational technology needs it administrator 03/2008 to 11/2012 company name city , state planned, installed and managed microsoft domain environment utilizing microsoft server 2008 upgraded environment to server 2012 planned, installed and managed microsoft exchange server, successfully migrating end user data from third party non-exchange environment planned, installed and managed vmware platform for a virtual environment. converted all physical servers to virtual environment planned, installed and managed vmware horizon view virtual desktop environment successfully migrated 120 users from physical computers to zero clients utilizing the vdi environment maintained cisco routing, switching, voip, and camera infrastructure, implementing our design utilizing third party vendors managed help desk, utilizing itil framework for 260 end users executed break/fix for computers, printers, security system, camera system, and all a/v systems new car sales 08/2005 to 02/2008 company name city , state recognized by toyota as one of the top salespeople in the chicago region it consultant 01/2000 to 08/2005 company name city , state provided it consultation and implementation of retail cash register networks managed staff of more than 10 independent it contractors in implementation of contract projects acted as project manager for new equipment and software roll outs for some of the largest retail chains in the us including wal-mart, mar- maxx, and toys r us certifications vmware certified professional 5 - data center virtualization vmware certified professional 5 - desktop virtualization itil foundation certified microsoft certified professional - server 2012 core accomplishments leadership skills: led committee to successfully changeâ our organizations dealership management system (dms).â the dms is similar to an erp system for auto dealerships charged with maintaining compliance and security for customer data. successfully manage data sharing relationships with more than ten third party vendors. worked closely with dms provider to develop an acceptable secure data sharing platform. project management: currently managing the conversion of the dealership to a newâ dealership management system.â created and ran sub-committees, mapped out and executed the conversion plan, responsible for many key process changes and workflowsâ served as project manager for project creating a paperless work flow and digital storage process which resulted in 50 reduction of administrative processing time, 30,000/year reduction in costs, while increasing document availability and storage accuracy. as project manager, developed smart motors domain environment including group policy, dns, multiple domain controllers, and ou structure. managed email conversion project, deploying smart motors on-site exchange server. converted existing email accounts from non- exchange and provide access via outlook web app and mobile phone connectionsâ served as project manager on several projects developing smart motors virtual environment, including 5 esxi hosts separated into two resource pools, vcenter, horizon view for 120 users utilizing 2 view connection servers and a security server installed and mange trendmicro agentless security for vmware view staff development: frequently met one on one with staff to determine motivation and goals. guided staff in creation of goals and the pursuit there of presented daily topics in morning meetings to inform and reinforce company core values such as commitment to quality, customer satisfaction, and continuous improvment developed and implemented a training program for new employees, providing them with the technology skills necessary for efficient and successful use of company technology tools operations management: managed the infrastructure to support 260 users selling 500 vehicles and servicing 7,000â vehicles each month handled all technology vendor interactions including contract negotiations, sla monitoring, and license utilization education bachelor of science : management information systems cardinal stritch university city , state online profile linkedin www.linkedin.com/in/robertrjordan â",
    "metadata": {
      "has_education": true
    },
    "sections": {},
    "keywords": [
      "environment",
      "server",
      "project",
      "management",
      "managed",
      "vmware",
      "technology",
      "professional",
      "microsoft",
      "company",
      "including",
      "system",
      "vendor",
      "city",
      "state",
      "staff",
      "installed",
      "utilizing",
      "user",
      "data",
      "skill",
      "exchange",
      "name",
      "developed",
      "planned",
      "successfully",
      "virtual",
      "view",
      "security",
      "manager"
    ]
  },
  "file_path": "/Users/proxim/Desktop/Automated-First-Screener-and-AI-Job-Matching-NLP-WebEngine/data/raw/resumes/r17617.pdf"
}