{
  "id": "r1e5e0",
  "filename": "37242217.pdf",
  "upload_time": "17:35:14",
  "document_type": "resume",
  "original_text": "INFORMATION TECHNOLOGY CONSULTANT\nCareer Overview\nAccomplished information technology professional with over 18 years of diverse technology, process analysis, project management, and\ninformation management experience. \nProven ability to successfully implement technology solutions, stay within time and budget constraints, and\nimprove efficiency through proper risk management, task coordination, and resource utilization. Core Competencies Project Management Systems\n/ Network Reporting Proposal Development Web Design & Development SOP & Policy Writing Systems & Process Consulting Document\nManagement Technically-advanced information technology specialist successful in software administration and data communications.Experienced\nComputer Systems Analyst with diverse industry experience in banking, healthcare, insurance and government. Professional expertise includes\nsystems applications, disaster recovery planning and information protection analysis.\nQualifications\nMicrosoft Windows (7, 8, 2012), Apple Mac (OS 7 - X, OS X Server, iOS), Unix/Linux (Ubuntu,\nRed Hat, CentOS, FreeBSD, SmoothWall Express)\nServer/Web Software: \nMS Exchange, MS SharePoint, MS IIS, MS Hyper-V, Apache, WordPress,\nCloudFlare, Documentum, CoreDossier, Oracle Workflow, DavMail HTML5, CSS, PHP,\nJavaScript, Java, XML, C++, Microsoft Visual Basic\nApplications: Adobe CS6 (Acrobat, Photoshop, Illustrator, InDesign, Dreamweaver, Premiere, Flash,\nAfter Effects, Fireworks), MS Office, MS Project, Office 365 MySQL, MS SQL, MS Access,\nOracle 11i, Sage ACT!\nWeb content management\nInformation security\nContent management systems\nHardware: Dell, HP, IBM, Cisco,\nSonicWall, NetGear,\nFortiGateProgramming and design\nskills\nOptimizing and performance tuning\nDocument management\nWeb content management\nAccomplishments\nPrint Graphic Support\n Â \nCollaborated with marketing and business development groups for collateral needs by creating page layout designs for flyers, data sheets,\nCD covers and other printed materials.\nRequirements Analysis\n Â \nCompleted business requirements analysis including the evaluation of systems specifications for client Web site two weeks ahead of\ndeadline.\nIT Training\n Â \nSuccessfully trained 25 employees to use new operating system.\nProject Management \nÂ \nManaged complex BI/DW deployment programs, facilitating acquisition of business requirements.\nPrepared design specifications, developed reporting and analytics, tested and managed user adoption.\nWork Experience\nInformation Technology Consultant\n \nJanuary 2003\n \nto \nCurrent\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nSenior-level consultant and manager of IT systems and projects with over 10 years experience.\nPracticed successful design, administration, and development of business critical information systems for small to medium business clients\nonsite or via remote access technologies.\nWeb designer, developer and hosting administrator for over 30 client domains, sites, and email.\nConsistently recommend, implement, and customize internal or cloud-based technology systems to fit client business processes.\n\nFacilitate and develop email, file, database, mobile, and web-based systems to meet client business needs.\nAchieved increase in client's customer exposure by launching marketing and corporate branding campaigns including logo and website\ndesign and development, SEO, Google AdWords, and social media Created and maintained procedures for hardware and software\nmaintenance, migration, upgrades, and end-of-life Implementation and management of all high-level business technology projects Senior-\nlevel technical contact for client computer, network, server, and cloud-based systems Operations and technical specialist for consulting\nfirm's business-critical systems Worked closely with clients to analyze IT system requirements, clients information technology needs and their\nresources in order to plan IT projects and fulfill clients expectations Developed IT system specifications after evaluating customer's nature of\nwork and business volume Solved clients IT issues - Determined changes, recommended quality software, projected modifications of\nsoftware, hardware and networking.\nMonitored the execution of strategies, kept up to date with the new technology and researched latest Information technology market trends.\nAssisted clients with IT solutions; prepared written reports on solutions offered.\nRecommended the purchasing of new IT systems, presented new IT features/software and reported project progress to the management.\nPrepared and presented technical proposals for clients.Designed, documented and executed maintenance procedures, including system upgrades,\npatch management and system backups.\nSystems & Document Administrator\n \nJanuary 1998\n \nto \nJanuary 2003\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nKey senior-level member of the information systems team with a variety of duties including project management, document management and\npublishing, web design, print design, user training and systems administration.\nPromoted within two months of hire, again within the first two years and lastly promoted to a newly developed position.\nAchieved first global electronic submissions to regulatory agencies by implementing and validating an electronic document management and\npublishing system as the primary systems administrator, developer, and project technical leader.\nResulted in NDA submission to the FDA ahead of target deadline saving millions in revenue.\nImplemented and maintained application servers supporting secure Internet communications and business critical systems.\nCreated standard operating procedures, policies, development plans, disaster recovery, and other technical documentation in compliance\nwith FDA requirements Project technical lead for company ERP system, several ongoing department projects and managed temporary and\npart-time employees and consultants Webmaster and graphic designer for Internet and intranet sites, print advertising, multimedia, and\npresentation projects Maintained Mac desktop computers and software supporting DNA Sequencer and robotic systems.\nEducation and Training\nBachelor of Science\n \n: \nInformation Technology\n \n, \nJuly 2016\n \nUniversity of Phoenix\nInformation Technology[Number] GPA\nSkills\nACT!, Adobe, Acrobat, After Effects, Photoshop, Premiere, Apache, branding, business processes, C++, Cisco, Hardware, consultant,\nconsulting, CSS, client, clients, Database, Dell, disaster recovery, document management, Documentum, Dreamweaver, email, ERP, features,\nFireworks, Flash, FreeBSD, graphic designer, HP, HTML5, IBM, Illustrator, InDesign, information systems, Information technology, MS IIS,\nInternet communications, Java, JavaScript, Languages, Linux, logo, Mac, Apple Mac, marketing, market, access, MS Access, MS Exchange, MS\nOffice, Office, MS Project, Microsoft Windows, migration, multimedia, MySQL, network, networking, Operating Systems, OS, OS 7, Oracle,\ndeveloper, PHP, policies, print advertising, print design, progress, project management, purchasing, quality, Express, Red Hat, robotic systems,\nSage, servers, MS SQL, systems administration, user training, technical documentation, Unix, upgrades, Microsoft Visual Basic, website design\nand development, Web designer, web design, Webmaster, Workflow, written, XML",
  "processed": {
    "clean_text": "information technology consultant career overview accomplished information technology professional with over 18 years of diverse technology, process analysis, project management, and information management experience. proven ability to successfully implement technology solutions, stay within time and budget constraints, and improve efficiency through proper risk management, task coordination, and resource utilization. core competencies project management systems / network reporting proposal development web design  development sop  policy writing systems  process consulting document management technically-advanced information technology specialist successful in software administration and data communications.experienced computer systems analyst with diverse industry experience in banking, healthcare, insurance and government. professional expertise includes systems applications, disaster recovery planning and information protection analysis. qualifications microsoft windows (7, 8, 2012), apple mac (os 7 - x, os x server, ios), unix/linux (ubuntu, red hat, centos, freebsd, smoothwall express) server/web software: ms exchange, ms sharepoint, ms iis, ms hyper-v, apache, wordpress, cloudflare, documentum, coredossier, oracle workflow, davmail html5, css, php, javascript, java, xml, c, microsoft visual basic applications: adobe cs6 (acrobat, photoshop, illustrator, indesign, dreamweaver, premiere, flash, after effects, fireworks), ms office, ms project, office 365 mysql, ms sql, ms access, oracle 11i, sage act web content management information security content management systems hardware: dell, hp, ibm, cisco, sonicwall, netgear, fortigateprogramming and design skills optimizing and performance tuning document management web content management accomplishments print graphic support â collaborated with marketing and business development groups for collateral needs by creating page layout designs for flyers, data sheets, cd covers and other printed materials. requirements analysis â completed business requirements analysis including the evaluation of systems specifications for client web site two weeks ahead of deadline. it training â successfully trained 25 employees to use new operating system. project management â managed complex bi/dw deployment programs, facilitating acquisition of business requirements. prepared design specifications, developed reporting and analytics, tested and managed user adoption. work experience information technology consultant january 2003 to current company name ï¼ city , state senior-level consultant and manager of it systems and projects with over 10 years experience. practiced successful design, administration, and development of business critical information systems for small to medium business clients onsite or via remote access technologies. web designer, developer and hosting administrator for over 30 client domains, sites, and email. consistently recommend, implement, and customize internal or cloud-based technology systems to fit client business processes. facilitate and develop email, file, database, mobile, and web-based systems to meet client business needs. achieved increase in clients customer exposure by launching marketing and corporate branding campaigns including logo and website design and development, seo, google adwords, and social media created and maintained procedures for hardware and software maintenance, migration, upgrades, and end-of-life implementation and management of all high-level business technology projects senior- level technical contact for client computer, network, server, and cloud-based systems operations and technical specialist for consulting firms business-critical systems worked closely with clients to analyze it system requirements, clients information technology needs and their resources in order to plan it projects and fulfill clients expectations developed it system specifications after evaluating customers nature of work and business volume solved clients it issues - determined changes, recommended quality software, projected modifications of software, hardware and networking. monitored the execution of strategies, kept up to date with the new technology and researched latest information technology market trends. assisted clients with it solutions; prepared written reports on solutions offered. recommended the purchasing of new it systems, presented new it features/software and reported project progress to the management. prepared and presented technical proposals for clients.designed, documented and executed maintenance procedures, including system upgrades, patch management and system backups. systems  document administrator january 1998 to january 2003 company name ï¼ city , state key senior-level member of the information systems team with a variety of duties including project management, document management and publishing, web design, print design, user training and systems administration. promoted within two months of hire, again within the first two years and lastly promoted to a newly developed position. achieved first global electronic submissions to regulatory agencies by implementing and validating an electronic document management and publishing system as the primary systems administrator, developer, and project technical leader. resulted in nda submission to the fda ahead of target deadline saving millions in revenue. implemented and maintained application servers supporting secure internet communications and business critical systems. created standard operating procedures, policies, development plans, disaster recovery, and other technical documentation in compliance with fda requirements project technical lead for company erp system, several ongoing department projects and managed temporary and part-time employees and consultants webmaster and graphic designer for internet and intranet sites, print advertising, multimedia, and presentation projects maintained mac desktop computers and software supporting dna sequencer and robotic systems. education and training bachelor of science : information technology , july 2016 university of phoenix information technology[number] gpa skills act, adobe, acrobat, after effects, photoshop, premiere, apache, branding, business processes, c, cisco, hardware, consultant, consulting, css, client, clients, database, dell, disaster recovery, document management, documentum, dreamweaver, email, erp, features, fireworks, flash, freebsd, graphic designer, hp, html5, ibm, illustrator, indesign, information systems, information technology, ms iis, internet communications, java, javascript, languages, linux, logo, mac, apple mac, marketing, market, access, ms access, ms exchange, ms office, office, ms project, microsoft windows, migration, multimedia, mysql, network, networking, operating systems, os, os 7, oracle, developer, php, policies, print advertising, print design, progress, project management, purchasing, quality, express, red hat, robotic systems, sage, servers, ms sql, systems administration, user training, technical documentation, unix, upgrades, microsoft visual basic, website design and development, web designer, web design, webmaster, workflow, written, xml",
    "metadata": {
      "has_education": true,
      "years_experience": 10
    },
    "sections": {},
    "keywords": [
      "system",
      "management",
      "information",
      "technology",
      "project",
      "client",
      "design",
      "business",
      "web",
      "development",
      "technical",
      "document",
      "software",
      "consultant",
      "print",
      "requirement",
      "process",
      "analysis",
      "experience",
      "administration",
      "microsoft",
      "mac",
      "server",
      "office",
      "access",
      "hardware",
      "including",
      "training",
      "new",
      "designer"
    ]
  },
  "file_path": "/Users/proxim/Desktop/Automated-First-Screener-and-AI-Job-Matching-NLP-WebEngine/data/raw/resumes/r1e5e0.pdf"
}