{
  "id": "r259ae",
  "filename": "31243710.pdf",
  "upload_time": "17:35:15",
  "document_type": "resume",
  "original_text": "IT MANAGER\nSummary\nTen years of management experience with a focus on team building and project management. Ten years of experience as a network engineer and\nsystems administrator. The majority of my experience has been working with Microsoft, Dell, HP, IBM, Symantec, McAfee, Trend Micro and\nCisco hardware and software business solutions. I have extensive experience with Microsoft Exchange Server. I am comfortable with Cisco\ncommand line IOS, VoIP, QoS tagging, layer 2, 3 and 4 switching and packet shaping. I have used Fluke OptiView, Wireshark, NetFlow\nAnalyzer, Solarwinds Network Performance Monitor and SMS to assist me in the process of identifying network bottlenecks and performance\nissues. I have experience in business, education, medical and manufacturing environments. Recently, I have been working a great deal with Hyper-\nV, VMware and data loss prevention software.\nHighlights\nSoftware Symantec Backup Exec, System Recovery, Endpoint Protection, Trend Micro, McAfee, \nESET, \nAcronis,\nShadowProtect, GFI, Crow Canyon, DameWare, Wireshark, NetFlow Analyzer, Splunk, SMS, Fluke OptiView,\nSolarwinds NPM, Microsoft Response Point, GP, CRM and SharePoint,\nDatabases SQL, MySQL\nHardware Servers, workstations, laptops, printers, smart phones, routers, switches, firewalls, wireless access\npoints, LTO autoloaders, CCTV, PBX and IP phone systems, biometric scanners and readers\nApplications Apache, IIS, Cisco ASDM, Cisco VPN Client, MAS 90, Sage Medical Manager, BrainTree\nPACS/C-Arm, VMware, Citrix, SmartFilter, Imail, Websense, iPrism Web Security, Hyper-V, SonicWall Global\nVPN Client, Adobe, Foxit Phantom PDF, JobBOSS, Made2Manage ERP, Word, Excel, Access\nIndustries Business, Manufacturing, Education and Medical\nOperating Systems Windows 2000 Server, Server 2003, Server 2008, Server 2012, Exchange Server(2000,\n2003, 2007, 2010, 2013 & associated migration tools), Cisco IOS, Linux, Mac OS\nMethodologies project management, system analysis and design, business process flow\nDatabase\nmaintenance\nSystem checks\nand\ntroubleshooting\nAdvanced\ntroubleshooting\nVirus and\nspyware\nremoval\nComputer\ndiagnostics and\nrepair\nServer\nmanagement\nHardware\nsupport and\ntroubleshooting\nHighly\nmotivated\nResourceful\nAdvanced\nknowledge of\ndiagnostic\ntechniques\nAdvanced\nknowledge of\nsecurity,\nfirewalls and\nDLP\nAccomplishments\nSaved company over $\n 50,000.00 per year\n \nby refurbishing used computers and technological equipment and switching Internet providers from T1\nlines to cable.\nExperience\nIT Manager\n \n, \n07/2012\n \n- \nCurrent\n \nCompany Name\n \n- \nCity\n \n, \nState\nServer installations and migrations, SonicWall firewalls, VPN installation and support, wireless access points, multilayer switches, routers,\nhelp desk support for 3 sites, multi-mode fiber, Microsoft Exchange Server, Server 2012, Hyper-V installation and support, Windows XP\nmode, Windows 7, Windows 8, \nSharePoint, Microsoft Dynamics GP/CRM, Project Server, SQL, Macola, CCTV, time and attendance\nhardware and software, biometric reader installation and support, Syspine IP, Microsoft Response Point, VoIP, Creo Pro/E, Windchill,\nSolidWorks, QuickBooks Enterprise, McAfee SaaS, network security, disaster recovery, infrastructure design and support, network\nhardware and software troubleshooting, administration of user accounts, responsible for developing annual IT budget, responsible for IT\nproject management.\nAdministration of group policy, Active Directory, help desk support, Hyper-V, DLP.\nInformation Technology Engineer\n \n, \n10/2008\n \n- \n07/2012\n \nCompany Name\n \n- \nCity\n \n, \nState\nServer installations and migrations, migration of databases, Exchange Server, SQL, MySQL.\nCisco PIX and ASA 5505 installation and support, \nnetwork security, wireless hardware, installation and support of Symantec Backup Exec\nand Endpoint Protection, Mac OS, help desk support for multiple sites, phone system and VoIP support.\nAdministration of group policy, Active Directory, DHCP, DNS, hardware and software troubleshooting, upgrades and migrations of legacy\nsoftware packages.\nSenior Network Engineer\n \n, \n10/2007\n \n- \n06/2008\n \nCompany Name\n \n- \nCity\n \n, \nState\nServer installations and migrations, databases, Exchange Server, SQL, MySQL.\n\nServer installations and migrations, databases, Exchange Server, SQL, MySQL.\nHP servers, Secure Computing Webwashers, Snapgear firewall/VPN appliances, Cisco switches, Trend Micro products, Symantec\nproducts, network security, wireless installation and support, virtual machines, help desk support for multiple sites, phone system and VoIP\nsupport.\nAdministration of group policy, Active Directory, DHCP, DNS, end user support.\nInformation Technology Engineer\n \n, \n03/2005\n \n- \n10/2007\n \nCompany Name\n \n- \nCity\n \n, \nState\nServer installations and migrations, migration of databases, MAS 90, SQL, MySQL.\nCisco 1721, 2800 and 3600 series routers, Cisco Catalyst 2900 and 3100 series switches, HP ProCurve switches, \nSymantec products,\nnetwork security, wireless installation, iSCSI NAS/SAN (Intel hardware), media servers, terminal server applications, BrainTree PACS and\nC-Arm, biometric readers, time and attendance installation and support, help desk and end user support for 7 sites.\nAdministration of group policy, Active Directory, DHCP, DNS, VPN tunnels, ftp servers, Sage Medical Manager, VoIP, QoS, layer 3 and\n4 switching, Cisco Aironet access points, Toshiba hybrid PBX and VoIP phone system and QoS support, HIPAA compliance, media\nservers, iSCSI, fibre channel, SAN and NAS design, installation and support.\nAssistant Professor\n \n, \n08/2000\n \n- \n07/2005\n \nCompany Name\n \n- \nCity\n \n, \nState\nProgram Chair for Region 2 (South Bend, Elkhart and Warsaw Server installations, teaching A+, Network+, Microsoft MCSA and Cisco\nCCNA classes, programming routers, switches and installing and configuring Windows 2000 server and Server 2003.\nSupervised all Computer Information Systems faculty, staff and adjunct instructors for all three sites in Region 2, hardware/software\ntroubleshooting and support.\nAdministration of group policy, Active Directory, FERPA compliance.\nEducation\nDavenport University\n \n- \nCity\n \n, \nState\n \n, \nUSA\n \nInformation Technology Certification Classes\n \nNetwork Engineering\n \nA+, Network+, MCSA, CCNA,\nOperating Systems, Business Applications, Network Engineering\n1988\n \nWestern Michigan University\n \n- \nCity\n \n, \nState\n \n, \nUSA\n \nM.A\n \nCounselor Education and Counseling Psychology\n \nAdministration of Student\nPersonnel Services and Counseling in Post-Secondary Education\n1985\n \nIndiana University\n \n- \nCity\n \n, \nState\n \n, \nUSA\n \nB.A\n \nSociology\n \nSociology and Psychology\nIvy Tech Community College\n \n- \nCity\n \n, \nState\n \n, \nUSA\n \nInformation Technology Certification Classes\n \nCisco CCNA\n \nCisco Switching and Routing\nCertifications\nCompTIA \nA+, Network+, Microsoft MCP (70-210 and 70-215), previously certified as Cisco CCNA\nSkills\nA+, Active Directory, Adobe, Apache, Backup Exec, budget, business process, C, CCNA, Cisco IOS, Cisco, Citrix, Hardware, CRM, Client,\nDatabases, DHCP, disaster recovery, DNS, ERP, firewalls, firewall, ftp, help desk support, help desk, HP, HP servers, IIS, Information Systems,\nIntel, IP, IT project management, laptops, Linux, Mac OS, Macola, MAS 90, McAfee, Medical Manager, Access, MCP, Microsoft Dynamics,\nExcel, Exchange Server, Microsoft Exchange Server, SharePoint, Windows 7, Windows 8, 2000, Windows XP, Word, migration, MySQL,\nEnterprise, NAS, Network Engineering, network hardware, network security, Network, Operating Systems, PACS, PBX, PDF, phone system,\nphone systems, printers, programming, project management, QuickBooks, routers, Sage, SAN, scanners, Servers, SMS, software\ntroubleshooting, SolidWorks, SQL, Supervising, switches, Cisco switches, Symantec, system analysis and design, teaching, user support, phones,\nterminal server, Toshiba, Trend, upgrades, VPN, VoIP, Windows 2000 Server",
  "processed": {
    "clean_text": "it manager summary ten years of management experience with a focus on team building and project management. ten years of experience as a network engineer and systems administrator. the majority of my experience has been working with microsoft, dell, hp, ibm, symantec, mcafee, trend micro and cisco hardware and software business solutions. i have extensive experience with microsoft exchange server. i am comfortable with cisco command line ios, voip, qos tagging, layer 2, 3 and 4 switching and packet shaping. i have used fluke optiview, wireshark, netflow analyzer, solarwinds network performance monitor and sms to assist me in the process of identifying network bottlenecks and performance issues. i have experience in business, education, medical and manufacturing environments. recently, i have been working a great deal with hyper- v, vmware and data loss prevention software. highlights software symantec backup exec, system recovery, endpoint protection, trend micro, mcafee, eset, acronis, shadowprotect, gfi, crow canyon, dameware, wireshark, netflow analyzer, splunk, sms, fluke optiview, solarwinds npm, microsoft response point, gp, crm and sharepoint, databases sql, mysql hardware servers, workstations, laptops, printers, smart phones, routers, switches, firewalls, wireless access points, lto autoloaders, cctv, pbx and ip phone systems, biometric scanners and readers applications apache, iis, cisco asdm, cisco vpn client, mas 90, sage medical manager, braintree pacs/c-arm, vmware, citrix, smartfilter, imail, websense, iprism web security, hyper-v, sonicwall global vpn client, adobe, foxit phantom pdf, jobboss, made2manage erp, word, excel, access industries business, manufacturing, education and medical operating systems windows 2000 server, server 2003, server 2008, server 2012, exchange server(2000, 2003, 2007, 2010, 2013  associated migration tools), cisco ios, linux, mac os methodologies project management, system analysis and design, business process flow database maintenance system checks and troubleshooting advanced troubleshooting virus and spyware removal computer diagnostics and repair server management hardware support and troubleshooting highly motivated resourceful advanced knowledge of diagnostic techniques advanced knowledge of security, firewalls and dlp accomplishments saved company over  50,000.00 per year by refurbishing used computers and technological equipment and switching internet providers from t1 lines to cable. experience it manager , 07/2012 - current company name - city , state server installations and migrations, sonicwall firewalls, vpn installation and support, wireless access points, multilayer switches, routers, help desk support for 3 sites, multi-mode fiber, microsoft exchange server, server 2012, hyper-v installation and support, windows xp mode, windows 7, windows 8, sharepoint, microsoft dynamics gp/crm, project server, sql, macola, cctv, time and attendance hardware and software, biometric reader installation and support, syspine ip, microsoft response point, voip, creo pro/e, windchill, solidworks, quickbooks enterprise, mcafee saas, network security, disaster recovery, infrastructure design and support, network hardware and software troubleshooting, administration of user accounts, responsible for developing annual it budget, responsible for it project management. administration of group policy, active directory, help desk support, hyper-v, dlp. information technology engineer , 10/2008 - 07/2012 company name - city , state server installations and migrations, migration of databases, exchange server, sql, mysql. cisco pix and asa 5505 installation and support, network security, wireless hardware, installation and support of symantec backup exec and endpoint protection, mac os, help desk support for multiple sites, phone system and voip support. administration of group policy, active directory, dhcp, dns, hardware and software troubleshooting, upgrades and migrations of legacy software packages. senior network engineer , 10/2007 - 06/2008 company name - city , state server installations and migrations, databases, exchange server, sql, mysql. server installations and migrations, databases, exchange server, sql, mysql. hp servers, secure computing webwashers, snapgear firewall/vpn appliances, cisco switches, trend micro products, symantec products, network security, wireless installation and support, virtual machines, help desk support for multiple sites, phone system and voip support. administration of group policy, active directory, dhcp, dns, end user support. information technology engineer , 03/2005 - 10/2007 company name - city , state server installations and migrations, migration of databases, mas 90, sql, mysql. cisco 1721, 2800 and 3600 series routers, cisco catalyst 2900 and 3100 series switches, hp procurve switches, symantec products, network security, wireless installation, iscsi nas/san (intel hardware), media servers, terminal server applications, braintree pacs and c-arm, biometric readers, time and attendance installation and support, help desk and end user support for 7 sites. administration of group policy, active directory, dhcp, dns, vpn tunnels, ftp servers, sage medical manager, voip, qos, layer 3 and 4 switching, cisco aironet access points, toshiba hybrid pbx and voip phone system and qos support, hipaa compliance, media servers, iscsi, fibre channel, san and nas design, installation and support. assistant professor , 08/2000 - 07/2005 company name - city , state program chair for region 2 (south bend, elkhart and warsaw server installations, teaching a, network, microsoft mcsa and cisco ccna classes, programming routers, switches and installing and configuring windows 2000 server and server 2003. supervised all computer information systems faculty, staff and adjunct instructors for all three sites in region 2, hardware/software troubleshooting and support. administration of group policy, active directory, ferpa compliance. education davenport university - city , state , usa information technology certification classes network engineering a, network, mcsa, ccna, operating systems, business applications, network engineering 1988 western michigan university - city , state , usa m.a counselor education and counseling psychology administration of student personnel services and counseling in post-secondary education 1985 indiana university - city , state , usa b.a sociology sociology and psychology ivy tech community college - city , state , usa information technology certification classes cisco ccna cisco switching and routing certifications comptia a, network, microsoft mcp (70-210 and 70-215), previously certified as cisco ccna skills a, active directory, adobe, apache, backup exec, budget, business process, c, ccna, cisco ios, cisco, citrix, hardware, crm, client, databases, dhcp, disaster recovery, dns, erp, firewalls, firewall, ftp, help desk support, help desk, hp, hp servers, iis, information systems, intel, ip, it project management, laptops, linux, mac os, macola, mas 90, mcafee, medical manager, access, mcp, microsoft dynamics, excel, exchange server, microsoft exchange server, sharepoint, windows 7, windows 8, 2000, windows xp, word, migration, mysql, enterprise, nas, network engineering, network hardware, network security, network, operating systems, pacs, pbx, pdf, phone system, phone systems, printers, programming, project management, quickbooks, routers, sage, san, scanners, servers, sms, software troubleshooting, solidworks, sql, supervising, switches, cisco switches, symantec, system analysis and design, teaching, user support, phones, terminal server, toshiba, trend, upgrades, vpn, voip, windows 2000 server",
    "metadata": {
      "has_education": true
    },
    "sections": {},
    "keywords": [
      "server",
      "support",
      "network",
      "cisco",
      "system",
      "installation",
      "microsoft",
      "hardware",
      "migration",
      "window",
      "city",
      "state",
      "software",
      "exchange",
      "phone",
      "switch",
      "management",
      "voip",
      "database",
      "sql",
      "security",
      "troubleshooting",
      "help",
      "desk",
      "administration",
      "experience",
      "project",
      "symantec",
      "business",
      "mysql"
    ]
  },
  "file_path": "/Users/proxim/Desktop/Automated-First-Screener-and-AI-Job-Matching-NLP-WebEngine/data/raw/resumes/r259ae.pdf"
}