{
  "id": "r27ea8",
  "filename": "15651486.pdf",
  "upload_time": "17:35:26",
  "document_type": "resume",
  "original_text": "DIRECTOR OF INFORMATION TECHNOLOGY\nCareer Overview\nSeeking a position as a Director of I.T. in a company where I am able to utilize my experience and training in networking, troubleshooting, and\ncustomer relations.\nQualifications\nNetworking - Nexus 7K, UCS, UCCX, Cisco Call Manager, Cisco Unity, Cisco Attendant Console, Cisco Jabber, Cisco ASA, Cisco\nISE, Cisco ACS, Cisco Voip, Cisco Routers, Cisco Switches, Cisco Wireless Controllers, Cisco Wireless Access Points, Cisco\nIronPort, Juniper Firewall,\nOperating Systems - Windows Server 2003/2008/2012, SCO Unix, SUSE Linux, Windows XP/Vista/7/10, Cisco IOS\nHardware - Dell PowerEdge servers, IBM Bladecenter, Dell/HP/Lenovo PC & Laptops, Cisco/Juniper/Fortinet switches,\nBarracuda/Juniper Spam & Web firewall, POS, Label Printers, Barcode Scanners, RF Scanners\nSoftware - MAS90, Office 2007/2010/2013/2016, VMware, Groupwise, Exchange 2007, Aldon, Remedy, Putty, SecureCRT, VNC,\nWireShark, Snorby, SolarWinds Orion, SQL Database, Epicor (ERP),\nSecurity - Nexpose (Rapid7), Snort, Snorby, Symantec, Trustwave, PCI Compliance\n CISCO Certified Network Associate (CCNA)\nWork Experience\n01/2015\n \nto \nCurrent\nDirector of Information Technology\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nServes as the main point of contact on all I.T.\nrelated matters.\nLocated at the corporate headquarters supporting over 60 users locally and 150 users remotely.\nWorked with service providers and vendors cutting IT budget over 45%.\nImplemented new MPLS network and Phone system saving the company 180k a year.\nOversees all IT financials.\nEstablished an IT Governance department to focus on managing systems quality assurance, PCI security, and audit change management, IT\npurchasing and administration, IT contracts and vendor management, and IT financial capital and expense management.\nIdentifying and providing standards for gathering information for use in trend analysis and reporting information to company leaders.\n01/2013\n \nto \n01/2015\nNetwork Engineer/I.T. Manager\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nSupervised and led IT infrastructure team (including Help Desk).\nWorked with service providers and vendors cutting IT budget over 15%.\nManaged and designed IT security solutions and policies for all locations.\nOversaw data center operations being hands on in all areas related to infrastructure and security.\nLocated at corporate headquarters supporting over 200 users locally and 1500 users remotely.\nManage local/wide area networks for optimal data and VoIP connectivity to over 300 sites including 3 warehouses, 1 corp office and 1 co-\nlocation.\nServed as lead network engineer in network (WAN, LAN, VoIP) problems and emergencies.\nTroubleshoot and resolve network production problems.\nDocument network problems and resolutions for future reference.\nConduct technical research on network upgrades and components to determine feasibility, cost, time required and compatibility with current\nsystem.\nManage/troubleshoot Cisco UC systems including third party integration and mobile chat/video clients.\nWorked as lead network engineer with system administrators in setup of hardware/software networking modules for production and\ndevelopment environments.\nMaintained/optimized Cisco ASA/IDS/ISE/ACS/Nexus 7K/UCCX/Cisco Call Manager/Cisco Unity/Cisco Attendant Console/Cisco\nJabber/Cisco Contact Center Express/Cisco Prime/WCS to ensure network stability and maximum uptime.\nEstablishes network specifications by conferring with users; analyzing workflow, access, information and security requirements, designing\nrouter and firewall administration, interface configurations and routing protocols.\nEnsured interoperability between vendor specific hardware/applications for network access/usage.\nVPN/SSL VPN).\n01/2010\n \nto \n01/2013\nNetwork Administrator/Help Desk Manager\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nServed as technical specialist in network problems and emergencies.\nTroubleshoot and resolve network production problems.\nConduct technical research on network upgrades and components to determine feasibility, cost, time required and compatibility with current\nsystem.\nDocument network problems and resolutions for future reference.\nManage local/wide area networks for optimal data and VoIP connectivity to over 300 sites including 3 warehouses, 1 corp office and 1 co-\nlocation.\nAdministers/troubleshoot Cisco UC systems including third party integration and mobile chat/video clients.\nProvide data and reporting of KPI's and trends to IT department and others in ad-hoc, weekly, monthly and as needed.\n\nCoordinates with system engineers in setup of hardware/software networking modules for production and development environments.\nEnsures interoperability between vendor specific hardware/applications for network access/usage.\nVPN/SSL VPN).\nAssisted in the deployment of Nexus 7.\n01/2010\nHelp Desk Analyst\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nProvided help desk support for over 7,000 Taco Bell stores.\nTroubleshoot all issues dealing with the P.O.S., TACO computer, and all the connections in the store.\nLog all calls in Remedy(software), follow up on all calls that weren't resolved, and we \nused Putty(software) to access the back end of their\ncomputer.\n01/2009\nHelp Desk Support/IT Technician/Network Admin\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nProvided first level help desk IT support in a 300 user environment spanning over 15 remote sites.\nTroubleshoot hardware, software and connectivity issues for a mixed Windows 2003/2008 Server, mixed Linux , XP desktop environment,\nCisco routers, and Cisco Switches.\nInstalled, repaired, maintained and upgraded desktop/notebook computers; pre-configured cisco routers, cisco switches, network printers\nand troubleshoot printer failures.\nWeb filter administrator/Barracuda.\nEducation and Training\nB.S\n \n: \nComputer Networking Systems\n \nITT Technical Institute\n \nï¼​ \nCity\n \n, \nState\n \nComputer Networking Systems\nSkills\nad, budget, change management, Cisco IOS, Cisco, Cisco Routers, Hardware, contracts, clients, Database, Dell, Dell PowerEdge servers,\ndesigning, ERP, financials, financial, Firewall, focus, Groupwise, help desk support, Help Desk, HP, IBM, IDS, IT support, LAN, Laptops,\nnotebook computers, Linux, managing, MAS90, Access, Exchange, Office, Windows, Windows XP, network engineer, network printers,\nnetwork, Networking, networks, Operating Systems, PCI, Phone system, policies, POS, Prime, printer, Printers, protocols, purchasing, quality\nassurance, Express, reporting, research, router, routing, Scanners, SCO Unix, SQL, SSL, switches, Cisco Switches, Symantec, trend,\nTroubleshoot, upgrades, vendor management, video, VPN, Vista, VoIP, WAN, Windows Server, workflow",
  "processed": {
    "clean_text": "director of information technology career overview seeking a position as a director of i.t. in a company where i am able to utilize my experience and training in networking, troubleshooting, and customer relations. qualifications networking - nexus 7k, ucs, uccx, cisco call manager, cisco unity, cisco attendant console, cisco jabber, cisco asa, cisco ise, cisco acs, cisco voip, cisco routers, cisco switches, cisco wireless controllers, cisco wireless access points, cisco ironport, juniper firewall, operating systems - windows server 2003/2008/2012, sco unix, suse linux, windows xp/vista/7/10, cisco ios hardware - dell poweredge servers, ibm bladecenter, dell/hp/lenovo pc  laptops, cisco/juniper/fortinet switches, barracuda/juniper spam  web firewall, pos, label printers, barcode scanners, rf scanners software - mas90, office 2007/2010/2013/2016, vmware, groupwise, exchange 2007, aldon, remedy, putty, securecrt, vnc, wireshark, snorby, solarwinds orion, sql database, epicor (erp), security - nexpose (rapid7), snort, snorby, symantec, trustwave, pci compliance cisco certified network associate (ccna) work experience 01/2015 to current director of information technology company name ï¼ city , state serves as the main point of contact on all i.t. related matters. located at the corporate headquarters supporting over 60 users locally and 150 users remotely. worked with service providers and vendors cutting it budget over 45. implemented new mpls network and phone system saving the company 180k a year. oversees all it financials. established an it governance department to focus on managing systems quality assurance, pci security, and audit change management, it purchasing and administration, it contracts and vendor management, and it financial capital and expense management. identifying and providing standards for gathering information for use in trend analysis and reporting information to company leaders. 01/2013 to 01/2015 network engineer/i.t. manager company name ï¼ city , state supervised and led it infrastructure team (including help desk). worked with service providers and vendors cutting it budget over 15. managed and designed it security solutions and policies for all locations. oversaw data center operations being hands on in all areas related to infrastructure and security. located at corporate headquarters supporting over 200 users locally and 1500 users remotely. manage local/wide area networks for optimal data and voip connectivity to over 300 sites including 3 warehouses, 1 corp office and 1 co- location. served as lead network engineer in network (wan, lan, voip) problems and emergencies. troubleshoot and resolve network production problems. document network problems and resolutions for future reference. conduct technical research on network upgrades and components to determine feasibility, cost, time required and compatibility with current system. manage/troubleshoot cisco uc systems including third party integration and mobile chat/video clients. worked as lead network engineer with system administrators in setup of hardware/software networking modules for production and development environments. maintained/optimized cisco asa/ids/ise/acs/nexus 7k/uccx/cisco call manager/cisco unity/cisco attendant console/cisco jabber/cisco contact center express/cisco prime/wcs to ensure network stability and maximum uptime. establishes network specifications by conferring with users; analyzing workflow, access, information and security requirements, designing router and firewall administration, interface configurations and routing protocols. ensured interoperability between vendor specific hardware/applications for network access/usage. vpn/ssl vpn). 01/2010 to 01/2013 network administrator/help desk manager company name ï¼ city , state served as technical specialist in network problems and emergencies. troubleshoot and resolve network production problems. conduct technical research on network upgrades and components to determine feasibility, cost, time required and compatibility with current system. document network problems and resolutions for future reference. manage local/wide area networks for optimal data and voip connectivity to over 300 sites including 3 warehouses, 1 corp office and 1 co- location. administers/troubleshoot cisco uc systems including third party integration and mobile chat/video clients. provide data and reporting of kpis and trends to it department and others in ad-hoc, weekly, monthly and as needed. coordinates with system engineers in setup of hardware/software networking modules for production and development environments. ensures interoperability between vendor specific hardware/applications for network access/usage. vpn/ssl vpn). assisted in the deployment of nexus 7. 01/2010 help desk analyst company name ï¼ city , state provided help desk support for over 7,000 taco bell stores. troubleshoot all issues dealing with the p.o.s., taco computer, and all the connections in the store. log all calls in remedy(software), follow up on all calls that werent resolved, and we used putty(software) to access the back end of their computer. 01/2009 help desk support/it technician/network admin company name ï¼ city , state provided first level help desk it support in a 300 user environment spanning over 15 remote sites. troubleshoot hardware, software and connectivity issues for a mixed windows 2003/2008 server, mixed linux , xp desktop environment, cisco routers, and cisco switches. installed, repaired, maintained and upgraded desktop/notebook computers; pre-configured cisco routers, cisco switches, network printers and troubleshoot printer failures. web filter administrator/barracuda. education and training b.s : computer networking systems itt technical institute ï¼ city , state computer networking systems skills ad, budget, change management, cisco ios, cisco, cisco routers, hardware, contracts, clients, database, dell, dell poweredge servers, designing, erp, financials, financial, firewall, focus, groupwise, help desk support, help desk, hp, ibm, ids, it support, lan, laptops, notebook computers, linux, managing, mas90, access, exchange, office, windows, windows xp, network engineer, network printers, network, networking, networks, operating systems, pci, phone system, policies, pos, prime, printer, printers, protocols, purchasing, quality assurance, express, reporting, research, router, routing, scanners, sco unix, sql, ssl, switches, cisco switches, symantec, trend, troubleshoot, upgrades, vendor management, video, vpn, vista, voip, wan, windows server, workflow",
    "metadata": {
      "has_education": true
    },
    "sections": {},
    "keywords": [
      "cisco",
      "network",
      "system",
      "company",
      "desk",
      "networking",
      "help",
      "router",
      "switch",
      "window",
      "printer",
      "city",
      "state",
      "user",
      "vendor",
      "problem",
      "troubleshoot",
      "computer",
      "information",
      "voip",
      "server",
      "security",
      "name",
      "management",
      "including",
      "call",
      "access",
      "firewall",
      "software",
      "office"
    ]
  },
  "file_path": "/Users/proxim/Desktop/Automated-First-Screener-and-AI-Job-Matching-NLP-WebEngine/data/raw/resumes/r27ea8.pdf"
}