{
  "id": "r284a6",
  "filename": "27770859.pdf",
  "upload_time": "17:35:17",
  "document_type": "resume",
  "original_text": "INFORMATION TECHNOLOGY ADMINISTRATOR\nProfessional Profile\nI am a jack of all trades IT guy at one of the premier intellectual property law schools in the world, whose job description and responsibilities\ncontinue to evolve with the ever-changing opportunities that new technology provides. Extremely self-motivated, detail oriented, and organized, I\nthrive most when presented with opportunities to creatively solve new and interesting challenges.\nQualifications\nSystems administration\nStrong verbal and written communication\nVast help desk experience\nTeam leadership\nNetwork administration\nExtensive knowledge of Apple products\nProject management\nInnovative legal experience\nExperience\nCompany Name\n \nCity\n \n, \nState\n \nInformation Technology Administrator\n \n09/2014\n \nto \nCurrent\nI oversee the purchasing, management, and maintenance of all infrastructure-related hardware and software, while simultaneously overseeing\nend-user hardware and software support for a law school with roughly 85 FTE faculty/staff, and 275 students with a roughly 1:1 PC:Mac\nuser ratio.\nI work closely with the Durham campus, all IT vendors, and our BSC office to develop and manage the IT budget, including all IT-related\nservice and maintenance contracts, while also developing and maintaining IT policies as they relate to law school operations and academics.\nDuties include managing a 5-host, 40-server VMWare farm, help desk system, network monitoring system, campus-wide physical/building\nsecurity system, ID card system, printing infrastructure, electronic exam system, backing up all critical data on the UNH Law network, and\nadministering a plethora of fileservers, webservers and web applications, including various content management systems.\nI work with system administrators in Durham to design and maintain the entire network on the Concord campus.\nExtensive knowledge installing and supporting various server platforms, including Windows, linux, Mac OS Server.\nCompany Name\n \nCity\n \n, \nState\n \nAssociate Director of Computer Services\n \n07/2000\n \nto \n09/2014\nPrimary responsibilities included the day-to-day support of end-user hardware, software, and peripherals in a mixed Microsoft Windows,\nMac OS X, linux, and Novell environment, while also assisting with the everyday demands of maintaining a rather complex campus-wide\nnetwork that was driven by a predominately Cisco infrastructure.\nReported directly to, and served as the immediate backup for the Director of Computer Services.\nDesigned and implemented the first ever wireless network on campus, which I administered and upgraded through three different platform\nchanges over the course of thirteen years.\nPlanned and administered the campus upgrade initiatives from Windows 98 to Windows XP, Windows XP to Windows 7, and numerous\nMac OS and iOS version upgrades.\nAfter Franklin Pierce Law Center integrated with UNH, I developed the plan for and administered the transition from a predominately\nNovell-based infrastructure to a predominately Microsoft-based infrastructure, including transitioning our e-mail platform from Novell\nGroupWise to Microsoft Exchange.\nCompany Name\n \nCity\n \n, \nState\n \nDistrict Computer Technician\n \n08/1999\n \nto \n07/2000\nI supported all end-user related hardware and software demands for the entire school district.\nDuties ranged from day-to-day troubleshooting to implementing new technologies, such as the first ever Apple Airport WiFi network and\nroaming iBook lab.\nCompany Name\n \nCity\n \n, \nState\n \nElectrician's Apprentice\n \n06/1990\n \nto \n07/1999\nPredominately industrial electrical work, mostly in a manufacturing setting, with some residential work mixed in.\nEducation\nBachelor of Science\n \n:\n \nExercise and Sports Sciences\n \n1999\n \nColby-Sawyer College\n \n, \nCity\n \n, \nState\n \n, \nUSA\nSkills\nPlatforms and protocols: Microsoft Windows, Microsoft Windows Server, Microsoft Active Directory, Microsoft Group Policy, Microsoft Office\nfor Windows and Mac, Microsoft Exchange, Mac OS X, Mac OS X Server, Apple iOS, Android, CentOS, SUSE Enterprise Server, Novell\nNetware, Novell eDirectory, Novell GroupWise, Novell Open Enterprise Server, Novell Datasync/Mobility Server, Novell Teaming, Novell\nZenworks, Novell Zenworks Configuration Management, Adobe Acrobat, Adobe Connect Pro, Apache, OpenSSL, IIS, MYSQL, PHP,\nHTML, SSL, LDAP, DHCP, BIND, DNS, TCP/IP\nAppliances and applications: Drupal, Expression Engine, Aerohive, Bluesocket Wireless Controller, Barracuda Anti-Spam Appliance, Barracuda\nWeb Filter, BarracudaWare, SonicWall NSA (including VPN), 3Com NBX, Avaya, Cisco PIX, Cisco Network Assistant, Blackberry Enterprise\nServer, VMWare ESX, VMWare Fusion, Pharos Uniprint, NTop, Nagios, NagiosQL, Icinga, Cacti, RealChat, MRBS, WebCalendar. vBulletin,\nMovable Type, WordPress, MediaWiki, Gallery2, Gallery3, SIMPLE, Joomla, Moodle, Mailman, EMS Campus, EMS Master Calendar, Virtual\nEMS, C-Cure, Remedy, TeamDynamix\nExtensive hardware knowledge and experience, especially with Apple, Micron, Lenovo, Dell, HP Laserjets, Canon MFDs, and Xerox MFDs. \nSalary History\nUniversity of New Hampshire School of Law, formerly Franklin Pierce Law Center\n2 White Street\n\nConcord, NH 03301\nAssociate Director of Computer Services\n07/2000-09/2014\nStarting Salary: $31,500\nEnding Salary: $54,000\nUniversity of New Hampshire School of Law, formerly Franklin Pierce Law Center\n2 White Street\nConcord, NH 03301\nInformation Technology Administrator\n09/2000-Present\nStarting Salary: $62,300\nEnding Salary: $62,300",
  "processed": {
    "clean_text": "information technology administrator professional profile i am a jack of all trades it guy at one of the premier intellectual property law schools in the world, whose job description and responsibilities continue to evolve with the ever-changing opportunities that new technology provides. extremely self-motivated, detail oriented, and organized, i thrive most when presented with opportunities to creatively solve new and interesting challenges. qualifications systems administration strong verbal and written communication vast help desk experience team leadership network administration extensive knowledge of apple products project management innovative legal experience experience company name city , state information technology administrator 09/2014 to current i oversee the purchasing, management, and maintenance of all infrastructure-related hardware and software, while simultaneously overseeing end-user hardware and software support for a law school with roughly 85 fte faculty/staff, and 275 students with a roughly 1:1 pc:mac user ratio. i work closely with the durham campus, all it vendors, and our bsc office to develop and manage the it budget, including all it-related service and maintenance contracts, while also developing and maintaining it policies as they relate to law school operations and academics. duties include managing a 5-host, 40-server vmware farm, help desk system, network monitoring system, campus-wide physical/building security system, id card system, printing infrastructure, electronic exam system, backing up all critical data on the unh law network, and administering a plethora of fileservers, webservers and web applications, including various content management systems. i work with system administrators in durham to design and maintain the entire network on the concord campus. extensive knowledge installing and supporting various server platforms, including windows, linux, mac os server. company name city , state associate director of computer services 07/2000 to 09/2014 primary responsibilities included the day-to-day support of end-user hardware, software, and peripherals in a mixed microsoft windows, mac os x, linux, and novell environment, while also assisting with the everyday demands of maintaining a rather complex campus-wide network that was driven by a predominately cisco infrastructure. reported directly to, and served as the immediate backup for the director of computer services. designed and implemented the first ever wireless network on campus, which i administered and upgraded through three different platform changes over the course of thirteen years. planned and administered the campus upgrade initiatives from windows 98 to windows xp, windows xp to windows 7, and numerous mac os and ios version upgrades. after franklin pierce law center integrated with unh, i developed the plan for and administered the transition from a predominately novell-based infrastructure to a predominately microsoft-based infrastructure, including transitioning our e-mail platform from novell groupwise to microsoft exchange. company name city , state district computer technician 08/1999 to 07/2000 i supported all end-user related hardware and software demands for the entire school district. duties ranged from day-to-day troubleshooting to implementing new technologies, such as the first ever apple airport wifi network and roaming ibook lab. company name city , state electricians apprentice 06/1990 to 07/1999 predominately industrial electrical work, mostly in a manufacturing setting, with some residential work mixed in. education bachelor of science : exercise and sports sciences 1999 colby-sawyer college , city , state , usa skills platforms and protocols: microsoft windows, microsoft windows server, microsoft active directory, microsoft group policy, microsoft office for windows and mac, microsoft exchange, mac os x, mac os x server, apple ios, android, centos, suse enterprise server, novell netware, novell edirectory, novell groupwise, novell open enterprise server, novell datasync/mobility server, novell teaming, novell zenworks, novell zenworks configuration management, adobe acrobat, adobe connect pro, apache, openssl, iis, mysql, php, html, ssl, ldap, dhcp, bind, dns, tcp/ip appliances and applications: drupal, expression engine, aerohive, bluesocket wireless controller, barracuda anti-spam appliance, barracuda web filter, barracudaware, sonicwall nsa (including vpn), 3com nbx, avaya, cisco pix, cisco network assistant, blackberry enterprise server, vmware esx, vmware fusion, pharos uniprint, ntop, nagios, nagiosql, icinga, cacti, realchat, mrbs, webcalendar. vbulletin, movable type, wordpress, mediawiki, gallery2, gallery3, simple, joomla, moodle, mailman, ems campus, ems master calendar, virtual ems, c-cure, remedy, teamdynamix extensive hardware knowledge and experience, especially with apple, micron, lenovo, dell, hp laserjets, canon mfds, and xerox mfds. salary history university of new hampshire school of law, formerly franklin pierce law center 2 white street concord, nh 03301 associate director of computer services 07/2000-09/2014 starting salary: 31,500 ending salary: 54,000 university of new hampshire school of law, formerly franklin pierce law center 2 white street concord, nh 03301 information technology administrator 09/2000-present starting salary: 62,300 ending salary: 62,300",
    "metadata": {
      "has_education": true
    },
    "sections": {},
    "keywords": [
      "novell",
      "law",
      "window",
      "system",
      "network",
      "server",
      "microsoft",
      "mac",
      "school",
      "technology",
      "new",
      "city",
      "state",
      "hardware",
      "campus",
      "including",
      "salary",
      "administrator",
      "experience",
      "apple",
      "management",
      "company",
      "name",
      "software",
      "work",
      "service",
      "infrastructure",
      "platform",
      "computer",
      "predominately"
    ]
  },
  "file_path": "/Users/proxim/Desktop/Automated-First-Screener-and-AI-Job-Matching-NLP-WebEngine/data/raw/resumes/r284a6.pdf"
}