{
  "id": "r29dc8",
  "filename": "70089206.pdf",
  "upload_time": "17:35:11",
  "document_type": "resume",
  "original_text": "INFORMATION TECHNOLOGY SPECIALIST\nSummary\nHighly skilled and results-oriented IT specialistÂ with extensive experience in Software Development, Software Configuration Management,\nProject Management, System Planning & Specification Development, CMMI5, Quality Assurance and Testing.Â \nHighlights\nProcess improvement\nQuality assurance and control\nResults-oriented\nRelationship building\nProductivity improvement\nProject development and lifecycle\nDetail-oriented\nWork flow planning\nExperience\nInformation Technology Specialist\n \nAugust 2006\n \nto \nCurrent\n \nCompany Name\nTrack and control over 150 change requests per month.\nManage the repository for Software and Customer Requirements Documents, Agreements and Governance Specifications.\nDocument and communicate defects and problems with stakeholders and developers.\nDevelop and report critical metrics related to CRSMB change request activity.\nEnsure that all activities involved in the software design, coding and testing of the application software have been successfully completed\nbefore releasing software for independent testing and deployment into the production environment.\nDeploy application software to the Test and Production environments using code management tools.\nManage logging change requests into the tracking system and assigning work activities to members of the branch.\nEvaluate the adequacy of current CM processes and procedures and make recommendations for CM process improvement.\nCoordinate and communicate with developers, subject matter personnel, stakeholders, database management support and project\nmanagers.\nPerformed platform testing and performance testing during the migration to the Serena Business Management (SBM) system.\nCollaborated in the design of the Serena Business Manager (SBM) Workflow.\nAdministrator for the Serena Business Manager (SBM) System.\nProficiency in working with Serena Version Manager as a software repository, WinSCP and Reflections for the migration and staging of\napplication software to the testing and production LINUX environment.\nMaintain the Branch's SharePoint Site, ensuring current documentation and resources are available to the Division.\nDocument CM procedures and provide training to new CM staff members, and members of the Division.\nExecute test scripts as needed in the implementation and deployment of software related Test and Production project development.\nAssure that software releases are performed in compliance with established CMMI guidelines.\nSolve technology related issues by researching potential problems and offer a solution in the deployment of software and change request\ntracking.\nEnsure that each CM change request has passed regulated security checks.\nMaintain a well established, well defined, documented, and repeatable processes within standards of Capability Maturity Model Integration\n(CMMI)\nComputer Specialist\n \nAugust 1996\n \nto \nAugust 2006\n \nCompany Name\nDetailed and refined requirements, wrote algorithms, developed programs and command procedures.\nDeveloped solutions to improve software performance.\nEnhanced testing procedures.\nPerformed software testing, debugging, and validation using internally developed test scripts, test plans, and results criteria.\nDeveloped and delivered software products.\nCommunicated with IT staff and subject matter on project requirements\nConducted program demonstrations with team members prior to the release of software.\nPerformed extensive database testing, automated testing and data validation in support of the MAF/TIGER database's migration to Oracle.\nDeveloped database test scenarios and supporting software in Pro C and Oracle to validate the migration to the Oracle platform.\nWorked extensively in PL/SQL, SQL, Shell scripting in LINUX, JavaScript, SAS, and Visual Basic.\nAttended meetings with DivisionÂ managers Â to review project status and proposed changes.\nCreated status reports and posted to the GEO website for management review.\nDesigned and maintained branch website.\nÂ \nComputer Specialist\n \nJuly 1994\n \nto \nAugust 1996\n \nCompany Name\n\nÂ \nDesigned and developed electronic questionnaires, \"instruments\", for Computer Assisted Survey Information Collection (CASIC) activities.\nLed meetings withÂ subject matter staff to review \nproject status and proposed changes.\nMet with the subject matter staff and the sponsor on the details and development of the programming specifications, design and testing of\nthe CAI.\nDelivered status reports to stakeholders for budgeting and planning purposes.\nCollaborated with program sponsor to draft project schedules and plans.\nServed as the single point of contact for project scheduling and changes.\nProgram Manager of the Survey of Inmates of Local Jails.\nMathematical Statistician\n \nFebruary 1988\n \nto \nJuly 1994\n \nCompany Name\nÂ \nWorked in the Research & Methodology Branch of the Industry Division.\nWorked with team on the statistical methodology for designing a ratio estimation procedure.\nDeveloped estimation and variance methodologies.\nDeveloped the sampling frame, and independent probability proportional-to-size sampling (PPS) maintenance of surveys.\nDesignedcomputer algorithms for assigning the sampling weights, the nonresponse sample weight adjustment, and calculation of the\nestimates, variances, and relative standard sampling errors.\nDeveloped computer software needed for survey sample selection.\nProvided programming expertise, assisted subject matter analysts with software and instruments for aiding in data reviews for the many\nannual and monthly surveys.\nEducation\nApplied Probabilty and Statistics\n \nUniversity of Maryland\nSurvey Theory\n \nUSDA Graduate School\nMaster of Science\n \n: \nUrban Regional Planning\n \nIndiana University of Pennsylvania\nBachelor of Arts\n \n: \nPhysical Geography\n \nIndiana University of Pennsylvania\nProfessional Development Training\nSerena Business Manager Composer\nSerena Business Manager Administrator\nConfiguration and Release Management Training\nUnix Programming\nOracle 10G Programming\nOracle JDeveloper\nJava Programming\nObject Oriented Programming\nIntro to UNIX Systems\nAdvanced UNIX\nLearning PERL\nAdvanced C Language Programming\nAdvanced PL/SQL Programming\nFundamentals of SAS\nSQL Processing with SAS\nSAS Programing\nTable Processing with SAS\nOutput Delivery Systems\nUtilizing VAX/VMS\nDemand Terminal Language\nPackage References\nObjects and Modules\nSkills\nConfiguration Management, Process Development, Process Improvement, Database Management, Software Development, Software Testing,\nSerena Version Manager, Serena Business Manager, Serena Business Administrator, Reflections, WinSCP, JavaScript, LINUX, Microsoft\nAccess, Office, SharePoint, Enterprise, Oracle, PL/SQL, Oracle SQL, C, SAS, LINUX, Visual Basic",
  "processed": {
    "clean_text": "information technology specialist summary highly skilled and results-oriented it specialistâ with extensive experience in software development, software configuration management, project management, system planning  specification development, cmmi5, quality assurance and testing.â highlights process improvement quality assurance and control results-oriented relationship building productivity improvement project development and lifecycle detail-oriented work flow planning experience information technology specialist august 2006 to current company name track and control over 150 change requests per month. manage the repository for software and customer requirements documents, agreements and governance specifications. document and communicate defects and problems with stakeholders and developers. develop and report critical metrics related to crsmb change request activity. ensure that all activities involved in the software design, coding and testing of the application software have been successfully completed before releasing software for independent testing and deployment into the production environment. deploy application software to the test and production environments using code management tools. manage logging change requests into the tracking system and assigning work activities to members of the branch. evaluate the adequacy of current cm processes and procedures and make recommendations for cm process improvement. coordinate and communicate with developers, subject matter personnel, stakeholders, database management support and project managers. performed platform testing and performance testing during the migration to the serena business management (sbm) system. collaborated in the design of the serena business manager (sbm) workflow. administrator for the serena business manager (sbm) system. proficiency in working with serena version manager as a software repository, winscp and reflections for the migration and staging of application software to the testing and production linux environment. maintain the branchs sharepoint site, ensuring current documentation and resources are available to the division. document cm procedures and provide training to new cm staff members, and members of the division. execute test scripts as needed in the implementation and deployment of software related test and production project development. assure that software releases are performed in compliance with established cmmi guidelines. solve technology related issues by researching potential problems and offer a solution in the deployment of software and change request tracking. ensure that each cm change request has passed regulated security checks. maintain a well established, well defined, documented, and repeatable processes within standards of capability maturity model integration (cmmi) computer specialist august 1996 to august 2006 company name detailed and refined requirements, wrote algorithms, developed programs and command procedures. developed solutions to improve software performance. enhanced testing procedures. performed software testing, debugging, and validation using internally developed test scripts, test plans, and results criteria. developed and delivered software products. communicated with it staff and subject matter on project requirements conducted program demonstrations with team members prior to the release of software. performed extensive database testing, automated testing and data validation in support of the maf/tiger databases migration to oracle. developed database test scenarios and supporting software in pro c and oracle to validate the migration to the oracle platform. worked extensively in pl/sql, sql, shell scripting in linux, javascript, sas, and visual basic. attended meetings with divisionâ managers â to review project status and proposed changes. created status reports and posted to the geo website for management review. designed and maintained branch website. â computer specialist july 1994 to august 1996 company name â designed and developed electronic questionnaires, instruments, for computer assisted survey information collection (casic) activities. led meetings withâ subject matter staff to review project status and proposed changes. met with the subject matter staff and the sponsor on the details and development of the programming specifications, design and testing of the cai. delivered status reports to stakeholders for budgeting and planning purposes. collaborated with program sponsor to draft project schedules and plans. served as the single point of contact for project scheduling and changes. program manager of the survey of inmates of local jails. mathematical statistician february 1988 to july 1994 company name â worked in the research  methodology branch of the industry division. worked with team on the statistical methodology for designing a ratio estimation procedure. developed estimation and variance methodologies. developed the sampling frame, and independent probability proportional-to-size sampling (pps) maintenance of surveys. designedcomputer algorithms for assigning the sampling weights, the nonresponse sample weight adjustment, and calculation of the estimates, variances, and relative standard sampling errors. developed computer software needed for survey sample selection. provided programming expertise, assisted subject matter analysts with software and instruments for aiding in data reviews for the many annual and monthly surveys. education applied probabilty and statistics university of maryland survey theory usda graduate school master of science : urban regional planning indiana university of pennsylvania bachelor of arts : physical geography indiana university of pennsylvania professional development training serena business manager composer serena business manager administrator configuration and release management training unix programming oracle 10g programming oracle jdeveloper java programming object oriented programming intro to unix systems advanced unix learning perl advanced c language programming advanced pl/sql programming fundamentals of sas sql processing with sas sas programing table processing with sas output delivery systems utilizing vax/vms demand terminal language package references objects and modules skills configuration management, process development, process improvement, database management, software development, software testing, serena version manager, serena business manager, serena business administrator, reflections, winscp, javascript, linux, microsoft access, office, sharepoint, enterprise, oracle, pl/sql, oracle sql, c, sas, linux, visual basic",
    "metadata": {
      "has_education": true
    },
    "sections": {},
    "keywords": [
      "software",
      "testing",
      "manager",
      "management",
      "project",
      "serena",
      "developed",
      "development",
      "change",
      "programming",
      "business",
      "oracle",
      "system",
      "process",
      "test",
      "survey",
      "request",
      "procedure",
      "subject",
      "matter",
      "database",
      "specialist",
      "planning",
      "improvement",
      "august",
      "company",
      "name",
      "activity",
      "production",
      "member"
    ]
  },
  "file_path": "/Users/proxim/Desktop/Automated-First-Screener-and-AI-Job-Matching-NLP-WebEngine/data/raw/resumes/r29dc8.pdf"
}