{
  "id": "r2ce20",
  "filename": "10553553.pdf",
  "upload_time": "17:35:29",
  "document_type": "resume",
  "original_text": "INFORMATION TECHNOLOGY MANAGER\nSummary\nDedicated \nIT Manager\n \nwell-versed in analyzing and mitigating risk and finding cost-effective solutions. Excels at boosting performance and\nproductivity by establishing realistic goals and enforcing deadlines.\nHighlights\nOperations management\nProject trackingÂ \nPerformance criteria tracking\nWaterfall framework\nScrum methodology\nEnterprise platforms\nSalary structure/compensation analysis\nCalm under pressure\nCompensation/benefits administration\nStaff development\nClient communication\nExperience\nInformation Technology Manager\n \n, \n03/2013\n \nto \nCurrent\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nManaged a four-person local IT team, allocating resources to ongoing projects and enforcing deadlines.\nDrove business KPIs through rapid iteration of customer-facing product features.\nLeveraged in-depth understanding of end-to-end customer experience to identify pain points and latent customer needs.\nCollaborated with the global team to resolve IT support cases.\nBuild and maintain a staff of five & terminate for cause one employee.\nCreate and audit processes interlocking with other teams, adjust as required.\nManage travel and budget for staff on-site visits.\nOwnership of SaaS customers in North America, Canada and Australia.\nDefined project deliverables and monitored status of tasks.\nExecuted proof of concept implementations to validate product feasibility.\nIT Administrator\n \n, \n06/2011\n \nto \n03/2013\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nDesigned and delivered mission critical infrastructure to ensure the highest levels of availability, performance and security.\nMaintained security, backup, and redundancy strategies.\nOwnership of IT Infrastructure and Client/Server management (Chicago, Houston, Montreal and Sydney).\nCollected, analyzed, and reported program metrics, including product technical performance measures and key performance parameters.\nManage North America production data center (SaaS) and disaster recovery applications.\nDeploy and manage VMware architecture.\nMonitor and created automatic actions related to hardware and web servers.\nEngineered IT infrastructure for reliable WAN and LAN connectivity.\nActive Directory and Group Policy configuration and deployment.\nProvided client support for production.\nSQL Administration.\nDeployed over 30 NEC phones and support for NEC PBX.\nResponsible for purchasing and product recommendations.\nNetwork Administrator\n \n, \n02/2010\n \nto \n05/2011\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nTested, configured and deployed Windows 7 operating system with Acronis Snap Deploy.\nDeployed and tested Microsoft Exchange 2010 in VMware.\nAdministered SQL 2005 database to run Dentrix and DEXIS software.\nConfiguration and implementation of Group Policies.\nInformation Technology Consultant\n \n, \n10/2008\n \nto \n05/2011\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nManaged and provided security administrative support for Paine Wetzel ONCOR International, Northridge Group, Rent Here Realty, and\nNorthwestern Dental Center.\nSupported Microsoft Windows 2003, XP, Vista and Mac operating systems.\nResponsible for purchase decisions to provide the best end point security solutions.\nObtained Milestone Advanced Certified Partner for video surveillance.\nNetwork Administrator\n \n, \n10/2008\n \nto \n05/2011\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nInstalled and configured LAN with Windows XP and Windows Vista clients.\nAdministration of Microsoft Active Directory.\nAdministration of Microsoft Exchange 2003 systems including backup and recovery.\nDeploy Symantec endpoint security solutions and implemented disaster recovery.\nManaged multiple desktop applications: Microsoft Office, Adobe Acrobat, ACT.\nAdministration of intranet.\n\nNetwork Administrator\n \n, \n10/2008\n \nto \n12/2009\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nProvided on-site technical support for Windows 2003 and 2008 servers, workstations, laptops, Blackberries, and iPhones.\nMigrated to Exchange 2007 SCR from Exchange 2003 with PowerShell and DAS.\nManaged Windows Server 2008 and Windows 7.\nCollege of Education Computer Technician\n \n, \n07/2006\n \nto \n06/2008\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nPerformed PC and Mac hardware and software configurations.\nTroubleshot general Novell Client issues.\nInstalled and maintained peripherals.\nBuilt images to be used with Symantec Ghost.\nEducation\nMaster of Science\n \n:\n \nBusiness Information Technology\n \n,\n \n2018\n \nDePaul University\n \nï¼​ \nCity\n \n, \nState\nBachelor of Science\n \n:\n \nNetwork and Communications Management\n \n,\n \n2009\n \nDeVry University\n \nï¼​ \nCity\n \n, \nState\nSkills\nActive Directory, administrative support, Adobe Acrobat, Architect, backup, budget, Client/Server, hardware, Concept, Client, clients, client\nsupport, DAS, database, disaster recovery, Ghost, LAN, laptops, Mac hardware, Mac, Exchange, Microsoft Exchange, Microsoft Exchange\n2003, Microsoft Office, Windows 7, Windows, Microsoft Windows 2003, Windows XP, NEC, Novell, operating systems, operating system,\nPBX, peripherals, Policies, processes, purchasing, servers, SLA, SQL, Symantec, technical support, phones, Video, Vista, web servers, WAN,\nWindows Server",
  "processed": {
    "clean_text": "information technology manager summary dedicated it manager well-versed in analyzing and mitigating risk and finding cost-effective solutions. excels at boosting performance and productivity by establishing realistic goals and enforcing deadlines. highlights operations management project trackingâ performance criteria tracking waterfall framework scrum methodology enterprise platforms salary structure/compensation analysis calm under pressure compensation/benefits administration staff development client communication experience information technology manager , 03/2013 to current company name ï¼ city , state managed a four-person local it team, allocating resources to ongoing projects and enforcing deadlines. drove business kpis through rapid iteration of customer-facing product features. leveraged in-depth understanding of end-to-end customer experience to identify pain points and latent customer needs. collaborated with the global team to resolve it support cases. build and maintain a staff of five  terminate for cause one employee. create and audit processes interlocking with other teams, adjust as required. manage travel and budget for staff on-site visits. ownership of saas customers in north america, canada and australia. defined project deliverables and monitored status of tasks. executed proof of concept implementations to validate product feasibility. it administrator , 06/2011 to 03/2013 company name ï¼ city , state designed and delivered mission critical infrastructure to ensure the highest levels of availability, performance and security. maintained security, backup, and redundancy strategies. ownership of it infrastructure and client/server management (chicago, houston, montreal and sydney). collected, analyzed, and reported program metrics, including product technical performance measures and key performance parameters. manage north america production data center (saas) and disaster recovery applications. deploy and manage vmware architecture. monitor and created automatic actions related to hardware and web servers. engineered it infrastructure for reliable wan and lan connectivity. active directory and group policy configuration and deployment. provided client support for production. sql administration. deployed over 30 nec phones and support for nec pbx. responsible for purchasing and product recommendations. network administrator , 02/2010 to 05/2011 company name ï¼ city , state tested, configured and deployed windows 7 operating system with acronis snap deploy. deployed and tested microsoft exchange 2010 in vmware. administered sql 2005 database to run dentrix and dexis software. configuration and implementation of group policies. information technology consultant , 10/2008 to 05/2011 company name ï¼ city , state managed and provided security administrative support for paine wetzel oncor international, northridge group, rent here realty, and northwestern dental center. supported microsoft windows 2003, xp, vista and mac operating systems. responsible for purchase decisions to provide the best end point security solutions. obtained milestone advanced certified partner for video surveillance. network administrator , 10/2008 to 05/2011 company name ï¼ city , state installed and configured lan with windows xp and windows vista clients. administration of microsoft active directory. administration of microsoft exchange 2003 systems including backup and recovery. deploy symantec endpoint security solutions and implemented disaster recovery. managed multiple desktop applications: microsoft office, adobe acrobat, act. administration of intranet. network administrator , 10/2008 to 12/2009 company name ï¼ city , state provided on-site technical support for windows 2003 and 2008 servers, workstations, laptops, blackberries, and iphones. migrated to exchange 2007 scr from exchange 2003 with powershell and das. managed windows server 2008 and windows 7. college of education computer technician , 07/2006 to 06/2008 company name ï¼ city , state performed pc and mac hardware and software configurations. troubleshot general novell client issues. installed and maintained peripherals. built images to be used with symantec ghost. education master of science : business information technology , 2018 depaul university ï¼ city , state bachelor of science : network and communications management , 2009 devry university ï¼ city , state skills active directory, administrative support, adobe acrobat, architect, backup, budget, client/server, hardware, concept, client, clients, client support, das, database, disaster recovery, ghost, lan, laptops, mac hardware, mac, exchange, microsoft exchange, microsoft exchange 2003, microsoft office, windows 7, windows, microsoft windows 2003, windows xp, nec, novell, operating systems, operating system, pbx, peripherals, policies, processes, purchasing, servers, sla, sql, symantec, technical support, phones, video, vista, web servers, wan, windows server",
    "metadata": {
      "has_education": true
    },
    "sections": {},
    "keywords": [
      "window",
      "city",
      "state",
      "microsoft",
      "support",
      "client",
      "company",
      "name",
      "exchange",
      "server",
      "2003",
      "performance",
      "administration",
      "security",
      "system",
      "information",
      "technology",
      "managed",
      "product",
      "administrator",
      "recovery",
      "hardware",
      "network",
      "operating",
      "mac",
      "manager",
      "solution",
      "management",
      "project",
      "staff"
    ]
  },
  "file_path": "/Users/proxim/Desktop/Automated-First-Screener-and-AI-Job-Matching-NLP-WebEngine/data/raw/resumes/r2ce20.pdf"
}