{
  "id": "r38ba6",
  "filename": "51639418.pdf",
  "upload_time": "17:35:12",
  "document_type": "resume",
  "original_text": "INFORMATION TECHNOLOGY BUREAU DEPUTY DIRECTOR\nProfessional Summary\nSenior Information Technology Professional with more than fifteen years of experience directing and managing large and complex IT Operations\nand Data Center. Resourceful thinker, methodical problem solver, and analytical in all facets of technical management. Proficient at educational and\nadvanced enterprise related technology solutions. A strong, decisive leader who leads by example and hardworking professional focused on results\nand details. Â Fully bilingual in English and Spanish.\nCore Qualifications\nIBM Enterprise z System & x Servers \nMicrosoft Windows\nVMWare ESX \nCloud Computing\nOperating Systems (Microsoft Windows, z/OS, zVM, AIX,\nSUSE Linux)\nDatabases (SQL, DB2, ORACLE, ADABAS)\nTools (Office, Project, Visio, SharePoint, Exchange, MSCCM,\nSolarWinds Orion, Tivoli, Track-It!)\nCommunication & Security (Frame Relay, MPLS, FCIP, Enterasys,\nCISCO, Fortinet)\nExperience\nCompany Name\n \nJanuary 2010\n \nto \nCurrent\n \nInformation Technology Bureau Deputy Director\n \nCity\n \n, \nState\nOversee and lead the Infrastructure & Operations IT Service, 24x7.\nThis includes the supervision of four divisions: (1) Programming & Applications; (2) Networking & Communications; (3) Desktop Services\n& Support; and (4) Operating Systems & Database.\nPerformance management and KPIs.\nKey Accomplishments: Oversees a department of 140 contractors and employees.\nManages infrastructure data network of 9,300 users, 250 sites.\nEvaluates direct cutting edge technology solutions for the implementation of 53 IT projects.\nCompany Name\n \nOctober 2009\n \nto \nJanuary 2010\n \nInformation Technology Director\n \nCity\n \n, \nState\nProvided technical leadership to a data center and technical supervision of analysts, programmers, database administrators, and network as\nwell as the support personnel.\nKey Accomplishments: Managed Data Center for 900 employees.\nDeveloped an innovation and technological portfolio of IT projects in Vocational Rehabilitation Administration.\nSupported department documentation digitalization initiatives at the Department of Labor.\nCompany Name\n \nJuly 2004\n \nto \nAugust 2009\n \nSenior IT Project Manager\n \nCity\n \n, \nState\nDelivered technical direction for a multimillion dollar Monitoring and Controlling System.\nKey Accomplishments: The total amount managed was 185 plants of filtration water and sewer water treatment with 1,540 facilities through\nthe PR Island.\nSCADA - Supervisory Control and Data Acquisition).\nTechnical supervised the software analyst, programmers and database administrators during the software development and implementations\nof Department of Health compliance systems.\nCareer Notes.\nCompany Name\n \nJanuary 2003\n \nto \nJune 2004\n \nIT Business Consultant\n \nCity\n \n, \nState\n \nAssist in computer network & voice integrator in over 11 Medical Center locations.Consulted for individuals and organizations in\ninformation technology business solution.\nCompany Name\n \nJanuary 2003\n \nto \nAugust 2004\n \nInformation Technology Business Consultant\n \nCity\n \n, \nState\nAssist in computer network & voice integrator in over 11 Medical Center locations.\nConsulted for individuals and organizations in information technology business solution.\nCompany Name\n \nJanuary 2003\n \nto \nJune 2003\n \nProfessor\n \nCity\n \n, \nState\nTaught courses in (1) Optical Networking; (2) System Analysis and Design.\nCompany Name\n \nSeptember 1999\n \nto \nAugust 2003\n \nProfessor\n \nCity\n \n, \nState\nTaught graduate courses in (1) Data Communication, Networks and Distributed Processing; (2) Computer Concepts and Programming\nTools; (3) Relational Databases.\n\nEducation\nCapella University\n \nPh.D.\n \n: \nOrganization and Management\n \nCity\n \n, \nState\n \n, \nUS\nInter American University\n \nEducational Computing\n \nCity\n \n, \nState\n \n, \nUS\n \nEducational Computing\nUniversity of Puerto Rico\n \nBSBA\n \n: \nFinance & Computers\n \nCity\n \n, \nPuerto Rico\n \nFinance & Computers\nLanguages\nFully bilingual in English and Spanish.\nAdditional Information\nAwards & Honors \nComputerworld Honors Award Laureate Medal, California, April 2001. \nChamber of Representatives of Puerto Rico-\nAchievement Award, June 2000. \nAITP Distinguished Information Science Award in the Government Sector, from Association of\nInformation Technology Professionals, Puerto Rico Chapter, October 2000.\nSkills\nADABAS, AIX, analyst, Application Development, Budgeting, business solution, CISCO, Coaching, Databases, Database, Department of\nHealth, direction, documentation, edge, English, Forecasting, Frame Relay, IBM, DB2, information technology, innovation, leadership, Linux,\nNotes, Mentoring, Exchange, Office, SharePoint, Microsoft Windows, Enterprise, network, Networking, Networks, Operating Systems, OS,\nORACLE, Performance management, personnel, PhD, PR, Process Improvement, Programming, Project Management, Rehabilitation, Relational\nDatabases, SCADA, Supervisory Control and Data Acquisition, Servers, software development, Spanish, SQL, Staff Supervision, supervision,\nSystem Analysis and Design, Technical Management, Telecommunications, Tivoli, Track-It, Visio, water treatment",
  "processed": {
    "clean_text": "information technology bureau deputy director professional summary senior information technology professional with more than fifteen years of experience directing and managing large and complex it operations and data center. resourceful thinker, methodical problem solver, and analytical in all facets of technical management. proficient at educational and advanced enterprise related technology solutions. a strong, decisive leader who leads by example and hardworking professional focused on results and details. â fully bilingual in english and spanish. core qualifications ibm enterprise z system  x servers microsoft windows vmware esx cloud computing operating systems (microsoft windows, z/os, zvm, aix, suse linux) databases (sql, db2, oracle, adabas) tools (office, project, visio, sharepoint, exchange, msccm, solarwinds orion, tivoli, track-it) communication  security (frame relay, mpls, fcip, enterasys, cisco, fortinet) experience company name january 2010 to current information technology bureau deputy director city , state oversee and lead the infrastructure  operations it service, 24x7. this includes the supervision of four divisions: (1) programming  applications; (2) networking  communications; (3) desktop services  support; and (4) operating systems  database. performance management and kpis. key accomplishments: oversees a department of 140 contractors and employees. manages infrastructure data network of 9,300 users, 250 sites. evaluates direct cutting edge technology solutions for the implementation of 53 it projects. company name october 2009 to january 2010 information technology director city , state provided technical leadership to a data center and technical supervision of analysts, programmers, database administrators, and network as well as the support personnel. key accomplishments: managed data center for 900 employees. developed an innovation and technological portfolio of it projects in vocational rehabilitation administration. supported department documentation digitalization initiatives at the department of labor. company name july 2004 to august 2009 senior it project manager city , state delivered technical direction for a multimillion dollar monitoring and controlling system. key accomplishments: the total amount managed was 185 plants of filtration water and sewer water treatment with 1,540 facilities through the pr island. scada - supervisory control and data acquisition). technical supervised the software analyst, programmers and database administrators during the software development and implementations of department of health compliance systems. career notes. company name january 2003 to june 2004 it business consultant city , state assist in computer network  voice integrator in over 11 medical center locations.consulted for individuals and organizations in information technology business solution. company name january 2003 to august 2004 information technology business consultant city , state assist in computer network  voice integrator in over 11 medical center locations. consulted for individuals and organizations in information technology business solution. company name january 2003 to june 2003 professor city , state taught courses in (1) optical networking; (2) system analysis and design. company name september 1999 to august 2003 professor city , state taught graduate courses in (1) data communication, networks and distributed processing; (2) computer concepts and programming tools; (3) relational databases. education capella university ph.d. : organization and management city , state , us inter american university educational computing city , state , us educational computing university of puerto rico bsba : finance  computers city , puerto rico finance  computers languages fully bilingual in english and spanish. additional information awards  honors computerworld honors award laureate medal, california, april 2001. chamber of representatives of puerto rico- achievement award, june 2000. aitp distinguished information science award in the government sector, from association of information technology professionals, puerto rico chapter, october 2000. skills adabas, aix, analyst, application development, budgeting, business solution, cisco, coaching, databases, database, department of health, direction, documentation, edge, english, forecasting, frame relay, ibm, db2, information technology, innovation, leadership, linux, notes, mentoring, exchange, office, sharepoint, microsoft windows, enterprise, network, networking, networks, operating systems, os, oracle, performance management, personnel, phd, pr, process improvement, programming, project management, rehabilitation, relational databases, scada, supervisory control and data acquisition, servers, software development, spanish, sql, staff supervision, supervision, system analysis and design, technical management, telecommunications, tivoli, track-it, visio, water treatment",
    "metadata": {
      "has_education": true
    },
    "sections": {},
    "keywords": [
      "information",
      "technology",
      "city",
      "state",
      "system",
      "database",
      "data",
      "company",
      "name",
      "network",
      "technical",
      "management",
      "center",
      "solution",
      "project",
      "january",
      "department",
      "2003",
      "business",
      "computer",
      "professional",
      "supervision",
      "puerto",
      "award",
      "director",
      "educational",
      "enterprise",
      "english",
      "spanish",
      "microsoft"
    ]
  },
  "file_path": "/Users/proxim/Desktop/Automated-First-Screener-and-AI-Job-Matching-NLP-WebEngine/data/raw/resumes/r38ba6.pdf"
}