{
  "id": "r3e2e8",
  "filename": "27485716.pdf",
  "upload_time": "17:35:17",
  "document_type": "resume",
  "original_text": "CORPORATE PROJECT MANAGER\nCareer Overview\nSeasoned project manager driven to achieve results through strategic planning and professional relationship building. Success in developing\nbeneficial alliances between leaders to effectively drive growth and achieve goals. Dedicated to building strong teams within an organization through\nmotivation and strong development. \nEffective in fostering collaboration and consultative relationships with senior management and across \ntraditional\nboundaries; highlighting inflection points of technology decisions. \nTechnical leader with broad experience, brings focus on \"big picture\" business\nimpacts of technology \nprojects: real costs, practical benefits, risks and contingencies. \nAdaptable - skilled at supporting individuals, building\nsystems, handling problems; as well as managing \nteams, training, developing strategies, policies and processes.\nQualifications\nStrategic Planning / Visioning & Tactical Execution \nManpower Planning & Scheduling\nSDLC Methodology/ Problem & Change \nSoftware & Application Lifecycle Management\nManagement\nSLA Authoring & Resource Allocation \nExpense Budgeting & Forecasting\nTeam-Building & Front-Line Leadership \nTechnology Upgrades & Training\nLed highly visible initiatives to develop, define and manage the execution of several ground up IT\ninfrastructure and application integrations through corporate acquisitions and divestitures while\nsuccessfully balancing resources, timelines and budgets.\nExperience in complete Project Management Life cycle including Planning, Execution, Monitor &\nControl and closure.\nDocument business performance expectations, benchmark standards and develop guidelines.\nInterfaced with key stakeholders and project team members to prioritize requirements and\ninformation technology needs.\nSuccessfully lead learning enhancement classes to improve sales knowledge and people skills for\nworkplace success and advancement. Developed materials to successfully train associates.\nProvide oversight of yearly and monthly budget planning activities providing forecasting and day-to-\nday expense management keeping projects under budget and proper tracking of expenses.\nDirect all information technology and network system deployment and maintenance including all IT\ninfrastructure, wireless communications, PC systems, local networks and mobile environment.\nAssessing and recommending technology systems solutions based on operational needs while ensuring\ncompliance with corporate standards. Interfaced with outside vendors to source materials.\nWork Experience\n01/2014\n \nto \n01/2016\nCorporate Project Manager\n \nCompany Name\nManage direct reports supporting multiple locations with annual revenues of $2M.\nAccountable for the strategic direction, implementation, support, and development of all business applications, Enterprise Resource Planning\n(ERP), Facilities Management, Financials, Forecasting and Procurement.\nEstablished change management and help desk solutions and policies.\nDeveloped new process design workflow to ensure on-time delivery of all solutions and within budget \nleading to increase in monthly\nproductivity by 20%.\nCentralized disparate support documentation for all business applications and architecture.\nDeveloped corporate process and tools for opportunities tracking, bid decision making and proposal \ndevelopment.\nDeveloped training material for new products and technologies and delivered training classes to \nassociates.\n01/2008\n \nto \n01/2014\nDirector of Information Technology and Systems\n \nCompany Name\nResponsible for managing and executing business development activities for IT and other company business lines.\nProvided executive leadership over internal company-wide IT infrastructure.\nDeveloped end user training material coordinating and conducting group and individual training \nsessions based on staff and organizational\nlearning needs.\nIntroduced methods for tracking project management, workload planning and corporate business \nperformance metrics.\nResponsible for managing and executing business development activities for IT and other company \nbusiness lines.\nInstallation of Gate and Locking systems (Saflok, Ving, Salto and Amano Mc Gann access control \nsystems) in various brands resorts\ninterfacing with PMS systems.\n01/2006\n \nto \n01/2008\nDirector of Information Technology and Systems\n \nCompany Name\nManage four hotels within REIT interfacing with both management and ownership to guide the hotel through day-to-day operations.\nInsure that the company's strategic technologies needs are the primary focus.\nProvided first and second-tier technical support and knowledge on Windows server/desktop applications \nand resort PMS/POS Systems.\nProvided operations management, including security, backup/recovery/disaster planning, off-hours staff \ncoverage.\nOversaw $1.4 M capital budget and hotel conversion.\n\nEducation and Training\nBachelor of Science\n \n: \nComputers and Information Technology\n \nUNIVERSITY OF PHOENIX\n \nï¼​ \nCity\n \n, \nState\n \nComputers and Information\nTechnology\nAssociates of Arts\n \n: \nFinance and Business Administration\n \nLAKE SUMTER COMMUNITY COLLEGE\n \nï¼​ \nCity\n \n, \nState\n \nFinance and Business\nAdministration\n2016\nITIL Foundation Course\nMicrosoft Certified Professional (MCP), CompTia A+, CompTia N+\nSkills\nA+, acquisitions, backup, budget planning, Budgeting, budgets, budget, business development, change management, conversion, decision making,\ndelivery, direction, disaster planning, documentation, ERP, Enterprise Resource Planning, Facilities Management, Financials, focus, Forecasting,\nhelp desk, information technology, ITIL, Leadership, Team-Building, managing, materials, access, Microsoft Certified Professional, MCP,\nnetwork, networks, operations management, organizational, PC systems, people skills, policies, POS, process design, Procurement, Project\nManagement, proposal \ndevelopment, sales, Scheduling, SDLC, SLA, strategic, Strategic Planning, technical support, user training, training\nmaterial, Upgrades, Windows server, workflow",
  "processed": {
    "clean_text": "corporate project manager career overview seasoned project manager driven to achieve results through strategic planning and professional relationship building. success in developing beneficial alliances between leaders to effectively drive growth and achieve goals. dedicated to building strong teams within an organization through motivation and strong development. effective in fostering collaboration and consultative relationships with senior management and across traditional boundaries; highlighting inflection points of technology decisions. technical leader with broad experience, brings focus on big picture business impacts of technology projects: real costs, practical benefits, risks and contingencies. adaptable - skilled at supporting individuals, building systems, handling problems; as well as managing teams, training, developing strategies, policies and processes. qualifications strategic planning / visioning  tactical execution manpower planning  scheduling sdlc methodology/ problem  change software  application lifecycle management management sla authoring  resource allocation expense budgeting  forecasting team-building  front-line leadership technology upgrades  training led highly visible initiatives to develop, define and manage the execution of several ground up it infrastructure and application integrations through corporate acquisitions and divestitures while successfully balancing resources, timelines and budgets. experience in complete project management life cycle including planning, execution, monitor  control and closure. document business performance expectations, benchmark standards and develop guidelines. interfaced with key stakeholders and project team members to prioritize requirements and information technology needs. successfully lead learning enhancement classes to improve sales knowledge and people skills for workplace success and advancement. developed materials to successfully train associates. provide oversight of yearly and monthly budget planning activities providing forecasting and day-to- day expense management keeping projects under budget and proper tracking of expenses. direct all information technology and network system deployment and maintenance including all it infrastructure, wireless communications, pc systems, local networks and mobile environment. assessing and recommending technology systems solutions based on operational needs while ensuring compliance with corporate standards. interfaced with outside vendors to source materials. work experience 01/2014 to 01/2016 corporate project manager company name manage direct reports supporting multiple locations with annual revenues of 2m. accountable for the strategic direction, implementation, support, and development of all business applications, enterprise resource planning (erp), facilities management, financials, forecasting and procurement. established change management and help desk solutions and policies. developed new process design workflow to ensure on-time delivery of all solutions and within budget leading to increase in monthly productivity by 20. centralized disparate support documentation for all business applications and architecture. developed corporate process and tools for opportunities tracking, bid decision making and proposal development. developed training material for new products and technologies and delivered training classes to associates. 01/2008 to 01/2014 director of information technology and systems company name responsible for managing and executing business development activities for it and other company business lines. provided executive leadership over internal company-wide it infrastructure. developed end user training material coordinating and conducting group and individual training sessions based on staff and organizational learning needs. introduced methods for tracking project management, workload planning and corporate business performance metrics. responsible for managing and executing business development activities for it and other company business lines. installation of gate and locking systems (saflok, ving, salto and amano mc gann access control systems) in various brands resorts interfacing with pms systems. 01/2006 to 01/2008 director of information technology and systems company name manage four hotels within reit interfacing with both management and ownership to guide the hotel through day-to-day operations. insure that the companys strategic technologies needs are the primary focus. provided first and second-tier technical support and knowledge on windows server/desktop applications and resort pms/pos systems. provided operations management, including security, backup/recovery/disaster planning, off-hours staff coverage. oversaw 1.4 m capital budget and hotel conversion. education and training bachelor of science : computers and information technology university of phoenix ï¼ city , state computers and information technology associates of arts : finance and business administration lake sumter community college ï¼ city , state finance and business administration 2016 itil foundation course microsoft certified professional (mcp), comptia a, comptia n skills a, acquisitions, backup, budget planning, budgeting, budgets, budget, business development, change management, conversion, decision making, delivery, direction, disaster planning, documentation, erp, enterprise resource planning, facilities management, financials, focus, forecasting, help desk, information technology, itil, leadership, team-building, managing, materials, access, microsoft certified professional, mcp, network, networks, operations management, organizational, pc systems, people skills, policies, pos, process design, procurement, project management, proposal development, sales, scheduling, sdlc, sla, strategic, strategic planning, technical support, user training, training material, upgrades, windows server, workflow",
    "metadata": {
      "has_education": true
    },
    "sections": {},
    "keywords": [
      "management",
      "technology",
      "planning",
      "business",
      "system",
      "project",
      "training",
      "budget",
      "development",
      "information",
      "corporate",
      "strategic",
      "material",
      "company",
      "application",
      "developed",
      "managing",
      "process",
      "resource",
      "forecasting",
      "need",
      "network",
      "support",
      "manager",
      "professional",
      "building",
      "team",
      "within",
      "decision",
      "technical"
    ]
  },
  "file_path": "/Users/proxim/Desktop/Automated-First-Screener-and-AI-Job-Matching-NLP-WebEngine/data/raw/resumes/r3e2e8.pdf"
}