{
  "id": "r42655",
  "filename": "41344156.pdf",
  "upload_time": "17:35:12",
  "document_type": "resume",
  "original_text": "VP OF INFORMATION TECHNOLOGY\nExecutive Profile\nA results oriented technology leader with over 18 years of IT experience, 8 years of supervisory experience. \nPassionate about collaborating with\nkey stakeholders to develop information technology vision and strategy by effectively building organization, processes, infrastructure and services in\nsupport of short and long-term business needs. Understands the business value of available tools and applications as to provide optimal strategic\nbenefit at the appropriate cost.\nSkill Highlights\nIT Governance\nTeam Leadership\nSystems Integration\nContract Negotiations\nDisaster Recovery Plans\nIT Operations\nCore Accomplishments\nImplemented a new phone system that will immediately save the company over $100,000 a year with benefits that have increased\nproductivity while lowering the need of IT support.Â  This includes vendor contract negotiation, which resulted in the cost of the new phone\nsystem to be covered with no out of pocket expenses.\nManaged multiple IT Projects that resulted in increased productivity, performance and revenue.\nEnhanced communications between our nationwide offices using Video Conferencing, saving over $50,000 a year in travel costs.\nWorked with Marketing to integrate our CRM and other systems with our Marketing systems, which resulted in real-time feedback to\nmarketing and end users of client actions.\nConverted VMWare to Hyper-V which resulted in lower costs & quicker recovery as part of the DRP.\nDesigned, Implemented and maintained a Disaster Recovery Plan that reduced recovery time from 4 days to 2 hours, potentially saving the\ncompany from catastrophic downtime.\nInitiated a Task management system that resulted in better communication and increased productivity from the team. Â This kept all\nstakehoders in the loop on project status.\nUsing qualitative and quantitative techniques, discovered numerous ways to improve current systems, saving Bradley-Morris over $250,000\na year.\nMentored and coached employees resulting in a 25% increase in productivity.\nHistory of increasing infrastructure performance and increasing uptime to nearly 100%, saving the company over $5M a year in revenue.\nQuickly gained expertise in the company's CRM that resulted in saving the company over $600,000 in consulting fees.\nIncreased sales and reduced costs by cutting manual quoting process time by 80% through design and implementation of a new automated\nquoting system.\nSpearheaded the design and build of a commissions system that resulted in recovering over $2.5M in unaccounted commissions due.\nProfessional Experience\nVP of Information Technology\n \n07/2014\n \nto \n03/2017\n \nCompany Name\n \nCity\n \n, \nState\n \nHired to transform the IT department, which was successful\nwithin the first few months. Â Developed an IT strategy designed to increase sales and business process efficiency, and lower costs and company\nrisk. Built and managed a highly effective team of employees, vendors, and service providers. Reporting to the CEO, responsible for all information\ntechnology budgeting, vendor negotiations, and business intelligence. Â Responsible for the IT Budget, task management and delegation, and IT\nstaff mentoring and reviews.\nVP of Information and Security Technology\n \n02/2009\n \nto \n05/2014\n \nCompany Name\n \nCity\n \n, \nState\n \nLead all IT operations, including purchasing, budget\nand structure. Â Conduct performance reviews and record results. Prepare and deliver reports and presentations on IT issues for CEO and VP of\nSales on Demand. Train employees on system use, workflow procedures, and technology policies. Manage employees in connection with IT\nfunctions.Â Manage outside vendors and consultants as needed. Served as the HIPAA compliance officer. Â Worked with marketing and the VP\nof Product Development to align new products concepts with corporate technology and corporate strategic goals.\nDirector of Information Technology\n \n02/2006\n \nto \n02/2009\n \nCompany Name\n \nCity\n \n, \nState\nManaged all information security to follow HIPAA Compliance guidelines. Â Advise the CEO and other executives on advanced technology\nsolutions. Â Began serving on the Executive Management Team. Met with client executives to determine client needs, project requirements, and\nfeasibility; translate the needs into technical requirements. Â Established high functioning lean IT department to quickly respond to internal and\nexternal IT support requests. Â Bolstered system performance through design and development of new Electronic Data Processing system by\nleveraging expertise with Visual Studio 2010, SQL Server, and ASP.NET. Oversaw all areas of Infrastructure.\nInformation Technology Manager\n \n02/2003\n \nto \n02/2006\n \nCompany Name\n \nCity\n \n, \nState\nContinued to improve and expand the Commissions Tracking Application. Â Gained expertise in the companies CRM and digitally integrated the\nCommissions Tracking System with the CRM. Â Increased system uptime from 80% to over 99% by implementing new Hyper-V virtual\nservers/DFS with no downtime. Â Developed and deployed corporate software and apps to employee's mobile devices for streamline corporate\nuse and uniformity.\nApplication Developer\n \n08/2002\n \nto \n02/2003\n \nCompany Name\n \nCity\n \n, \nState\nSpearheaded major, year-long initiative to plan, design, build, and implement an ETL commission database system utilizing SQL databases and\nASP.Net, including data analysis reporting that recovered more than $2.5M in \"lost\" commissions. Â Provided some end-user desktop support.\nEducation\n\nInformation Systems\n \n2014\n \nPark University\n \nGPA: 3.5\nBachelor of Science\n \n: \nManagement\n \n2007\n \nPark University\nMagna Cum Ladue\nGPA 3.82\nSkills\nASP.Net 4.5, ASP.Net, VB.NET, Active Directory, Backup, Budget, Contract negotiation, CRM, Data Analysis, Data Processing, Databases,\nDisaster Recovery, ETL, EDI, ITIL, Training, Executive Management, Senior Management, GoldMine, Information Security, HealthCare IT, IT\nsupport, Leadership, Marketing, Network analysis, Performance reviews, VoIP, Presentations, Process Enhancement, Product Development,\nServers, SQL, SQL Server, Strategy, Desktop support, Visual Studio, Workflow\nMilitary Experience\nElectronics Technician\n \n07/1997\n \nto \n07/2001\n \nCompany Name\n \nCity\n \n, \nState\n \nDeployed and maintained CAT5 and fiber optic cable. Directed and\ntrained subordinate Technicians. Â Configured 5 stations with CAT5 and fiber optic cable. Â Conducted quarterly and annual formal performance\nreviews for all subordinates. Â Installed Windows NT system on more than 400 computers. Earned good conduct and sharpshooter awards.",
  "processed": {
    "clean_text": "vp of information technology executive profile a results oriented technology leader with over 18 years of it experience, 8 years of supervisory experience. passionate about collaborating with key stakeholders to develop information technology vision and strategy by effectively building organization, processes, infrastructure and services in support of short and long-term business needs. understands the business value of available tools and applications as to provide optimal strategic benefit at the appropriate cost. skill highlights it governance team leadership systems integration contract negotiations disaster recovery plans it operations core accomplishments implemented a new phone system that will immediately save the company over 100,000 a year with benefits that have increased productivity while lowering the need of it support.â this includes vendor contract negotiation, which resulted in the cost of the new phone system to be covered with no out of pocket expenses. managed multiple it projects that resulted in increased productivity, performance and revenue. enhanced communications between our nationwide offices using video conferencing, saving over 50,000 a year in travel costs. worked with marketing to integrate our crm and other systems with our marketing systems, which resulted in real-time feedback to marketing and end users of client actions. converted vmware to hyper-v which resulted in lower costs  quicker recovery as part of the drp. designed, implemented and maintained a disaster recovery plan that reduced recovery time from 4 days to 2 hours, potentially saving the company from catastrophic downtime. initiated a task management system that resulted in better communication and increased productivity from the team. â this kept all stakehoders in the loop on project status. using qualitative and quantitative techniques, discovered numerous ways to improve current systems, saving bradley-morris over 250,000 a year. mentored and coached employees resulting in a 25 increase in productivity. history of increasing infrastructure performance and increasing uptime to nearly 100, saving the company over 5m a year in revenue. quickly gained expertise in the companys crm that resulted in saving the company over 600,000 in consulting fees. increased sales and reduced costs by cutting manual quoting process time by 80 through design and implementation of a new automated quoting system. spearheaded the design and build of a commissions system that resulted in recovering over 2.5m in unaccounted commissions due. professional experience vp of information technology 07/2014 to 03/2017 company name city , state hired to transform the it department, which was successful within the first few months. â developed an it strategy designed to increase sales and business process efficiency, and lower costs and company risk. built and managed a highly effective team of employees, vendors, and service providers. reporting to the ceo, responsible for all information technology budgeting, vendor negotiations, and business intelligence. â responsible for the it budget, task management and delegation, and it staff mentoring and reviews. vp of information and security technology 02/2009 to 05/2014 company name city , state lead all it operations, including purchasing, budget and structure. â conduct performance reviews and record results. prepare and deliver reports and presentations on it issues for ceo and vp of sales on demand. train employees on system use, workflow procedures, and technology policies. manage employees in connection with it functions.â manage outside vendors and consultants as needed. served as the hipaa compliance officer. â worked with marketing and the vp of product development to align new products concepts with corporate technology and corporate strategic goals. director of information technology 02/2006 to 02/2009 company name city , state managed all information security to follow hipaa compliance guidelines. â advise the ceo and other executives on advanced technology solutions. â began serving on the executive management team. met with client executives to determine client needs, project requirements, and feasibility; translate the needs into technical requirements. â established high functioning lean it department to quickly respond to internal and external it support requests. â bolstered system performance through design and development of new electronic data processing system by leveraging expertise with visual studio 2010, sql server, and asp.net. oversaw all areas of infrastructure. information technology manager 02/2003 to 02/2006 company name city , state continued to improve and expand the commissions tracking application. â gained expertise in the companies crm and digitally integrated the commissions tracking system with the crm. â increased system uptime from 80 to over 99 by implementing new hyper-v virtual servers/dfs with no downtime. â developed and deployed corporate software and apps to employees mobile devices for streamline corporate use and uniformity. application developer 08/2002 to 02/2003 company name city , state spearheaded major, year-long initiative to plan, design, build, and implement an etl commission database system utilizing sql databases and asp.net, including data analysis reporting that recovered more than 2.5m in lost commissions. â provided some end-user desktop support. education information systems 2014 park university gpa: 3.5 bachelor of science : management 2007 park university magna cum ladue gpa 3.82 skills asp.net 4.5, asp.net, vb.net, active directory, backup, budget, contract negotiation, crm, data analysis, data processing, databases, disaster recovery, etl, edi, itil, training, executive management, senior management, goldmine, information security, healthcare it, it support, leadership, marketing, network analysis, performance reviews, voip, presentations, process enhancement, product development, servers, sql, sql server, strategy, desktop support, visual studio, workflow military experience electronics technician 07/1997 to 07/2001 company name city , state deployed and maintained cat5 and fiber optic cable. directed and trained subordinate technicians. â configured 5 stations with cat5 and fiber optic cable. â conducted quarterly and annual formal performance reviews for all subordinates. â installed windows nt system on more than 400 computers. earned good conduct and sharpshooter awards.",
    "metadata": {
      "has_education": true
    },
    "sections": {},
    "keywords": [
      "system",
      "company",
      "technology",
      "information",
      "resulted",
      "year",
      "cost",
      "new",
      "performance",
      "management",
      "commission",
      "name",
      "city",
      "state",
      "executive",
      "support",
      "recovery",
      "increased",
      "saving",
      "marketing",
      "crm",
      "employee",
      "experience",
      "process",
      "business",
      "need",
      "team",
      "negotiation",
      "productivity",
      "vendor"
    ]
  },
  "file_path": "/Users/proxim/Desktop/Automated-First-Screener-and-AI-Job-Matching-NLP-WebEngine/data/raw/resumes/r42655.pdf"
}