{
  "id": "r487c0",
  "filename": "36856210.pdf",
  "upload_time": "17:35:14",
  "document_type": "resume",
  "original_text": "INFORMATION TECHNOLOGY\nSummary\nDedicated \nInformation Assurance Professional\n Â well-versed in analyzing and mitigating risk and finding cost-effective solutions. Excels at boosting\nperformance and productivity by establishing realistic goals and enforcing deadlines.Â  Versatile IT professional with 37 years of Enterprise design\nand engineering methodology.\nSkills\nEnterprise platforms\nKnowledge of Product Lifecycle Management (PLM)\nProject tracking\nHardware and software upgrade planning\nProduct requirements documentation\nSelf-directed\nMS Visio\nDecisive\nCollaborative\nDomain Active Directory Layout\nData storage engineering\nInformation Assurance\nRisk Management Framework (RMF)\nActive Directory design and deployment\nWorkstation build and deployment\nSystems Accreditation Packages\nRed Hat Enterprise Linux installation and hardening\nNetwork Design & Troubleshooting\nÂ High Performance Computing\nExperience\nCompany Name\n \nCity\n \n, \nState\n \nInformation Technology\n \n02/2011\n \nto \nCurrent\nI was hired to manage accreditation efforts for a major department modernization project involving 3 accreditation packages each leading to\nsuccessful Authorization To Operate decisions. \nResponsibilities then increased to include all departmental accreditation efforts leading to another 3\nsuccessful ATOs. \nNow, working on 4 new accreditation including re-authorization for an existing project. \nSucceeded in writing and implementing\nvulnerability management for existing accredited systems. \nSuccess of the accreditation hinged on coordination with ONI Enterprise in critical design\ndecisions and to help the program integrate smoothly into the Enterprise thru many meetings, analyzing the Enterprise business model to understand\nthe best fit for the program. \nThe different projects required careful management of specific STIG compliance and hardening for the different\nconfigurations and services required for the specific domain to be integrated.Â Â \n Analyzed complex computer systems to assess vulnerability and\nrisk.Â Â \n \nSupervised \n5\n \nexternal computer consultants and vendors.Â Â \n \nManaged application patches, data backup, security changes and\nnetwork configuration.\nCompany Name\n \nCity\n \n, \nState\n \nSystems Engineer\n \n02/2006\n \nto \n02/2011\nI was Hired to initiate processing strategies in fulfilling department analyst requirements. \nRequirements were fulfilled thru i\n dentifying product\nproblems and strengths and collected data on customer experienceÂ \n and review of Enterprise compliance to transition to new technology for\nsupporting new processing needs thru proper processing power.Â  The next challengeÂ  came as storage requirements for better performance and\nmore controlled uses. \nAfter careful study of local infrastructure design, a local storage with off the shelf solutions was adopted to grow local\nstorage to over 200TB. \nIn using this solution, the department saved just over a million dollars in purchasing and maintenance costs compared to the\nalternative. Next came requirements to improve processing of future big data formats fulfilled in a Red Hat Linux high compute cluster I designed,\npurchased and accredited for operation in the Enterprise.Â  Improvement on big data analytical processing reduced time from 30 hours to 30\nminutes as well as allow for more robust data thru higher selections of sensors, frequencies and range than allowed thru the traditional process.\nCompany Name\n \nCity\n \n, \nState\n \nSenior Systems Analyst\n \n02/1999\n \nto \n02/2006\nI was hired to improve corporate and client communications and processing requirements which resulted in the design, build and deployment of 3\nEnterprise network solutions. \nOne solution resulted in expanding capabilities to supporting Washington Navy Yard, Norfolk Virginia and Hawaii\nsupport facilities. \nFulfilled requirements for detecting crucial network software/hardware weaknesses and developing preventive strategies and\nsolutions for avoiding interruptions and increasing system security thru documenting system layouts, wiring diagrams and addressing schema to\nunderstand layouts and make informed solutions to upper management. \nEducation and Training\nAssociate of Science\n \n:\n \nElectronic Engineering\n \n1980\n \nFlorence Darlington Technical School\n \n, \nCity\n \n, \nState\nElectronic Engineering.Â Â \nDean'sÂ list for high GPA.Â \nClass President for second year\nSkills\nActive Directory\nHardware Engineering\nInformation Technology\nRed Hat Enterprise Linux Servers\nMS Windows Servers\nMS Windows Desktop\nNetwork Design & Troubleshooting\nArchitectural Diagrams\nAccreditation Boundarys\nRisk Management\nEnterprise Strategies\nVendor Relations\nDesktop Publishing Software: Photoshop, Illustrator, HTML\nTeam Work\n\nCollaboration",
  "processed": {
    "clean_text": "information technology summary dedicated information assurance professional â well-versed in analyzing and mitigating risk and finding cost-effective solutions. excels at boosting performance and productivity by establishing realistic goals and enforcing deadlines.â versatile it professional with 37 years of enterprise design and engineering methodology. skills enterprise platforms knowledge of product lifecycle management (plm) project tracking hardware and software upgrade planning product requirements documentation self-directed ms visio decisive collaborative domain active directory layout data storage engineering information assurance risk management framework (rmf) active directory design and deployment workstation build and deployment systems accreditation packages red hat enterprise linux installation and hardening network design  troubleshooting â high performance computing experience company name city , state information technology 02/2011 to current i was hired to manage accreditation efforts for a major department modernization project involving 3 accreditation packages each leading to successful authorization to operate decisions. responsibilities then increased to include all departmental accreditation efforts leading to another 3 successful atos. now, working on 4 new accreditation including re-authorization for an existing project. succeeded in writing and implementing vulnerability management for existing accredited systems. success of the accreditation hinged on coordination with oni enterprise in critical design decisions and to help the program integrate smoothly into the enterprise thru many meetings, analyzing the enterprise business model to understand the best fit for the program. the different projects required careful management of specific stig compliance and hardening for the different configurations and services required for the specific domain to be integrated.â â analyzed complex computer systems to assess vulnerability and risk.â â supervised 5 external computer consultants and vendors.â â managed application patches, data backup, security changes and network configuration. company name city , state systems engineer 02/2006 to 02/2011 i was hired to initiate processing strategies in fulfilling department analyst requirements. requirements were fulfilled thru i dentifying product problems and strengths and collected data on customer experienceâ and review of enterprise compliance to transition to new technology for supporting new processing needs thru proper processing power.â the next challengeâ came as storage requirements for better performance and more controlled uses. after careful study of local infrastructure design, a local storage with off the shelf solutions was adopted to grow local storage to over 200tb. in using this solution, the department saved just over a million dollars in purchasing and maintenance costs compared to the alternative. next came requirements to improve processing of future big data formats fulfilled in a red hat linux high compute cluster i designed, purchased and accredited for operation in the enterprise.â improvement on big data analytical processing reduced time from 30 hours to 30 minutes as well as allow for more robust data thru higher selections of sensors, frequencies and range than allowed thru the traditional process. company name city , state senior systems analyst 02/1999 to 02/2006 i was hired to improve corporate and client communications and processing requirements which resulted in the design, build and deployment of 3 enterprise network solutions. one solution resulted in expanding capabilities to supporting washington navy yard, norfolk virginia and hawaii support facilities. fulfilled requirements for detecting crucial network software/hardware weaknesses and developing preventive strategies and solutions for avoiding interruptions and increasing system security thru documenting system layouts, wiring diagrams and addressing schema to understand layouts and make informed solutions to upper management. education and training associate of science : electronic engineering 1980 florence darlington technical school , city , state electronic engineering.â â deansâ list for high gpa.â class president for second year skills active directory hardware engineering information technology red hat enterprise linux servers ms windows servers ms windows desktop network design  troubleshooting architectural diagrams accreditation boundarys risk management enterprise strategies vendor relations desktop publishing software: photoshop, illustrator, html team work collaboration",
    "metadata": {
      "has_education": true
    },
    "sections": {},
    "keywords": [
      "enterprise",
      "solution",
      "design",
      "requirement",
      "system",
      "accreditation",
      "management",
      "data",
      "thru",
      "processing",
      "information",
      "network",
      "technology",
      "engineering",
      "project",
      "storage",
      "city",
      "state",
      "risk",
      "performance",
      "product",
      "active",
      "directory",
      "layout",
      "deployment",
      "red",
      "hat",
      "linux",
      "high",
      "company"
    ]
  },
  "file_path": "/Users/proxim/Desktop/Automated-First-Screener-and-AI-Job-Matching-NLP-WebEngine/data/raw/resumes/r487c0.pdf"
}