{
  "id": "r51e93",
  "filename": "24230851.pdf",
  "upload_time": "17:35:19",
  "document_type": "resume",
  "original_text": "CUSTOMER SERVICE REPRESENTATIVE\nSummary\nRecognized for being able to promote exceptional results and productivity from a team of individuals. Six years experience within \nContact Center\nOperations, supervised teams of 20 up to 100 employees. Extensive experience within the Contact Center Operations environment, including daily\ncommunications with all levels of leadership supervisor, management. Recognized for ability to multitask and excel at any task assigned, analytical\nand organizational skills.\nSkills\nMicrosoft Office\nVerint\nSiebel\nRTA\nAvaya\nOperating Systems\nVista\nWindows 7\nWindows 8\nWindows 10\nExperience\n08/2015\n \nto \nCurrent\nCustomer Service Representative\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nHandled large call volume while being able to multi task and provide accurate information to the consumers while maintaining a high level of\nquality of service.\nKeep records of customer interactions or transactions, recording details of inquiries, complaints, or comments, as well as actions taken.\nConfer with customers by telephone or in person to provide information about products or services, take or enter orders, cancel accounts,\nor obtain details of complaints.\nRefer unresolved customer grievances to designated departments for further investigation.\nComplete contract forms, prepare change of address records, or issue service discontinuance orders, using computers.\n09/2014\n \nto \n07/2015\nCustomer Service Supervisor\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nProvides supervision and leadership to a team of 20 to 60 customer service representatives and through the various communication channels\nwithin operations (telephone, e- mail, written correspondence, and web-chat).\nMet contract specific goals/objectives as required \nExtensive experience with the Healthcare Marketplace \nSupervise, develop, and coach\nCSRs to assure productivity, quality, attendance, and timeliness of work in the completion \nof assigned projects and departmental goals\nMaintain daily reports regarding adherence, service level, and staffed hours to assure CSR's and team are meeting contract \nand department\ngoals \nAssume leadership responsibility for floor management (including agent placement), department tasks, and contact center \nincentives\nWork closely as a team with CSR's, other supervisors, customer service managers, and senior site managers within \noperational areas of the\ncontact center \nComplete and deliver employee performance appraisals on a monthly and yearly basis and corrective actions as needed\nInterviewed and hired qualified candidates for CCO customer service representative as well as performed substantial \nportion of recruitment\nfor new hire employees (including advertising and job fairs) General Dynamics Information Technology.\n10/2013\n \nto \n09/2014\nCustomer Service Representative\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nHandled large call volume while being able to multi task and provide accurate information to the consumers while maintaining a high level of\nquality of service.\nKeep records of customer interactions or transactions, recording details of inquiries, complaints, or comments, as well \nas actions taken.\nConfer with customers by telephone or in person to provide information about products or services, take or enter \norders, cancel accounts,\nor obtain details of complaints.\nRefer unresolved customer grievances to designated departments for further investigation.\nComplete contract forms, prepare change of address records, or issue service discontinuance orders, using computers.\n06/2011\n \nto \n10/2013\nCustomer Service Representative\n \nCompany Name\nHandled 100 calls a day while being able to multi task and provide accurate information to the consumers while maintaining a high level of\nquality of service.\nKeep records of customer interactions or transactions, recording details of inquiries, complaints, or comments, as well \nas actions taken.\nConfer with customers by telephone or in person to provide information about products or services, take or enter \norders, cancel accounts,\nor obtain details of complaints.\n\nPracticed Conflict Resolution, refer unresolved customer grievances to designated departments for further \ninvestigation.\nComplete contract forms, prepare change of address records, or issue service discontinuance orders, using computers.\nEducation and Training\n2013\nAssociate of Science\n \n: \nPsychology\n \nEastern Kentucky University\n \nï¼​ \nCity\n \n, \nState\nSkills\nadministrative, advertising, Avaya, budget, coach, Conflict Resolution, Prepare contracts, clients, customer service, dispatching, e- mail, forms,\nInformation Technology, Inspect, ISO 9001, leadership, materials, Microsoft Office, Operating Systems, developer, performance appraisals,\npersonnel, progress, quality, quality control, recording, recruitment, safety codes, Siebel, supervisory, supervision, telephone, Time Management,\nVista, written",
  "processed": {
    "clean_text": "customer service representative summary recognized for being able to promote exceptional results and productivity from a team of individuals. six years experience within contact center operations, supervised teams of 20 up to 100 employees. extensive experience within the contact center operations environment, including daily communications with all levels of leadership supervisor, management. recognized for ability to multitask and excel at any task assigned, analytical and organizational skills. skills microsoft office verint siebel rta avaya operating systems vista windows 7 windows 8 windows 10 experience 08/2015 to current customer service representative company name ï¼ city , state handled large call volume while being able to multi task and provide accurate information to the consumers while maintaining a high level of quality of service. keep records of customer interactions or transactions, recording details of inquiries, complaints, or comments, as well as actions taken. confer with customers by telephone or in person to provide information about products or services, take or enter orders, cancel accounts, or obtain details of complaints. refer unresolved customer grievances to designated departments for further investigation. complete contract forms, prepare change of address records, or issue service discontinuance orders, using computers. 09/2014 to 07/2015 customer service supervisor company name ï¼ city , state provides supervision and leadership to a team of 20 to 60 customer service representatives and through the various communication channels within operations (telephone, e- mail, written correspondence, and web-chat). met contract specific goals/objectives as required extensive experience with the healthcare marketplace supervise, develop, and coach csrs to assure productivity, quality, attendance, and timeliness of work in the completion of assigned projects and departmental goals maintain daily reports regarding adherence, service level, and staffed hours to assure csrs and team are meeting contract and department goals assume leadership responsibility for floor management (including agent placement), department tasks, and contact center incentives work closely as a team with csrs, other supervisors, customer service managers, and senior site managers within operational areas of the contact center complete and deliver employee performance appraisals on a monthly and yearly basis and corrective actions as needed interviewed and hired qualified candidates for cco customer service representative as well as performed substantial portion of recruitment for new hire employees (including advertising and job fairs) general dynamics information technology. 10/2013 to 09/2014 customer service representative company name ï¼ city , state handled large call volume while being able to multi task and provide accurate information to the consumers while maintaining a high level of quality of service. keep records of customer interactions or transactions, recording details of inquiries, complaints, or comments, as well as actions taken. confer with customers by telephone or in person to provide information about products or services, take or enter orders, cancel accounts, or obtain details of complaints. refer unresolved customer grievances to designated departments for further investigation. complete contract forms, prepare change of address records, or issue service discontinuance orders, using computers. 06/2011 to 10/2013 customer service representative company name handled 100 calls a day while being able to multi task and provide accurate information to the consumers while maintaining a high level of quality of service. keep records of customer interactions or transactions, recording details of inquiries, complaints, or comments, as well as actions taken. confer with customers by telephone or in person to provide information about products or services, take or enter orders, cancel accounts, or obtain details of complaints. practiced conflict resolution, refer unresolved customer grievances to designated departments for further investigation. complete contract forms, prepare change of address records, or issue service discontinuance orders, using computers. education and training 2013 associate of science : psychology eastern kentucky university ï¼ city , state skills administrative, advertising, avaya, budget, coach, conflict resolution, prepare contracts, clients, customer service, dispatching, e- mail, forms, information technology, inspect, iso 9001, leadership, materials, microsoft office, operating systems, developer, performance appraisals, personnel, progress, quality, quality control, recording, recruitment, safety codes, siebel, supervisory, supervision, telephone, time management, vista, written",
    "metadata": {
      "has_education": true
    },
    "sections": {},
    "keywords": [
      "service",
      "customer",
      "information",
      "representative",
      "provide",
      "quality",
      "record",
      "detail",
      "complaint",
      "order",
      "contract",
      "team",
      "level",
      "task",
      "telephone",
      "department",
      "able",
      "experience",
      "within",
      "contact",
      "center",
      "leadership",
      "company",
      "name",
      "city",
      "state",
      "recording",
      "well",
      "action",
      "complete"
    ]
  },
  "file_path": "/Users/proxim/Desktop/Automated-First-Screener-and-AI-Job-Matching-NLP-WebEngine/data/raw/resumes/r51e93.pdf"
}