{
  "id": "r53a8c",
  "filename": "17688766.pdf",
  "upload_time": "17:35:25",
  "document_type": "resume",
  "original_text": "DIRECTOR OF INFORMATION TECHNOLOGY\nSummary\nIT Director/Manager with extensive experience in network operations, leveraging expertise in organization growth and problem solving. Driven,\nprofessional and detailed-oriented with the proven ability to plan, design and implement technical systems, improve process flow and administer\ndepartmental budgets.\nHighlights\nOperating Systems: Windows 7, 8.1, 10, Windows Server 2008 R2 & 2012\nExchange Server 2007 & 2010 - Apple; Mac OSX & iOS - BB10 OS, Android\nLAN, VPN, WAN IP networking\nCitrix and remote terminal services, LogMeIn, Team Viewer, Skype for business.\nExperience with SQL, SaaS and Hyper-V\nActive Directory Services, Group Policy, DNS, DHCP, SSL, WSUS and FTP\nSan/Nas Storage, Cisco Routers, HP Switches, Sonicwall Firewalls\nSymantec Backup/AntiVirus, Trend-Micro, Arcserve, Acronis\nExperience\nJanuary 1996\n \nto \nJanuary 2016\nCompany Name\n \nCity\n \n, \nState\n \nDirector of Information Technology\nDirected and managed the entire IT operations for a commercial real estate investment company with over 15 locations throughout the U.S.\nForecasted and planned all network information processing and communication needs for the entire company.\nProvided senior level leadership on all IT security and risk management concerns.\nBeing proactive to ensure the continued functionality of a stable, reliable, and secure IT environment, including focus on current and\nanticipated cybersecurity threats and risk.\nEnsured technology compliance with SOX, PCI, IT general and regulatory controls.\nEstablished, documented and administered all IT operational policies and procedures to control systems and integrity risks.\nCreated and analyzed annual IT operational and capital budgets and 5-year plans.\nEfficiently used monies allocated within those budgets.\nInspected 3rd party contracts, evaluated and negotiated proposals for software and hardware services.\nProject leader for developing, planning and instituting disaster recovery and business continuity.\nProvided redundancy on all network components and system failovers.\nRedundant communication and internet lines using BGP for failover.\nEnsured the consistency of existing applications by creating, maintaining, testing and enforcing standards/procedures for implementing\nsoftware rollouts.\nUsed document imaging system for record retention.\nMaintained and upgraded all Audio/Video in conference rooms.\nInstalled office security: Card key and camera systems.\nHired and managed system administrators and supervised outside consultants.\nOriginally hired as IT Manager promoted to Director in 2002.\nJanuary 1995\n \nto \nJanuary 1996\nCompany Name\n \nCity\n \n, \nState\n \nManager of Information Technologies\nProvided network administration, PC and network trouble shooting, file server configuration, backup systems configuration, network and\nswitch management.\nMaintained Lotus Notes Domino Mail Server, operating system and application software upgrading, anti-virus and firewall management,\nhardware configuration and troubleshooting, application maintenance and administration.\nJanuary 1992\n \nto \nJanuary 1995\nCompany Name\n \nCity\n \n, \nState\n \nSole IT person Manager of Information Services\nRecruited to relocate to Chicago to run the accounting operations system.\nBegan at LINC as the Accounting Operations Manager eventually became the Network Manager.\nMaintained UNIX and Novell servers.\nJanuary 1991\n \nto \nJanuary 1992\nCompany Name\n \nCity\n \n, \nState\n \nCustomer Service Representative\nRecruited by Software Company to relocate to Wellesley, MA.\nProvided technical support for customers.\nEducation\nBaruch College\n \nCity\n \n, \nState\n \nAccounting\n \nBS\n \nAccounting\nSkills\nAccounting, Active Directory, anti-virus, AntiVirus, Apple, Arcserve, Audio, Backup, BGP, budgets, Cisco Routers, Citrix, hardware, contracts,\n\nDHCP, disaster recovery, DNS, Firewalls, firewall, focus, FTP, hardware configuration and troubleshooting, HP, imaging, IP, LAN, leadership,\nLINC, Domino, Lotus Notes, MA, Mac, Director, Exchange Server, Mail, office, Windows 7, network administration, Nas, Network,\nnetworking, Novell servers, Operating Systems, OS, operating system, PCI, camera, policies, Project leader, proposals, real estate, risk\nmanagement, San, server configuration, SQL, SSL, Switches, switch, Symantec, technical support, Trend, trouble shooting, UNIX, upgrading,\nVideo, VPN, WAN, Windows Server",
  "processed": {
    "clean_text": "director of information technology summary it director/manager with extensive experience in network operations, leveraging expertise in organization growth and problem solving. driven, professional and detailed-oriented with the proven ability to plan, design and implement technical systems, improve process flow and administer departmental budgets. highlights operating systems: windows 7, 8.1, 10, windows server 2008 r2  2012 exchange server 2007  2010 - apple; mac osx  ios - bb10 os, android lan, vpn, wan ip networking citrix and remote terminal services, logmein, team viewer, skype for business. experience with sql, saas and hyper-v active directory services, group policy, dns, dhcp, ssl, wsus and ftp san/nas storage, cisco routers, hp switches, sonicwall firewalls symantec backup/antivirus, trend-micro, arcserve, acronis experience january 1996 to january 2016 company name city , state director of information technology directed and managed the entire it operations for a commercial real estate investment company with over 15 locations throughout the u.s. forecasted and planned all network information processing and communication needs for the entire company. provided senior level leadership on all it security and risk management concerns. being proactive to ensure the continued functionality of a stable, reliable, and secure it environment, including focus on current and anticipated cybersecurity threats and risk. ensured technology compliance with sox, pci, it general and regulatory controls. established, documented and administered all it operational policies and procedures to control systems and integrity risks. created and analyzed annual it operational and capital budgets and 5-year plans. efficiently used monies allocated within those budgets. inspected 3rd party contracts, evaluated and negotiated proposals for software and hardware services. project leader for developing, planning and instituting disaster recovery and business continuity. provided redundancy on all network components and system failovers. redundant communication and internet lines using bgp for failover. ensured the consistency of existing applications by creating, maintaining, testing and enforcing standards/procedures for implementing software rollouts. used document imaging system for record retention. maintained and upgraded all audio/video in conference rooms. installed office security: card key and camera systems. hired and managed system administrators and supervised outside consultants. originally hired as it manager promoted to director in 2002. january 1995 to january 1996 company name city , state manager of information technologies provided network administration, pc and network trouble shooting, file server configuration, backup systems configuration, network and switch management. maintained lotus notes domino mail server, operating system and application software upgrading, anti-virus and firewall management, hardware configuration and troubleshooting, application maintenance and administration. january 1992 to january 1995 company name city , state sole it person manager of information services recruited to relocate to chicago to run the accounting operations system. began at linc as the accounting operations manager eventually became the network manager. maintained unix and novell servers. january 1991 to january 1992 company name city , state customer service representative recruited by software company to relocate to wellesley, ma. provided technical support for customers. education baruch college city , state accounting bs accounting skills accounting, active directory, anti-virus, antivirus, apple, arcserve, audio, backup, bgp, budgets, cisco routers, citrix, hardware, contracts, dhcp, disaster recovery, dns, firewalls, firewall, focus, ftp, hardware configuration and troubleshooting, hp, imaging, ip, lan, leadership, linc, domino, lotus notes, ma, mac, director, exchange server, mail, office, windows 7, network administration, nas, network, networking, novell servers, operating systems, os, operating system, pci, camera, policies, project leader, proposals, real estate, risk management, san, server configuration, sql, ssl, switches, switch, symantec, technical support, trend, trouble shooting, unix, upgrading, video, vpn, wan, windows server",
    "metadata": {
      "has_education": true
    },
    "sections": {},
    "keywords": [
      "system",
      "network",
      "server",
      "january",
      "company",
      "information",
      "service",
      "city",
      "state",
      "manager",
      "configuration",
      "accounting",
      "director",
      "technology",
      "operation",
      "budget",
      "operating",
      "window",
      "switch",
      "firewall",
      "name",
      "provided",
      "risk",
      "management",
      "software",
      "hardware",
      "experience",
      "technical",
      "policy",
      "application"
    ]
  },
  "file_path": "/Users/proxim/Desktop/Automated-First-Screener-and-AI-Job-Matching-NLP-WebEngine/data/raw/resumes/r53a8c.pdf"
}