{
  "id": "r5be0b",
  "filename": "21283365.pdf",
  "upload_time": "17:35:21",
  "document_type": "resume",
  "original_text": "DIRECTOR OF INFORMATION TECHNOLOGY\nSummary\nI am a solutions-oriented professional with solid experience in various IT environments. LEADERSHIP Motivating and managing and a robust\nteam of internal and remote staff members Establishing and maintaining effective partnerships, through collaboration and information technology in\nsupport of the organization. Managing the day-to-day responsibilities of a 24x7x 365 IT organization prudently. Managing a large IT environment\nwith ~10,000 SaaS. Assigning clear authority and holding others accountable for goal achievement.\nSkills\nCOMMUNICATION\nCollaborating with clients and fostering a positive business relationship to meet all levels of IT service demands (Technical, R&D and\noperations and maintenance)\nClearly discussing and conveying Information Technology concepts and terminology with both technical and non-technical staff at all levels\nwithin and outside the Department\nProducing clear and concise written documents, emails, project status reports and briefs\nCommunicating effectively with various levels of the organization\nExpertise\nMaking strategic judgments and evaluating the impact\nCloud Environments Design & Implementation\nNetwork Design & Implementation VOIP\nCyber Security (NIST HITRUST/HIPAA)\nProject Management\nTechnical Support Management\nBudget Management\nDeveloping and responding to Request for Proposals\nCurrent with Emerging Technologies\nExperience\nDirector of Information technology\n \nSep 2005\n \nto \nCurrent\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nAt Adsystech I am one of three employees that have a key man insurance policy against them.\nThis in of itself, speaks to the trust and value I provide the organization.\nI was hired to design, and deploy the first data center the company owned in its efforts to deploy a new offering, an enterprise Software as a\nService (SaaS) product.\nI was initially an employee of an Adsystech customer working with the Adsystech EVP on an enterprise County Wide project and posed\nthe idea that they should move from \"selling\" software to \"renting\" it via an up and coming model SaaS.\nToday, everyone is using SaaS products and paying monthly for various products but in 2004 (when I initially made the proposal) it was an\nexciting and new potential market which I leveraged to increase the returns at Adsystech and most importantly, generate new recurring\nrevenue.\nI was hired in 05' to put in place all things SaaS, this included designing a data center from the ground up, creating cyber security policies\nand controls, putting together a team to support the data center as well as a team to provide technical support for the new product offering.\nAs an early adopter, in 2008 I designed and deployed a hybrid cloud environment in our data center.\nAgain in 08' this was a new technology but my decision demonstrates foresight in emerging technologies and understand in the value of\nleveraging technology to become more efficient and financial prudent.\nI'm very proud of the work I've done and Adsystech, below are some key areas in my control: Network Design Monitoring and\nMaintenance Cloud Technologies Cyber Security (NITS, CIS, HITRUST/HIPAA) Project Management Technical Support Management\nStaff Professional Development RFP Responses.\nInformation technology Manager\n \nSep 2003\n \nto \nSep 2005\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nCity organization responsible for managing +120 Million dollars for support of County Wide Human Service programs.\nI was hired as Project Manager and was quickly promoted to the Information Technology Manger.\nAs PM I identified, evaluated and lead a bi-County steering committee in all technical aspect in an RFP release and selection process.\nAfter promotion I continued to server as the project manager for the 2.5 million dollar system rollout which ranged from gathering the\nbusiness requirements for the design and deployment to creating the processes and managing the team to for the roll out to ~2000 users\nacross Los Angeles County.\nIn this capacity I managed a project support team including administrators, help desk staff and trainers.\nAs the IT Manager, I supervised network administrators and was responsible for all high level network design and architecture for the\norganization.\nI evaluated the security risks, ensuring HITECH/HIPAA protocol were followed.\nBelow are some key areas in my control: Network Design and Oversight Project Management Product Training and Support.\nInformation technology Manager\n \nSep 1998\n \nto \nMar 2003\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nAt Relax the Back I was responsible for the overall management, infrastructure and strategic planning of our National point of sale network\n\nat 100+ retail locations and 5 distribution centers.\nI managed the ERP solution at our manufacturing plant in Boston and our accounting and HR systems at the corporate office.\nNine short months after starting with the company, I was promoted to IT Manage.\nI acted as liaison between vendors, operation staff and the CFO for all major projects on time and on budget.\nCisco Routers/ Firewalls.\nWindows Server Management.\nDesktop Support.\nEducation and Training\nM.S\n \n, \nIT\n \nCSUF\n \nIT\nFullerton Masters of Science Degree\n \n, \nInformation Technology\n \nMihaylo College of Business and Economics, California State University\nInformation Technology GPA: 3.4\nB.S\n \n, \nIT\n \nUOP\n \nIT\nBachelors of Science Degree\n \n, \nInformation Technology\n \nUniversity of Phoenix\n \nInformation Technology GPA: 3.7\nSkills\naccounting, Budget Management, budget, bi, Cisco Routers, concise, clients, designing, ERP, financial, Firewalls, help desk, HR, Information\nTechnology, insurance, managing, market, office, 2000, enterprise, network design and architecture, Network Design, Network Design &\nImplementation, network, policies, processes, Producing, Project Management, promotion I, Proposals, proposal, retail, RFP, selling, software\ndevelopment, strategic, strategic planning, technical support, Desktop Support, VOIP, Windows Server, written, written communication skills",
  "processed": {
    "clean_text": "director of information technology summary i am a solutions-oriented professional with solid experience in various it environments. leadership motivating and managing and a robust team of internal and remote staff members establishing and maintaining effective partnerships, through collaboration and information technology in support of the organization. managing the day-to-day responsibilities of a 24x7x 365 it organization prudently. managing a large it environment with 10,000 saas. assigning clear authority and holding others accountable for goal achievement. skills communication collaborating with clients and fostering a positive business relationship to meet all levels of it service demands (technical, rd and operations and maintenance) clearly discussing and conveying information technology concepts and terminology with both technical and non-technical staff at all levels within and outside the department producing clear and concise written documents, emails, project status reports and briefs communicating effectively with various levels of the organization expertise making strategic judgments and evaluating the impact cloud environments design  implementation network design  implementation voip cyber security (nist hitrust/hipaa) project management technical support management budget management developing and responding to request for proposals current with emerging technologies experience director of information technology sep 2005 to current company name ï¼ city , state at adsystech i am one of three employees that have a key man insurance policy against them. this in of itself, speaks to the trust and value i provide the organization. i was hired to design, and deploy the first data center the company owned in its efforts to deploy a new offering, an enterprise software as a service (saas) product. i was initially an employee of an adsystech customer working with the adsystech evp on an enterprise county wide project and posed the idea that they should move from selling software to renting it via an up and coming model saas. today, everyone is using saas products and paying monthly for various products but in 2004 (when i initially made the proposal) it was an exciting and new potential market which i leveraged to increase the returns at adsystech and most importantly, generate new recurring revenue. i was hired in 05 to put in place all things saas, this included designing a data center from the ground up, creating cyber security policies and controls, putting together a team to support the data center as well as a team to provide technical support for the new product offering. as an early adopter, in 2008 i designed and deployed a hybrid cloud environment in our data center. again in 08 this was a new technology but my decision demonstrates foresight in emerging technologies and understand in the value of leveraging technology to become more efficient and financial prudent. im very proud of the work ive done and adsystech, below are some key areas in my control: network design monitoring and maintenance cloud technologies cyber security (nits, cis, hitrust/hipaa) project management technical support management staff professional development rfp responses. information technology manager sep 2003 to sep 2005 company name ï¼ city , state city organization responsible for managing 120 million dollars for support of county wide human service programs. i was hired as project manager and was quickly promoted to the information technology manger. as pm i identified, evaluated and lead a bi-county steering committee in all technical aspect in an rfp release and selection process. after promotion i continued to server as the project manager for the 2.5 million dollar system rollout which ranged from gathering the business requirements for the design and deployment to creating the processes and managing the team to for the roll out to 2000 users across los angeles county. in this capacity i managed a project support team including administrators, help desk staff and trainers. as the it manager, i supervised network administrators and was responsible for all high level network design and architecture for the organization. i evaluated the security risks, ensuring hitech/hipaa protocol were followed. below are some key areas in my control: network design and oversight project management product training and support. information technology manager sep 1998 to mar 2003 company name ï¼ city , state at relax the back i was responsible for the overall management, infrastructure and strategic planning of our national point of sale network at 100 retail locations and 5 distribution centers. i managed the erp solution at our manufacturing plant in boston and our accounting and hr systems at the corporate office. nine short months after starting with the company, i was promoted to it manage. i acted as liaison between vendors, operation staff and the cfo for all major projects on time and on budget. cisco routers/ firewalls. windows server management. desktop support. education and training m.s , it csuf it fullerton masters of science degree , information technology mihaylo college of business and economics, california state university information technology gpa: 3.4 b.s , it uop it bachelors of science degree , information technology university of phoenix information technology gpa: 3.7 skills accounting, budget management, budget, bi, cisco routers, concise, clients, designing, erp, financial, firewalls, help desk, hr, information technology, insurance, managing, market, office, 2000, enterprise, network design and architecture, network design, network design  implementation, network, policies, processes, producing, project management, promotion i, proposals, proposal, retail, rfp, selling, software development, strategic, strategic planning, technical support, desktop support, voip, windows server, written, written communication skills",
    "metadata": {
      "has_education": true
    },
    "sections": {},
    "keywords": [
      "technology",
      "information",
      "support",
      "project",
      "design",
      "network",
      "management",
      "technical",
      "managing",
      "organization",
      "team",
      "staff",
      "saas",
      "company",
      "adsystech",
      "center",
      "new",
      "product",
      "manager",
      "environment",
      "level",
      "strategic",
      "security",
      "budget",
      "proposal",
      "sep",
      "city",
      "state",
      "data",
      "various"
    ]
  },
  "file_path": "/Users/proxim/Desktop/Automated-First-Screener-and-AI-Job-Matching-NLP-WebEngine/data/raw/resumes/r5be0b.pdf"
}