{
  "id": "r5c3cc",
  "filename": "26801767.pdf",
  "upload_time": "17:35:18",
  "document_type": "resume",
  "original_text": "DIRECTOR, INFORMATION TECHNOLOGY\nProfessional Summary\nResults-driven IT director with over 30 years of experience in diverse industries, including Port and Higher Education. Expertise includes team\nleadership, technical architecture, training and development, disaster recovery planning, and information protection analysis. Dynamic, resourceful,\nand extremely driven individual with a deep passion for creating and delivering programs and solutions that empower a team, company, and\ncustomer to meet and exceed desired expectations.\nCore Qualifications\nIT management\nResults-oriented\nOperations management\nBudget administration\nChange management\nProblem resolution\nTeam leadership\nDecisive leader\nCost reduction\nExperience\nDirector, Information Technology\n \nAugust 2008\n \nto \nCurrent\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nManages information technology computer center for the Board of Commissioners of the Port of New Orleans (Board).\nDevelops, initiates, implements and monitors procedures necessary to determine the need for improvement of the system and operational\nactivities.\nMakes recommendations on the acquisition, lease or rental of equipment and computer services, the development and implementation of\nnew data processing programs and the expansion of existing equipment and programs.\nProvide information and recommendations to the Port's management relevant to the establishment of priorities for prospective system\napplications.\nDevelops and/or revises data and practices concerning plan and procedures consistent with agency goals and objectives in the information\ncommunications fields.\nFormulates requests for bid and requests for proposals for major and minor I.T. professional services and hardware contracts.\nDirectly involved in vendor selection and final contract negotiations and approvals.\nSupervises information technology and telecommunication staff and provides guidance and direction of daily activities.\nDevelops and supervises the work of system project consultants.\nProvides consulting services to all Port departments and divisions concerning information systems, new programs and data processing.\nDevelops form management procedures and reviews and justifies current practices.\nEvaluates existing manual and automated information-related activities including physical work environment, administrative procedures and\nwork flows.\nRepresents the Board of Commissioners on national and international committees and conferences as necessary.\nPrepares hardware, software and personnel budgets for the I.T. department.\nStaying abreast of the new technologies, doing cost/benefit analysis of these technologies and the incorporation of these technologies into the\nbudgeting process.\nParticipates in formulating Board's current and future I.T. short and long term strategic planning including PC networking, Email, IBM\nISeries Support, INTERNET, Imaging, Computer Aided Software Engineering, Communication Protocols, EDI, GIS etc.\nReviews and makes recommendations to management on the use and control of mainframe data processing systems for internal operations,\nand for servicing the maritime community in the movement of cargo through the Port.\nAssures that software utilizing the mainframe and remote computer local area, wide area network equipment are protected and secure\nagainst viruses, outside intrusion and cyber-attack.\nSupervise the development of long range plans for the use of data processing equipment by the Board, related private sector firms and\ngovernment agencies.\nAssure the confidentiality of priority data and supervise the distribution of that data to the appropriate public and private sector recipients.\nCoordinates the flow of information among in-house departments, private sector maritime interests, U.S. Customs and other agencies.\nOversees a large repertoire of sophisticated application software.\nInterface with representatives of local, national and international maritime, and government agencies, offices and firms concerning the\ntechnical requirements and operation and benefits of the system.\nReviews, coordinates and makes recommendations to Board management and maritime interests on data transmission requirements.\nMonitors the preparation of reports submitted to Board management, the private sector and governmental agencies on data processing and\ntechnology issues.\nKeeps abreast of changes in the maritime industry as it affects the movement of bulk, general and containerized cargo and the flow of\nelectronic communications.\nIn charge of all telephone services required by the Board.\nThis includes the main administrative phone switch and sub-switches and all cell and broadband services.\nDefine scope of work and specifications for Hardware and software needs for Homeland Security Grant Investment Justifications from\n2008 to present.\nFAS system repair and updates, Building Access Command and Control, Security Camera Projects (Portwide and Cruise Terminals),\nWireless Backbone Infrastructure Portwide, MSCO provisioning, Mobile Command Center Repair and Upgrade, Underwater inspection\nvehicle and equipment, \nTechnology Installation on the Harbor Police Patrol Boat, Integration of Command Bridge Incident Control servers,\n\nGIS server implementation.\nAssociate Vice-President for Information Technology and Telecommunication\n \nApril 1980\n \nto \nOctober 2004\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nOversight responsibility for staff of 22 people, including 19 professionals.\nCreated and managed the Office of Information Technology.\nDeveloped and implemented the Strategic Plan for the Office of Information Technology.\nAwarded and directed $1.2 million grant to install the telecommunications fiber optic infrastructure for university.\nIntegrated the Management Information System department and the Telecommunication department into one cohesive department.\nProvided data and communication services to entire university community; implemented university-wide operation of telephone, PBX, voice\nand data wireless communications.\nDeveloped administrative system for all users to become proficient in these areas.\nEnsured data integrity and responsibility, standardizing ways and means of data collection, thereby maintaining the integrity of inputs and\noutcomes.\nCreated a filtering process to recognize viruses before they infect systems and thus established a reliable network free of viruses and spam.\nImplemented effective customer service, customized to suit individual needs, ensuring that all users were standardized for smooth\ncommunication with one another.\nCreated inclusive, customer-friendly, telecommunications climate, ensuring that students were respected equally with faculty.\nImplemented comprehensive university system, increasing the number of telecommunication units from 324 to more than 2,000.\nIncreased number of computer labs from two to nine, ensuring dramatic increase in resources to students without increasing staff.\nEducation\nPh.D\n \n: \nCoastal Oceanography\n \n, \n1996\n \nState University of New York\n \nï¼​ \nCity\n \n, \nState\n \n, \nUSA\nCoastal Oceanography\nM.S\n \n: \nComputer Science\n \nMarine Sciences Research Center \nSchool of Marine and Atmospheric Sciences\n \nComputer Science\nB.S\n \n: \nMathematics\n \nUniversity of Evansville\n \nï¼​ \nCity\n \n, \nState\n \nMathematics\nXavier University\n \nï¼​ \nCity\n \n, \nState\nProfessional Affiliations\n*Member of AAPA Information Technology Committee\n*Represented the University President at Southern Educational Foundation\n*Member of the Instructional Technology Assistance Project (ITAP) team\n*Participated in Educational Leadership Council\n*Served on Academic Computing Committee.\nAccomplishments\nMCSE (Microsoft Certified Systems Engineer)\nLDCCA Certified Installer for Fiber Optic and Category 5/5E\nCertified Construction Quality Management for Contractors by U.S. Army Core of Engineers\nWireless Network Auditing Training System\nForensics, Investigation & Response Training Hacker Techniques, Exploits and Incident Handling Training Accreditation\nSkills\nacademic, administrative, agency, Basic, benefits, broadband, budgeting, budgets, Cobol, Hardware, computer applications, conferences,\nconsulting, contract negotiations, contracts, customer service, data analysis, data collection, Data Processing, Database Management, DBase IV,\ndirection, EDI, Email, features, Fortran, GIS, government, grants, IBM, IBM compatible, Imaging, Information Systems, Information Technology,\ninspection, interpretation, laser, Macintosh, mainframe, MapInfo, Mathematics, Access, MS Excel, Office, Management Information System,\nMonitors, natural, Naval, network, Novell Netware, Oil, Operating Systems, Pascal, PBX, PC networking, personnel, Camera, Police,\nProgramming, proposals, Protocols, radio, real-time, reception, relational database, Research, RPG III, servers, Shell, Software Engineering,\nStrategic, strategic planning, SUN SPARC, switches, switch, telecommunications, Telecommunication, telephone, phone, transmission, UNIX and\nC, UNIX, Upgrade, Vax, VMS, voice and data, wide area network, written\nAdditional Information\n\nCOMMUNITY SERVICE Board of North Region Leadership Institute (NORLI) Volunteer activities at New Orleans Enhancement\nCenter: taught senior citizens how to use the computer Board of Advocates for Science & Math Education, Inc.\nHONORS/AWARDS/CERTIFICATIONS Certified Port Executive Turner Fellowship, State University of New York at Stony Brook\nUnited Negro College Fund Fellowship National Consortium of Educational Access Fellowship William and Mary Simon Fellowship",
  "processed": {
    "clean_text": "director, information technology professional summary results-driven it director with over 30 years of experience in diverse industries, including port and higher education. expertise includes team leadership, technical architecture, training and development, disaster recovery planning, and information protection analysis. dynamic, resourceful, and extremely driven individual with a deep passion for creating and delivering programs and solutions that empower a team, company, and customer to meet and exceed desired expectations. core qualifications it management results-oriented operations management budget administration change management problem resolution team leadership decisive leader cost reduction experience director, information technology august 2008 to current company name ï¼ city , state manages information technology computer center for the board of commissioners of the port of new orleans (board). develops, initiates, implements and monitors procedures necessary to determine the need for improvement of the system and operational activities. makes recommendations on the acquisition, lease or rental of equipment and computer services, the development and implementation of new data processing programs and the expansion of existing equipment and programs. provide information and recommendations to the ports management relevant to the establishment of priorities for prospective system applications. develops and/or revises data and practices concerning plan and procedures consistent with agency goals and objectives in the information communications fields. formulates requests for bid and requests for proposals for major and minor i.t. professional services and hardware contracts. directly involved in vendor selection and final contract negotiations and approvals. supervises information technology and telecommunication staff and provides guidance and direction of daily activities. develops and supervises the work of system project consultants. provides consulting services to all port departments and divisions concerning information systems, new programs and data processing. develops form management procedures and reviews and justifies current practices. evaluates existing manual and automated information-related activities including physical work environment, administrative procedures and work flows. represents the board of commissioners on national and international committees and conferences as necessary. prepares hardware, software and personnel budgets for the i.t. department. staying abreast of the new technologies, doing cost/benefit analysis of these technologies and the incorporation of these technologies into the budgeting process. participates in formulating boards current and future i.t. short and long term strategic planning including pc networking, email, ibm iseries support, internet, imaging, computer aided software engineering, communication protocols, edi, gis etc. reviews and makes recommendations to management on the use and control of mainframe data processing systems for internal operations, and for servicing the maritime community in the movement of cargo through the port. assures that software utilizing the mainframe and remote computer local area, wide area network equipment are protected and secure against viruses, outside intrusion and cyber-attack. supervise the development of long range plans for the use of data processing equipment by the board, related private sector firms and government agencies. assure the confidentiality of priority data and supervise the distribution of that data to the appropriate public and private sector recipients. coordinates the flow of information among in-house departments, private sector maritime interests, u.s. customs and other agencies. oversees a large repertoire of sophisticated application software. interface with representatives of local, national and international maritime, and government agencies, offices and firms concerning the technical requirements and operation and benefits of the system. reviews, coordinates and makes recommendations to board management and maritime interests on data transmission requirements. monitors the preparation of reports submitted to board management, the private sector and governmental agencies on data processing and technology issues. keeps abreast of changes in the maritime industry as it affects the movement of bulk, general and containerized cargo and the flow of electronic communications. in charge of all telephone services required by the board. this includes the main administrative phone switch and sub-switches and all cell and broadband services. define scope of work and specifications for hardware and software needs for homeland security grant investment justifications from 2008 to present. fas system repair and updates, building access command and control, security camera projects (portwide and cruise terminals), wireless backbone infrastructure portwide, msco provisioning, mobile command center repair and upgrade, underwater inspection vehicle and equipment, technology installation on the harbor police patrol boat, integration of command bridge incident control servers, gis server implementation. associate vice-president for information technology and telecommunication april 1980 to october 2004 company name ï¼ city , state oversight responsibility for staff of 22 people, including 19 professionals. created and managed the office of information technology. developed and implemented the strategic plan for the office of information technology. awarded and directed 1.2 million grant to install the telecommunications fiber optic infrastructure for university. integrated the management information system department and the telecommunication department into one cohesive department. provided data and communication services to entire university community; implemented university-wide operation of telephone, pbx, voice and data wireless communications. developed administrative system for all users to become proficient in these areas. ensured data integrity and responsibility, standardizing ways and means of data collection, thereby maintaining the integrity of inputs and outcomes. created a filtering process to recognize viruses before they infect systems and thus established a reliable network free of viruses and spam. implemented effective customer service, customized to suit individual needs, ensuring that all users were standardized for smooth communication with one another. created inclusive, customer-friendly, telecommunications climate, ensuring that students were respected equally with faculty. implemented comprehensive university system, increasing the number of telecommunication units from 324 to more than 2,000. increased number of computer labs from two to nine, ensuring dramatic increase in resources to students without increasing staff. education ph.d : coastal oceanography , 1996 state university of new york ï¼ city , state , usa coastal oceanography m.s : computer science marine sciences research center school of marine and atmospheric sciences computer science b.s : mathematics university of evansville ï¼ city , state mathematics xavier university ï¼ city , state professional affiliations member of aapa information technology committee represented the university president at southern educational foundation member of the instructional technology assistance project (itap) team participated in educational leadership council served on academic computing committee. accomplishments mcse (microsoft certified systems engineer) ldcca certified installer for fiber optic and category 5/5e certified construction quality management for contractors by u.s. army core of engineers wireless network auditing training system forensics, investigation  response training hacker techniques, exploits and incident handling training accreditation skills academic, administrative, agency, basic, benefits, broadband, budgeting, budgets, cobol, hardware, computer applications, conferences, consulting, contract negotiations, contracts, customer service, data analysis, data collection, data processing, database management, dbase iv, direction, edi, email, features, fortran, gis, government, grants, ibm, ibm compatible, imaging, information systems, information technology, inspection, interpretation, laser, macintosh, mainframe, mapinfo, mathematics, access, ms excel, office, management information system, monitors, natural, naval, network, novell netware, oil, operating systems, pascal, pbx, pc networking, personnel, camera, police, programming, proposals, protocols, radio, real-time, reception, relational database, research, rpg iii, servers, shell, software engineering, strategic, strategic planning, sun sparc, switches, switch, telecommunications, telecommunication, telephone, phone, transmission, unix and c, unix, upgrade, vax, vms, voice and data, wide area network, written additional information community service board of north region leadership institute (norli) volunteer activities at new orleans enhancement center: taught senior citizens how to use the computer board of advocates for science  math education, inc. honors/awards/certifications certified port executive turner fellowship, state university of new york at stony brook united negro college fund fellowship national consortium of educational access fellowship william and mary simon fellowship",
    "metadata": {
      "has_education": true,
      "years_experience": 30
    },
    "sections": {},
    "keywords": [
      "information",
      "data",
      "system",
      "technology",
      "management",
      "board",
      "computer",
      "service",
      "telecommunication",
      "university",
      "state",
      "new",
      "port",
      "processing",
      "agency",
      "communication",
      "department",
      "software",
      "city",
      "equipment",
      "maritime",
      "network",
      "science",
      "professional",
      "including",
      "team",
      "leadership",
      "training",
      "program",
      "operation"
    ]
  },
  "file_path": "/Users/proxim/Desktop/Automated-First-Screener-and-AI-Job-Matching-NLP-WebEngine/data/raw/resumes/r5c3cc.pdf"
}