{
  "id": "r62405",
  "filename": "33241454.pdf",
  "upload_time": "17:35:15",
  "document_type": "resume",
  "original_text": "INFORMATION TECHNOLOGY SUPERVISOR\nSummary\nSeeking a position as an Information Technology Specialist. Over 5 years of information technology experience in the U.S. Army, including over 1\nyear of supervisory experience. Trained personnel in the set-up of IT equipment, ensuring all equipment is properly connected and functioning.\nRegularly troubleshoot and install various IT equipment and systems. Accountable for the maintenance and inventory of over $1 million worth of IT\nand other communications equipment with zero losses or damages. Possess a Security \nand Microsoft Certification and a Secret Security\nClearance.\nHighlights\nExcellent communication techniques\nManufacturing systems integration\nMultidisciplinary exposure\nDesign instruction creation\nProject management\nComplex problem solver\nAdvanced critical thinking\nSharePoint\nMicrosoft Excel, Project and Visio\nAccomplishments\nArmy Achievement Medal for impacting the communications network and overall success of Key Resolve 13 in Yong San, Korea. Air Force\nAchievement Medal for supporting Operation Iraqi Freedom and performing as an outstanding senior controller. Certificate of Achievement for\noutstanding support as a member of the Tiger Team during the Windows 7 Migration. Good Conduct Medal for exemplary behavior, efficiency\nand fidelity in active federal military service.\nExperience\nInformation Technology Supervisor\n \n01/2011\n \nto \n05/2014\n \nCompany Name\n \nCity\n \n, \nState\nSupervise up to 10 personnel at one time, delegating tasks, conducting performance evaluations and providing corrective counseling as\nnecessary.\nTrain personnel in the set-up and proper use of IT related equipment while adhering to all policies and procedures.\nResponsible for the inventory of over $1 million worth of network communications equipment.\nTasked by President of the United States to act as supervisor and maintain signal communications for Fort Bragg army base.\nInformation Technology Technician\n \n01/2009\n \nto \n01/2011\n \nCompany Name\n \nCity\n \n, \nState\nMaintained communications equipment in order to effectively relay confidential and secret information.\nUtilized electronic test equipment to troubleshoot malfunctioning communications equipment and complete repairs as necessary.\nRegularly set up and added computer systems to a communication network, installing operation systems, accessing stored programs and\nutilizing IP addresses.\nReceived training in LAN/WAN protocols.\nRadiology Technologist\n \n05/2008\n \nto \n09/2008\n \nCompany Name\n \nCity\n \n, \nState\nRoutinely performed radiological examinations in a medical clinic.\nCompetent and experienced in the set-up and adjustment of medical devices or equipment.\nRegularly provided customer assistance, ensuring all patients received timely and accurate care.\nAccountable for the accurate documentation via electronic database and file system ensuring all confidentiality was maintained.\nCommand Post Controller\n \n10/2001\n \nto \n10/2005\n \nCompany Name\n \nCity\n \n, \nState\nProvided command, control, communications, and information support throughout operations during peacetime, emergency, and disaster\nsituations.\nReceived and relayed instructions and records, submitting manual and automated data products.\nDisseminated time-sensitive critical information to senior leaders and support agencies.\nEducation\nCertification, Windows 7, Microsoft, Fort Bragg, NC,\n \n2012\n*Certification, Security \n, Comptia, Yong San, Korea,\n \n2012\n*Distinguished Graduate Certificate, Information Technology (Network Communications) Course\n \n2009\n \nU.S. Army\n \nCity\n \n, \nState\nCertificate, IT Network and Cisco Routing, IT Field Services Branch\n \n2009\n \nCity\n \n, \nState\nAssociate of Science\n \n: \nRadiography\n \n2008\n \nNorthwest Florida State College\n \nCity\n \n, \nState\n \nRadiography\nCertificate\n \n2001\n \nIT Tech Prep, Trumbull Career and Technical Center\n \nState\nDiploma\n \n2001\n \nWarren G. Harding\n \nCity\n \n, \nState\nSkills\nArmy, Cisco, counseling, customer assistance, database, documentation, Information Technology, inventory, IP, LAN, Windows 7, Network,\npersonnel, policies, protocols, repairs, Routing, San, supervisor, test equipment, troubleshoot, WAN",
  "processed": {
    "clean_text": "information technology supervisor summary seeking a position as an information technology specialist. over 5 years of information technology experience in the u.s. army, including over 1 year of supervisory experience. trained personnel in the set-up of it equipment, ensuring all equipment is properly connected and functioning. regularly troubleshoot and install various it equipment and systems. accountable for the maintenance and inventory of over 1 million worth of it and other communications equipment with zero losses or damages. possess a security and microsoft certification and a secret security clearance. highlights excellent communication techniques manufacturing systems integration multidisciplinary exposure design instruction creation project management complex problem solver advanced critical thinking sharepoint microsoft excel, project and visio accomplishments army achievement medal for impacting the communications network and overall success of key resolve 13 in yong san, korea. air force achievement medal for supporting operation iraqi freedom and performing as an outstanding senior controller. certificate of achievement for outstanding support as a member of the tiger team during the windows 7 migration. good conduct medal for exemplary behavior, efficiency and fidelity in active federal military service. experience information technology supervisor 01/2011 to 05/2014 company name city , state supervise up to 10 personnel at one time, delegating tasks, conducting performance evaluations and providing corrective counseling as necessary. train personnel in the set-up and proper use of it related equipment while adhering to all policies and procedures. responsible for the inventory of over 1 million worth of network communications equipment. tasked by president of the united states to act as supervisor and maintain signal communications for fort bragg army base. information technology technician 01/2009 to 01/2011 company name city , state maintained communications equipment in order to effectively relay confidential and secret information. utilized electronic test equipment to troubleshoot malfunctioning communications equipment and complete repairs as necessary. regularly set up and added computer systems to a communication network, installing operation systems, accessing stored programs and utilizing ip addresses. received training in lan/wan protocols. radiology technologist 05/2008 to 09/2008 company name city , state routinely performed radiological examinations in a medical clinic. competent and experienced in the set-up and adjustment of medical devices or equipment. regularly provided customer assistance, ensuring all patients received timely and accurate care. accountable for the accurate documentation via electronic database and file system ensuring all confidentiality was maintained. command post controller 10/2001 to 10/2005 company name city , state provided command, control, communications, and information support throughout operations during peacetime, emergency, and disaster situations. received and relayed instructions and records, submitting manual and automated data products. disseminated time-sensitive critical information to senior leaders and support agencies. education certification, windows 7, microsoft, fort bragg, nc, 2012 certification, security , comptia, yong san, korea, 2012 distinguished graduate certificate, information technology (network communications) course 2009 u.s. army city , state certificate, it network and cisco routing, it field services branch 2009 city , state associate of science : radiography 2008 northwest florida state college city , state radiography certificate 2001 it tech prep, trumbull career and technical center state diploma 2001 warren g. harding city , state skills army, cisco, counseling, customer assistance, database, documentation, information technology, inventory, ip, lan, windows 7, network, personnel, policies, protocols, repairs, routing, san, supervisor, test equipment, troubleshoot, wan",
    "metadata": {
      "has_education": true
    },
    "sections": {},
    "keywords": [
      "equipment",
      "state",
      "information",
      "communication",
      "city",
      "technology",
      "network",
      "army",
      "system",
      "supervisor",
      "personnel",
      "certificate",
      "company",
      "name",
      "experience",
      "set-up",
      "ensuring",
      "regularly",
      "troubleshoot",
      "inventory",
      "security",
      "microsoft",
      "certification",
      "achievement",
      "medal",
      "san",
      "operation",
      "support",
      "window",
      "received"
    ]
  },
  "file_path": "/Users/proxim/Desktop/Automated-First-Screener-and-AI-Job-Matching-NLP-WebEngine/data/raw/resumes/r62405.pdf"
}