{
  "id": "r634b5",
  "filename": "25990239.pdf",
  "upload_time": "17:35:19",
  "document_type": "resume",
  "original_text": "INFORMATION TECHNOLOGY INSTRUCTOR\nSummary\nSeventeen years experience in the information technology field. Seven years experience in curriculum design and computer based training\ndevelopment. Group and project management experience for over twelve years. Advanced problem solving skills and expertise. Advanced\ncustomer service training and experience Curriculum \nData Analysis \nOther Â· Curriculum design \nÂ· Advanced Data Analysis \nÂ· Student counseling\nÂ· Learning analysis \nÂ· Market analysis \nÂ· Customer service training Â· Advanced planning \nÂ· Training success evaluation \nÂ· Team building Â·\nArticulation and development \nÂ· Quantitative project analysis \nÂ· Project management Â· implementation \nÂ· Qualitative project analysis \nÂ·\nAdvanced conflict resolution Â· Evaluation \nÂ· Advanced user experience \nÂ· Market driven planning expertise Â· Computer based training design\ndata analysis\nHighlights\nMedia Design \nProductivity \nOther Â· Photoshop \nÂ· Microsoft \nÂ· Network Management Â· Premier \nÂ· Word \nÂ· Novell Console 1 Â·\nIllustrator \nÂ· Excel \nÂ· Microsoft Networking Â· InDesign \nÂ· Powerpoint \nÂ· Cable Wiring Standards Â· Flash \nÂ· Project \nÂ· Machine\nHardware Â· Dreamweaver \nÂ· Outlook \nÂ· Windows OS installation & Â· Fireworks \nÂ· iLife \nRepair Â· Soundbooth \nÂ· Pages \nÂ· Mac OS\nInstallation & Repair Â· QuarkXpress \nÂ· Numbers \nÂ· Virtualization Â· Camtasia \nÂ· Keynote \nÂ· Parallells Â· HTML Coding \nÂ· iMovie \nÂ·\nVMware, Desktop & Fusion Â· PHP / Database connection \nÂ· iPhoto \nÂ· Course Management Software\nExperience\nInformation Technology Instructor ...................................................................................................................\n \nJan 2012\n \nto \nCurrent\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nManage student learning needs.\nCreate Curriculum for IT Program.\nManage two part time instructors.\nTeach three classes of twenty-two students each class per day.\nManage open entry/open exit curriculum for all training in the program.\nVerify training outcome reports to maintain COE standards.\nData metric analysis of student progress throughout the course.\nAnswer questions of potential students and parents.\nReview and update training standards as needed.\nNew curriculum development according to market requirements Customer service training tailored towards IT students Partner with fellow\ninstructors to provide cross training and student interaction Work with student services to assure student success Counsel students on\nlearning methods and methods for improvement.\nHelp Desk Manager Â​ Campus D .....................................................................................................................\n \nJan 2010\n \nto \nJan 2012\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nManage incoming troubleshooting calls from four state agencies.\nAssisted help desk staff members in resolving customer requests with first call resolution.\nCreate and specify computer standards for the Utah Dept.\nof Health.\nTrained fourteen help desk staff members on help desk phone client installation and usage.\nSoftware management for Dept.\nof Health.\nManage new user creation procedure for state departments of Health & Natural Resources.\nCreated new user training documentation for thirty help desk staff members in the State of Utah.\nProvide remote control support for customers throughout the state.\nCustomer friendliness reported on several occasions to management staff, commended for ability to teach customer how to utilize their\ntechnology more effectively.\nMedia Designer ..................................................................................................................................................\n \nJan 2009\n \nto \nJan 2010\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nPrepare training curriculum for preparedness trainings.\nDesigned eighteen computer based training courses for the department of Health's management staff training over one hundred managers\nproviding significant cost savings.\nCoordinated information technology needs for fifty preparedness staff members.\nDesigned cover art and the multimedia presentations to give trainees after sessions, prepared over one thousand take home packets for\nvarious trainings.\nServed as technical lead staff member for the Utah Department of Health's training and education center.\nTechnical Support Specialist ............................................................................................................................\n \nJan 2002\n \nto \nJan 2009\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nProvided advanced level technical support for department staff in computer repair and service.\nInventory control for department of health hardware.\nCreated Technology standards for division of Health systems improvement.\nServed on advisory committee for mobile device policy creation.\n\nUpdated department travel system from paper to online.\nEducation\nMasters of Education\n \n, \nLearning & Technology\n \n2012\n \nDoctorate of Education; Higher Education, Ed.d ...........................Concordia University\nM.Ed. ............................. Western Governor's University\n \nLearning & Technology\nBachelor of Science\n \n, \nInformation Technology Management\n \nInformation Technology Management\nB.S. .........\n \n2010\n \nWestern Governor's University\nAssociate of Applied Science\n \n, \nMultimedia Technologies\n \nMultimedia Technologies\nA.A.S .........................\n \n2003\n \nUtah Valley University\nSkills\nPhotoshop, Premier, art, Cable, Hardware, computer repair, curriculum development, client, Customer service training, Database, Department of\nHealth, documentation, Dreamweaver, Fireworks, Flash, help desk, HTML Coding, Illustrator, InDesign, information technology, Inventory\ncontrol, Mac OS, market, Excel, Microsoft Networking, Outlook, Powerpoint, Windows OS, Word, multimedia presentations, Natural, Network\nManagement, Novell, PHP, progress, QuarkXpress, staff training, technical support, user training, phone, troubleshooting, Wiring",
  "processed": {
    "clean_text": "information technology instructor summary seventeen years experience in the information technology field. seven years experience in curriculum design and computer based training development. group and project management experience for over twelve years. advanced problem solving skills and expertise. advanced customer service training and experience curriculum data analysis other â curriculum design â advanced data analysis â student counseling â learning analysis â market analysis â customer service training â advanced planning â training success evaluation â team building â articulation and development â quantitative project analysis â project management â implementation â qualitative project analysis â advanced conflict resolution â evaluation â advanced user experience â market driven planning expertise â computer based training design data analysis highlights media design productivity other â photoshop â microsoft â network management â premier â word â novell console 1 â illustrator â excel â microsoft networking â indesign â powerpoint â cable wiring standards â flash â project â machine hardware â dreamweaver â outlook â windows os installation  â fireworks â ilife repair â soundbooth â pages â mac os installation  repair â quarkxpress â numbers â virtualization â camtasia â keynote â parallells â html coding â imovie â vmware, desktop  fusion â php / database connection â iphoto â course management software experience information technology instructor ................................................................................................................... jan 2012 to current company name ï¼ city , state manage student learning needs. create curriculum for it program. manage two part time instructors. teach three classes of twenty-two students each class per day. manage open entry/open exit curriculum for all training in the program. verify training outcome reports to maintain coe standards. data metric analysis of student progress throughout the course. answer questions of potential students and parents. review and update training standards as needed. new curriculum development according to market requirements customer service training tailored towards it students partner with fellow instructors to provide cross training and student interaction work with student services to assure student success counsel students on learning methods and methods for improvement. help desk manager â campus d ..................................................................................................................... jan 2010 to jan 2012 company name ï¼ city , state manage incoming troubleshooting calls from four state agencies. assisted help desk staff members in resolving customer requests with first call resolution. create and specify computer standards for the utah dept. of health. trained fourteen help desk staff members on help desk phone client installation and usage. software management for dept. of health. manage new user creation procedure for state departments of health  natural resources. created new user training documentation for thirty help desk staff members in the state of utah. provide remote control support for customers throughout the state. customer friendliness reported on several occasions to management staff, commended for ability to teach customer how to utilize their technology more effectively. media designer .................................................................................................................................................. jan 2009 to jan 2010 company name ï¼ city , state prepare training curriculum for preparedness trainings. designed eighteen computer based training courses for the department of healths management staff training over one hundred managers providing significant cost savings. coordinated information technology needs for fifty preparedness staff members. designed cover art and the multimedia presentations to give trainees after sessions, prepared over one thousand take home packets for various trainings. served as technical lead staff member for the utah department of healths training and education center. technical support specialist ............................................................................................................................ jan 2002 to jan 2009 company name ï¼ city , state provided advanced level technical support for department staff in computer repair and service. inventory control for department of health hardware. created technology standards for division of health systems improvement. served on advisory committee for mobile device policy creation. updated department travel system from paper to online. education masters of education , learning  technology 2012 doctorate of education; higher education, ed.d ...........................concordia university m.ed. ............................. western governors university learning  technology bachelor of science , information technology management information technology management b.s. ......... 2010 western governors university associate of applied science , multimedia technologies multimedia technologies a.a.s ......................... 2003 utah valley university skills photoshop, premier, art, cable, hardware, computer repair, curriculum development, client, customer service training, database, department of health, documentation, dreamweaver, fireworks, flash, help desk, html coding, illustrator, indesign, information technology, inventory control, mac os, market, excel, microsoft networking, outlook, powerpoint, windows os, word, multimedia presentations, natural, network management, novell, php, progress, quarkxpress, staff training, technical support, user training, phone, troubleshooting, wiring",
    "metadata": {
      "has_education": true
    },
    "sections": {},
    "keywords": [
      "training",
      "technology",
      "management",
      "student",
      "staff",
      "curriculum",
      "customer",
      "analysis",
      "state",
      "health",
      "information",
      "advanced",
      "jan",
      "department",
      "experience",
      "computer",
      "service",
      "help",
      "desk",
      "project",
      "learning",
      "standard",
      "manage",
      "member",
      "education",
      "instructor",
      "design",
      "development",
      "data",
      "market"
    ]
  },
  "file_path": "/Users/proxim/Desktop/Automated-First-Screener-and-AI-Job-Matching-NLP-WebEngine/data/raw/resumes/r634b5.pdf"
}