{
  "id": "r653f4",
  "filename": "10641230.pdf",
  "upload_time": "17:35:29",
  "document_type": "resume",
  "original_text": "IT MANAGEMENT\nCareer Overview\nDetail-oriented professional with extensive Information Technology experience in hardware and software troubleshooting/management. With\nadditional experience in networking, task automation, server technologies, digital graphic design, client + server side programming technologies and\npopular industry software packages including Microsoft Office and Adobe Creative Suite.\nQualifications\nEducation and certificates \nTroubleshooting q \nCompTIA A+ certified (2012) \nq \nAdvanced troubleshooting q \nCompTIA Net+ certification class \nq\nVirus and spyware removal q \nMCSA certification class \nq \nComputer diagnostics and repair q \nWeb Development I + II class \nq \nGaming console\nrepair and q \nDigital media manipulation class \nmodification q \nJava programming class \nq \nMobile device repair q \nHardware support and\nProgramming and Web \ntroubleshooting q \nHTML - HTML5 \nq \nOptimizing and performance tuning q \nXML \nq \nAudio and video technologies q\nCSS - CSS3 \nq \nMedical technology installation and q \nJavaScript \ntroubleshooting q \nCommand Line q \nJava \nManagement q \nActionScript \nq\nHardware and software upgrade q \nPHP \nplanning q \nDatabase servers \nq \nDocumentation q \nAndroid mobile application \nq \nOrganization\ndevelopment \nq \nMulti-project priority management q \nContent Management Systems (CMS) \nOperating Systems q \nWebsite enhancement \nq\nWindows 95 - 8 q \nStoryboarding \nq \nWindows Server 2003 - 8 q \nSearch Engine Optimization (SEO) \nq \nWindows Phone 7.0 - 8.0 q \nSocial\nMedia and marketing \nq \nMultiple Linux Distributions q \nUbuntu 10.04 LTS - 12.10 Networking \nq \nAndroid 1.0 - 4.0.4 q \nCloud computing \nq \nMac\nOS X v10.0 - v10.8 q \nServer management \nq \nIOS 1.0 - 6.1 q \nActive directory q \nRemote connection technologies \nPrograms q \nProficiency in\nnumerous protocols \nq \nMicrosoft Office 2010 including TCP/IP \nq \nSmall business management q \nInformation security \nsoftware (client and server)\nq \nWireless technologies \nq \nAdobe Creative Suite 5 q \nTelephony technologies q \nWiring and Network engineering \nGraphics and Media q \nPhoto\nenhancing Electronics \nq \nBrochure and newsletter formatting q \nElectronic circuits and components \nq \nAudio and video editing q \nCircuit diagrams\nand Prototyping \nq \nLogo and business card q \nLogic, electronic and computational algorithms q \nElectromagnetisms and waves q \nQuantum particle\nmechanics \nq \nAs well as many miscellaneous IT q \nEnergy and electrical alternatives \nskills. (Solar)\nAccomplishments\nRebuilt a client's website from the ground up and increased monthly hits from 3422 to 40884 in a matter of a few months.\nDesigned, priced, built, and installed a complete information system upgrade for a client; including networking devices, wiring, client\ncomputers, server and software.\nDiagrammed, prototyped, and assembled a portable USB phone charger outputting optimal voltage and amperage, with circuits and\ncomponents small enough to all fit in an Altoids tin.\nIt allows next to unlimited portable phone charging due to the device itself being recharged by a small solar panel on the top.\nAutomated and streamlined daily office tasks for client using Batch Scripting.\nTroubleshot medical technology including X-ray machines and medical industry client and server software (Eaglesoft).\nInformation Technology project management experience.\nProgrammed a cloud storage website allowing a client access to a shared home network drive from any browser, anywhere.\nIt includes security login, uploading and downloading.\nWork Experience\nIT management\n \nMarch 2012\n \nto \nNovember 2012\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nIn charge of planning, budgeting, and executing all IT projects.In addition to office troubleshooting, building/managing the company website\nand designing/updating the business's electronic newsletter.\nInformation Technology Consultant\n \nJuly 2011\n \nto \nFebruary 2012\n \nCompany Name\n \nï¼​ \nState\nContracted IT consulting work from client computer repair to network expansion.\nMay 2011\n \nto \nJuly 2011\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nIn charge of company website management, social media administration, as well as assisting in administrative tasks.\nEducation and Training\nAssociate of Science\n \n: \nInformation Technology\n \n, \n2014\n \nLyons Township\n \nï¼​ \nCity\n \n, \nState\n \n, \nUnited States\n \nInformation Technology\nHigh School Diploma\n \nGeneral Education\nCoursework in computer science all 4 years\n \nGPA: \nDiamond Achievement Academic award * Honor Roll\n \nDiamond Achievement Academic\naward * Honor Roll\nSkills\nA+ certified, ActionScript, Active directory, administrative, Adobe Creative Suite 5, Photo, Audio, Brochure, budgeting, business management,\nclient and server, CMS, Hardware, computer repair, consulting, Content Management, CSS, CSS3, client, Database, designing, Documentation,\nElectronics, XML, Graphics, Hardware support, HTML, HTML5, PHP, Information security, Java, Java programming, JavaScript, Linux, Logic,\nLogo, Mac OS, managing, marketing, Medical technology, Microsoft Office, office, Windows, Windows 95, Network engineering, network,\nNetworking, newsletter, Operating Systems, Organization development, Programming, protocols, Prototyping, Search Engine Optimization,\nservers, Storyboarding, TCP/IP, Telephony, Phone 7.0, Troubleshooting, upgrade, video, video editing, Web Development I, Website, website\nmanagement, Windows Server, Wiring",
  "processed": {
    "clean_text": "it management career overview detail-oriented professional with extensive information technology experience in hardware and software troubleshooting/management. with additional experience in networking, task automation, server technologies, digital graphic design, client  server side programming technologies and popular industry software packages including microsoft office and adobe creative suite. qualifications education and certificates troubleshooting q comptia a certified (2012) q advanced troubleshooting q comptia net certification class q virus and spyware removal q mcsa certification class q computer diagnostics and repair q web development i  ii class q gaming console repair and q digital media manipulation class modification q java programming class q mobile device repair q hardware support and programming and web troubleshooting q html - html5 q optimizing and performance tuning q xml q audio and video technologies q css - css3 q medical technology installation and q javascript troubleshooting q command line q java management q actionscript q hardware and software upgrade q php planning q database servers q documentation q android mobile application q organization development q multi-project priority management q content management systems (cms) operating systems q website enhancement q windows 95 - 8 q storyboarding q windows server 2003 - 8 q search engine optimization (seo) q windows phone 7.0 - 8.0 q social media and marketing q multiple linux distributions q ubuntu 10.04 lts - 12.10 networking q android 1.0 - 4.0.4 q cloud computing q mac os x v10.0 - v10.8 q server management q ios 1.0 - 6.1 q active directory q remote connection technologies programs q proficiency in numerous protocols q microsoft office 2010 including tcp/ip q small business management q information security software (client and server) q wireless technologies q adobe creative suite 5 q telephony technologies q wiring and network engineering graphics and media q photo enhancing electronics q brochure and newsletter formatting q electronic circuits and components q audio and video editing q circuit diagrams and prototyping q logo and business card q logic, electronic and computational algorithms q electromagnetisms and waves q quantum particle mechanics q as well as many miscellaneous it q energy and electrical alternatives skills. (solar) accomplishments rebuilt a clients website from the ground up and increased monthly hits from 3422 to 40884 in a matter of a few months. designed, priced, built, and installed a complete information system upgrade for a client; including networking devices, wiring, client computers, server and software. diagrammed, prototyped, and assembled a portable usb phone charger outputting optimal voltage and amperage, with circuits and components small enough to all fit in an altoids tin. it allows next to unlimited portable phone charging due to the device itself being recharged by a small solar panel on the top. automated and streamlined daily office tasks for client using batch scripting. troubleshot medical technology including x-ray machines and medical industry client and server software (eaglesoft). information technology project management experience. programmed a cloud storage website allowing a client access to a shared home network drive from any browser, anywhere. it includes security login, uploading and downloading. work experience it management march 2012 to november 2012 company name ï¼ city , state in charge of planning, budgeting, and executing all it projects.in addition to office troubleshooting, building/managing the company website and designing/updating the businesss electronic newsletter. information technology consultant july 2011 to february 2012 company name ï¼ state contracted it consulting work from client computer repair to network expansion. may 2011 to july 2011 company name ï¼ city , state in charge of company website management, social media administration, as well as assisting in administrative tasks. education and training associate of science : information technology , 2014 lyons township ï¼ city , state , united states information technology high school diploma general education coursework in computer science all 4 years gpa: diamond achievement academic award  honor roll diamond achievement academic award  honor roll skills a certified, actionscript, active directory, administrative, adobe creative suite 5, photo, audio, brochure, budgeting, business management, client and server, cms, hardware, computer repair, consulting, content management, css, css3, client, database, designing, documentation, electronics, xml, graphics, hardware support, html, html5, php, information security, java, java programming, javascript, linux, logic, logo, mac os, managing, marketing, medical technology, microsoft office, office, windows, windows 95, network engineering, network, networking, newsletter, operating systems, organization development, programming, protocols, prototyping, search engine optimization, servers, storyboarding, tcp/ip, telephony, phone 7.0, troubleshooting, upgrade, video, video editing, web development i, website, website management, windows server, wiring",
    "metadata": {
      "has_education": true
    },
    "sections": {},
    "keywords": [
      "technology",
      "management",
      "server",
      "client",
      "information",
      "website",
      "software",
      "office",
      "troubleshooting",
      "window",
      "hardware",
      "programming",
      "class",
      "computer",
      "repair",
      "network",
      "company",
      "state",
      "experience",
      "networking",
      "including",
      "2012",
      "development",
      "medium",
      "java",
      "video",
      "medical",
      "system",
      "phone",
      "business"
    ]
  },
  "file_path": "/Users/proxim/Desktop/Automated-First-Screener-and-AI-Job-Matching-NLP-WebEngine/data/raw/resumes/r653f4.pdf"
}