{
  "id": "r6ec2a",
  "filename": "12045067.pdf",
  "upload_time": "17:35:28",
  "document_type": "resume",
  "original_text": "INFORMATION TECHNOLOGY (IT) SPECIALIST\nExperience\nInformation Technology (IT) Specialist\n \nJanuary 2012\n \nCompany Name\nIT Specialist Project Engineer\n \nDecember 2009\n \nto \nCurrent\n \nCity\n \n, \nState\nU.S.\nArmy Information Systems Engineering Command (USAISEC) on projects involving large and complex data networks and\ntelecommunications systems while assigned to the Fort Huachuca Engineering Directorate of USAISEC.\nI develop, manage and coordinate the implementation of network communications, local area networks (LANs), visual information systems\n(VIS), and information technology (IT) infrastructure \nprojects.\nAs the Project Manager and Lead Engineer, I directed and managed the efforts of a five person Integrated Product Team (IPT) \nto\nimplement the $25 million IT infrastructure for the the new Command, Control, Communications and Computers (C4) facility for the Joint\nSpecial Operations Command (JSOC) at Ft Bragg, NC.\nProvided daily project coordination and oversaw the development of the IT technical requirements, system design plan and associated\ncontract documents and design drawings \nfor the 35,000 sf building.\nReviewed building construction design drawings, consolidated design change input requests from the customer and team members, and\nprovided justification for the proposed design changes and building modifications to ensure that the IT infrastructure was installed according\nto technical specifications, applicable security standards, \nand customer requirements.\nrequests for building design changes to the US Army Corps of Engineers (USACE).\nand provided technical oversight of the project.\nRepresented JSOC and ISEC in project meetings with the USACE and other project stakeholders for technical requirements, project\nscheduling updates, and to resolve controversial project issues.\nCreated the project integrated master schedule (IMS) to identify and manage resources so that all project documentation and deliverables\nwere developed accurately, and to ensure system reliability, operability, and maintainability.\nIn support of the Army Base Realignment and Closure (BRAC) process, performed duties as the project coordinator for the $19 million\nBRAC mandated Army Central Command (ARCENT) Headquarters relocation.\nAs the ARCENT relocation project leader, identified and analyzed requirements, assigned and reviewed work and exercised full control\nover the planning, development, and implementation of all assigned tasks for the Integrated Product Team (IPT).\nObtained contract engineering services by developing the Acquisition Requirements Package (ARP), and participated in Source Selection\nEvaluation Board (SSEB) activities.\nPrepared statements of work (SOWs), procurement data packages, and evaluated contractor work performance and provided the monthly\nperformance report to the contracting office and weekly project status updates to ISEC management.\nProvided financial and resource planning, execution, and tracking; to include manpower, temporary duty (TDY), and other acquisition\nresource requirements.\nJudiciously expended project resources, determined priorities and worked within resource allocation limits, fiscal law and existing policy.\nCompleted all required contract modifications, List of Materials (LOMs) and Major Item List of Materials (MILOMs), as well as\nindependent government cost estimates (IGCEs) as required.\nIntegrated various IT sub-systems based on system dependencies, technical adequacies, and customers' need.\nConducted technical reviews of proposed test plans and monitored the System Acceptance Testing (SAT) of all IT and VIS systems and\nproposed solutions to faults identified in the SAT to ensure continuity of new and existing systems and compliance with user requirements.\nSystems Integration Analyst\n \nJuly 2009\n \nto \nDecember 2009\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nSupervisor: \nRandy Devine - (520) 459-3174.\nSystems Integration Analyst responsible for contract Information Technology (IT) engineering services in support of the US Army\nInformation Systems Engineering Command (USAISEC).\nDeveloped the Facility Design Criteria (FDC), System Design Plans (SDPs), Engineering Installation Packages (EIPs), List of Materials\n(LOMs) and other acquisition documentation for complex IT projects according to user requirements.\nWorked with Government and sub-contractor personnel and provided guidance and oversight on project document development and\nvalidation for the U.S.\nArmy Forces Command (FORSCOM) and U.S.\nArmy Reserve Command (USARC) BRAC relocation.\nProvided engineering, procurement, installation, cutover and testing requirements for the High Frequency (HF) and Ultra High Frequency\n(UHF) Radio Systems and antennas in support of a Command, Control, Communications, Computers and Intelligence / Information\nTechnology (C4I/IT) systems project.\nReviewed project documentation and ensured contract deliverables were complete and delivered accurately and on time as specified in the\nAcquisition Requirements Package (ARP).\nApril 2001\n \nto \nSeptember 2009\n \nCompany Name\nFunctional Area Expert (Command and Control)Sierra Vista, Arizona Supervisor: Robert Kessler - (520) 417-0959.\nCommunications Engineer supporting the U.S.\nArmy Information Systems Engineering Command (USAISEC) by providing IT engineering services in the form of quick reaction\n\nengineering to Engineer, Furnish, Install, and Test (EFIT) total communications functionality at multiple Command and Control (C2)\nfacilities.\nProvided QA / QC checks and Acceptance Testing on various projects involving C2 facility upgrades as well as Command Headquarters\nrelocations.\nProvided IT engineering support for the US Southern Command (SOUTHCOM) headquarters relocation project, to include developing the\nFDC as part of the design-build contracting process for the USACE.\nDeveloped the SDP, LOM, cost estimates and test plans for the radio and satellite systems, copper and fiber cable plant, lightning\nprotection systems, grounding, bonding and shielding systems and related infrastructure for the Defense Threat Reduction Agency (DTRA)\nrelocation project.\nProvided on-site engineering support for the voice, data, and visual information systems being installed for the United States Army South\n(USARSO) Headquarters and the Installation Management Agency (IMA) at Fort Sam Houston, Texas.\nProvided detailed engineering for the design and installation of Briefing and Display Facilities (BDF), Conference Rooms, Command Center\nAreas, Telecommunications Rooms (TRs), and Open Office Areas.\nConducted QA / QC checks and testing for a Defense Red Switch Network (DRSN), Global Command and Control System (GCCS),\nUnclassified Local Area Network (NIPRNET), Secret Local Area Network (SIPRNET), Sensitive Compartmented Local Area Network\n(SCI LAN), Administrative Telephone System, and Visual Information Systems.\nAssisted USAISEC Force Projection Engineering Directorate, and 1st Signal Brigade personnel in the design and installation of a C2 facility\nupgrade at the 19th Theatre Support Command in South Korea.\nPerformed site surveys, gathered user requirements from several staff directorates and operational elements within the command and\ndeveloped an SDP, EIP and LOMs to upgrade the Global Command and Control System (GCCS) communications systems as well as the\nadministrative and tactical voice systems.\nProvided engineering support for the development of the C2 facility for the U.S.\nArmy Central Command (USCENTCOM) Headquarters and foreign coalition forces in Doha, Qatar in support of Operation Iraqi\nFreedom.\nThese efforts included various secure voice, data, and visual information systems critical to the Command Center operations.\nSupervised and assisted with the routing, termination and acceptance testing of all fiber optic and Cat5 cabling, voice and data systems and\nrelated telecommunications equipment and infrastructure.\nEducation\nBachelor of Science (BS)\n \n: \nInformation Technology\n \n, \n2005\n \nUniversity of \nPhoenix\n \nGPA: \nGPA: 3.67\n \nInformation Technology GPA: 3.67\nAssociates of Applied Science (AAS)\n \n: \nElectronic Technology\n \n, \n2003\n \nCochise \nCollege\n \nGPA: \nGPA: 4.0 Phi Theta Kappa\n \nElectronic Technology\nGPA: 4.0 Phi Theta Kappa\nAssociate\n \n: \nGeneral Studies\n \n, \n2001\n \nAGS Cochise College\n \nGPA: \nGPA: 4.0 Phi Theta Kappa\n \nGeneral Studies GPA: 4.0 Phi Theta Kappa\nSkills\nAdministrative, Analyst, Army, Agency, cable, cabling, Cat5, documentation, Engineer, engineering support, financial, Functional, Government,\nIMS, Information Systems, Information Technology, local area networks, Local Area Network, LANs, LAN, law, Materials, meetings, Office,\nNetwork, networks, personnel, procurement, project leader, project coordination, QA, quick, Radio, routing, SAT, scheduling, Supervisor,\nsurveys, Switch, System Design, Systems Integration, telecommunications, Telephone, Theatre, UHF, Ultra High Frequency, upgrades, upgrade,\nvalidation, Vista, voice and data",
  "processed": {
    "clean_text": "information technology (it) specialist experience information technology (it) specialist january 2012 company name it specialist project engineer december 2009 to current city , state u.s. army information systems engineering command (usaisec) on projects involving large and complex data networks and telecommunications systems while assigned to the fort huachuca engineering directorate of usaisec. i develop, manage and coordinate the implementation of network communications, local area networks (lans), visual information systems (vis), and information technology (it) infrastructure projects. as the project manager and lead engineer, i directed and managed the efforts of a five person integrated product team (ipt) to implement the 25 million it infrastructure for the the new command, control, communications and computers (c4) facility for the joint special operations command (jsoc) at ft bragg, nc. provided daily project coordination and oversaw the development of the it technical requirements, system design plan and associated contract documents and design drawings for the 35,000 sf building. reviewed building construction design drawings, consolidated design change input requests from the customer and team members, and provided justification for the proposed design changes and building modifications to ensure that the it infrastructure was installed according to technical specifications, applicable security standards, and customer requirements. requests for building design changes to the us army corps of engineers (usace). and provided technical oversight of the project. represented jsoc and isec in project meetings with the usace and other project stakeholders for technical requirements, project scheduling updates, and to resolve controversial project issues. created the project integrated master schedule (ims) to identify and manage resources so that all project documentation and deliverables were developed accurately, and to ensure system reliability, operability, and maintainability. in support of the army base realignment and closure (brac) process, performed duties as the project coordinator for the 19 million brac mandated army central command (arcent) headquarters relocation. as the arcent relocation project leader, identified and analyzed requirements, assigned and reviewed work and exercised full control over the planning, development, and implementation of all assigned tasks for the integrated product team (ipt). obtained contract engineering services by developing the acquisition requirements package (arp), and participated in source selection evaluation board (sseb) activities. prepared statements of work (sows), procurement data packages, and evaluated contractor work performance and provided the monthly performance report to the contracting office and weekly project status updates to isec management. provided financial and resource planning, execution, and tracking; to include manpower, temporary duty (tdy), and other acquisition resource requirements. judiciously expended project resources, determined priorities and worked within resource allocation limits, fiscal law and existing policy. completed all required contract modifications, list of materials (loms) and major item list of materials (miloms), as well as independent government cost estimates (igces) as required. integrated various it sub-systems based on system dependencies, technical adequacies, and customers need. conducted technical reviews of proposed test plans and monitored the system acceptance testing (sat) of all it and vis systems and proposed solutions to faults identified in the sat to ensure continuity of new and existing systems and compliance with user requirements. systems integration analyst july 2009 to december 2009 company name ï¼ city , state supervisor: randy devine - (520) 459-3174. systems integration analyst responsible for contract information technology (it) engineering services in support of the us army information systems engineering command (usaisec). developed the facility design criteria (fdc), system design plans (sdps), engineering installation packages (eips), list of materials (loms) and other acquisition documentation for complex it projects according to user requirements. worked with government and sub-contractor personnel and provided guidance and oversight on project document development and validation for the u.s. army forces command (forscom) and u.s. army reserve command (usarc) brac relocation. provided engineering, procurement, installation, cutover and testing requirements for the high frequency (hf) and ultra high frequency (uhf) radio systems and antennas in support of a command, control, communications, computers and intelligence / information technology (c4i/it) systems project. reviewed project documentation and ensured contract deliverables were complete and delivered accurately and on time as specified in the acquisition requirements package (arp). april 2001 to september 2009 company name functional area expert (command and control)sierra vista, arizona supervisor: robert kessler - (520) 417-0959. communications engineer supporting the u.s. army information systems engineering command (usaisec) by providing it engineering services in the form of quick reaction engineering to engineer, furnish, install, and test (efit) total communications functionality at multiple command and control (c2) facilities. provided qa / qc checks and acceptance testing on various projects involving c2 facility upgrades as well as command headquarters relocations. provided it engineering support for the us southern command (southcom) headquarters relocation project, to include developing the fdc as part of the design-build contracting process for the usace. developed the sdp, lom, cost estimates and test plans for the radio and satellite systems, copper and fiber cable plant, lightning protection systems, grounding, bonding and shielding systems and related infrastructure for the defense threat reduction agency (dtra) relocation project. provided on-site engineering support for the voice, data, and visual information systems being installed for the united states army south (usarso) headquarters and the installation management agency (ima) at fort sam houston, texas. provided detailed engineering for the design and installation of briefing and display facilities (bdf), conference rooms, command center areas, telecommunications rooms (trs), and open office areas. conducted qa / qc checks and testing for a defense red switch network (drsn), global command and control system (gccs), unclassified local area network (niprnet), secret local area network (siprnet), sensitive compartmented local area network (sci lan), administrative telephone system, and visual information systems. assisted usaisec force projection engineering directorate, and 1st signal brigade personnel in the design and installation of a c2 facility upgrade at the 19th theatre support command in south korea. performed site surveys, gathered user requirements from several staff directorates and operational elements within the command and developed an sdp, eip and loms to upgrade the global command and control system (gccs) communications systems as well as the administrative and tactical voice systems. provided engineering support for the development of the c2 facility for the u.s. army central command (uscentcom) headquarters and foreign coalition forces in doha, qatar in support of operation iraqi freedom. these efforts included various secure voice, data, and visual information systems critical to the command center operations. supervised and assisted with the routing, termination and acceptance testing of all fiber optic and cat5 cabling, voice and data systems and related telecommunications equipment and infrastructure. education bachelor of science (bs) : information technology , 2005 university of phoenix gpa: gpa: 3.67 information technology gpa: 3.67 associates of applied science (aas) : electronic technology , 2003 cochise college gpa: gpa: 4.0 phi theta kappa electronic technology gpa: 4.0 phi theta kappa associate : general studies , 2001 ags cochise college gpa: gpa: 4.0 phi theta kappa general studies gpa: 4.0 phi theta kappa skills administrative, analyst, army, agency, cable, cabling, cat5, documentation, engineer, engineering support, financial, functional, government, ims, information systems, information technology, local area networks, local area network, lans, lan, law, materials, meetings, office, network, networks, personnel, procurement, project leader, project coordination, qa, quick, radio, routing, sat, scheduling, supervisor, surveys, switch, system design, systems integration, telecommunications, telephone, theatre, uhf, ultra high frequency, upgrades, upgrade, validation, vista, voice and data",
    "metadata": {
      "phones": [
        "520) 459-3174",
        "520) 417-0959"
      ],
      "has_education": true
    },
    "sections": {},
    "keywords": [
      "system",
      "project",
      "command",
      "information",
      "engineering",
      "provided",
      "army",
      "network",
      "requirement",
      "design",
      "technology",
      "area",
      "support",
      "gpa",
      "control",
      "facility",
      "engineer",
      "data",
      "communication",
      "local",
      "technical",
      "relocation",
      "u.s.",
      "usaisec",
      "infrastructure",
      "contract",
      "resource",
      "headquarters",
      "testing",
      "installation"
    ]
  },
  "file_path": "/Users/proxim/Desktop/Automated-First-Screener-and-AI-Job-Matching-NLP-WebEngine/data/raw/resumes/r6ec2a.pdf"
}