{
  "id": "r6f008",
  "filename": "15802627.pdf",
  "upload_time": "17:35:26",
  "document_type": "resume",
  "original_text": "SENIOR VICE-PRESIDENT AND CHIEF INFORMATION OFFICER\nCore Accomplishments\nStrategized with various areas of business to develop a proof of concept with an international financial company headed by a world-renowned\nNobel Peace Prize winner to establish the principle of micro-lending for low income, immigrant families\nProfessional Experience\nSenior Vice-President and Chief Information Officer\n \n, \n01/2009\n \nto \nCurrent\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nIndustry expert in a wide variety of technology systems, business applications and IT service management. Primary focus: Network Security\nand IT Operational Management using the fundamentals of scalar design/architecture and business process improvement. Create \"living\"\ntechnology that supports strategic vision and goals, as well as growing customer needs.\nInstituted a technology roadmap to guide the IT department with proper business alignment to create measurable, efficient and sustainable\ntechnology for Goodwill's various business verticals - Retail and eCommerce, Employment and Contracts, Mission Services.\nOutsourced selected portions of the IT process to facilitate the development of additional operational efficiencies to improve the technology\ninfrastructure.\nDesigned and collaborated with architects, engineers, and industry technology leaders in the build and operation of Second Generation Data\nCenters and collocated sites.\nDesigned a Business Continuity strategy that incorporates all critical aspects of the business to ensure the business remains solvent in the\nevent of service interruption or significant business disruption.\nImproved IT spend through proper fulfillment and procurement process provisioning - CapEx and OpEx improvements realized to ease the\nassociated costs of technology growth.\nProper sourcing of selected areas of the IT business process through staff augmentation, outsourcing, in-sourcing and near-shore\nopportunities to improve IT effectiveness and service delivery.\nProvided guidance and expertise on various panels, as well as interviewed by various media outlets and corporations for case-studies and\ndialogues around strategic IT - CIO magazine, Fierce CIO, CIO Zone, Enterprise Mobility, Enterprise CIO Forums, CIO Summit, CDW,\nCDM, Cisco, Splashtop, VEEAM, Airwatch, Quantum Technologies, ZDNet.\nVice-President, Information Technology\n \n, \n01/2005\n \nto \n01/2009\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nDesigned a system to overhaul the entire information gathering and distribution process through the use of portal technology. Streamlined\noperations and in doing so foster an atmosphere of empowerment and accountability using the principles of Enterprise Resource Planning.\nOutsourced selected portions of the IT process to facilitate the development of additional operational efficiencies to improve the technology\ninfrastructure, reduce costs, improve effectiveness and sharpen internal focus on development activities.\nDeveloped a Managed Print Service (MPS) program with a Multi-Function printer network to produce copy, print, email, e-file and scan at\nstations within key departments as part of a preliminary Document Management System. The MPS significantly reduced costs for\ndeveloping print materials over traditional copy machine equipment as the ROI was seen within months versus years.\nStrategized with various areas of business to develop a proof of concept with an international financial company headed by a world-\nrenowned Nobel Peace Prize winner to establish the principle of micro-lending for low income, immigrant families.\nAuthored a case study to review non-profit technologies. This study was based on a review of industry leading technologies in comparison\nto Goodwill's Retention Policy as it related to the Disaster Recovery Policy/Business Continuity Plan. Realized a 43% savings over the cost\nof the equipment.\nTechnology Visionary - Developed the ROI, gained approval and then guided the development and subsequent re-development of a\nhomegrown case management application to improve the future state of Mission Service and Employment business verticals. This\napplication has been a proven leader among competitors.\nTechnology Visionary - Engineered the platform to support Goodwill's first Blade Server and Data De-duplication technology, as well as\nserver virtualization, to increase performance and availability while reducing management overhead - the fore-runner to some of the\ntechnologies widely used by Fortune 100 companies from that time until now.\nManager/Senior Network Engineer, Information Technology\n \n, \n01/2001\n \nto \n01/2005\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nChallenged to secure and improve reliability of wide area network and all future business expansions sites.\nChief Architect - Designed and implemented corporate-wide, platform-independent, Personal Information Manager (PIM) with Microsoft\nExchange\\Outlook to replace Novell based Pegasus email system.\nStrategic Visionary - Chief Architect - Designed and Implemented the process of a tiered in-place migration from Novell NetWare to MS\nWindows: transitioned from Netware Directory Service to Microsoft Active Directory Service, migrated user and group accounts,\ntransitioned from Novell based WAN to an Active Directory Domain Forest, migrated file and print services, redesigned proprietary\ndatabases.\nResponsible for overall performance and availability of all aspects of the network.\nAnalyze network and design upgrades/changes as needed.\nAssess the company's current and future network needs using scalable systems.\nResponsible for all aspects of E-mail group.\nOversee the design, development, release, and maintenance of e-mail application systems.\nResponsible for all aspects (software and hardware) of organization's network systems.\nRecommend, implement, and maintain network architectures (LAN and WAN).\nAssist in the development and maintenance of network communications.\nUse knowledge of LAN/WAN systems to help plan and install internal and external networks.\nTest and evaluate network systems to eliminate problems and make improvements.\n\nNetwork Administrator\n \n, \n01/1997\n \nto \n01/2001\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nNetwork Administration\nInstall, configure and maintain organization's network.\nBuild networks and maintain external and internal web presence; administer the networks.\nPerform system backups on its internal and external web network servers.\nDesign and support server systems and supporting software.\nSupport, monitor, test and troubleshoot hardware and software problems pertaining to LAN.\nInstall, configure and repair workstations.\nProvide end users support for all LAN-based applications.\nEducation\nBachelor of Arts\n \n:\n \nGeography\n \nState University of New York at Stony Brook\n \nï¼​ \nCity\n \n, \nState\n \n, \nUS\n \n, CERTIFICATIONS & AFFILIATIONS\nBachelor of Arts - Sociology Bachelor of Science - Biochemistry Associates - Geography State University of New York at Stony Brook, Stony\nBrook, New York\nCertifications\nMicrosoft Certified Systems Engineer\nCertified Information Systems Security Professional\nCISSP\nCertified Ethical Hacker (CEH) v8\nInformation Technology Infrastructure Library Foundations\nGoodwill Industries International, Executive Development Program Graduate\nMobile Enterprise Executive Panelist\nGartner Summit Panelist\nEnterprise CIO Forum Contributor\nWall Street Journal CIO Contributor (Candidate)\nSkills\nBusiness Continuity, Technology Infrastructure, File, Lan, Architecture, Business Process Improvement, Cdm, Cisco, Contracts, Ecommerce,\nFulfillment, Network Security, Opex, Process Improvement, Procurement, Provisioning, Retail, Retail Marketing, Security, Case Management,\nCopy Machine, Disaster Recovery, Document Management, Enterprise Resource Planning, Increase, Lending, Operations, Roi, Server\nVirtualization, Virtualization, Active Directory, Databases, Directory Service, Engineer, Exchange, Lan/wan, Maintenance, Microsoft Exchange,\nNetware, Novell, Outlook, Backups, Its, Network Administration, Workstations, Certified Information Systems Security Professional, Cissp,\nInformation Technology Infrastructure Library, Itil, Journal, Systems Engineer, Systems Security, Biochemistry",
  "processed": {
    "clean_text": "senior vice-president and chief information officer core accomplishments strategized with various areas of business to develop a proof of concept with an international financial company headed by a world-renowned nobel peace prize winner to establish the principle of micro-lending for low income, immigrant families professional experience senior vice-president and chief information officer , 01/2009 to current company name ï¼ city , state industry expert in a wide variety of technology systems, business applications and it service management. primary focus: network security and it operational management using the fundamentals of scalar design/architecture and business process improvement. create living technology that supports strategic vision and goals, as well as growing customer needs. instituted a technology roadmap to guide the it department with proper business alignment to create measurable, efficient and sustainable technology for goodwills various business verticals - retail and ecommerce, employment and contracts, mission services. outsourced selected portions of the it process to facilitate the development of additional operational efficiencies to improve the technology infrastructure. designed and collaborated with architects, engineers, and industry technology leaders in the build and operation of second generation data centers and collocated sites. designed a business continuity strategy that incorporates all critical aspects of the business to ensure the business remains solvent in the event of service interruption or significant business disruption. improved it spend through proper fulfillment and procurement process provisioning - capex and opex improvements realized to ease the associated costs of technology growth. proper sourcing of selected areas of the it business process through staff augmentation, outsourcing, in-sourcing and near-shore opportunities to improve it effectiveness and service delivery. provided guidance and expertise on various panels, as well as interviewed by various media outlets and corporations for case-studies and dialogues around strategic it - cio magazine, fierce cio, cio zone, enterprise mobility, enterprise cio forums, cio summit, cdw, cdm, cisco, splashtop, veeam, airwatch, quantum technologies, zdnet. vice-president, information technology , 01/2005 to 01/2009 company name ï¼ city , state designed a system to overhaul the entire information gathering and distribution process through the use of portal technology. streamlined operations and in doing so foster an atmosphere of empowerment and accountability using the principles of enterprise resource planning. outsourced selected portions of the it process to facilitate the development of additional operational efficiencies to improve the technology infrastructure, reduce costs, improve effectiveness and sharpen internal focus on development activities. developed a managed print service (mps) program with a multi-function printer network to produce copy, print, email, e-file and scan at stations within key departments as part of a preliminary document management system. the mps significantly reduced costs for developing print materials over traditional copy machine equipment as the roi was seen within months versus years. strategized with various areas of business to develop a proof of concept with an international financial company headed by a world- renowned nobel peace prize winner to establish the principle of micro-lending for low income, immigrant families. authored a case study to review non-profit technologies. this study was based on a review of industry leading technologies in comparison to goodwills retention policy as it related to the disaster recovery policy/business continuity plan. realized a 43 savings over the cost of the equipment. technology visionary - developed the roi, gained approval and then guided the development and subsequent re-development of a homegrown case management application to improve the future state of mission service and employment business verticals. this application has been a proven leader among competitors. technology visionary - engineered the platform to support goodwills first blade server and data de-duplication technology, as well as server virtualization, to increase performance and availability while reducing management overhead - the fore-runner to some of the technologies widely used by fortune 100 companies from that time until now. manager/senior network engineer, information technology , 01/2001 to 01/2005 company name ï¼ city , state challenged to secure and improve reliability of wide area network and all future business expansions sites. chief architect - designed and implemented corporate-wide, platform-independent, personal information manager (pim) with microsoft exchangeoutlook to replace novell based pegasus email system. strategic visionary - chief architect - designed and implemented the process of a tiered in-place migration from novell netware to ms windows: transitioned from netware directory service to microsoft active directory service, migrated user and group accounts, transitioned from novell based wan to an active directory domain forest, migrated file and print services, redesigned proprietary databases. responsible for overall performance and availability of all aspects of the network. analyze network and design upgrades/changes as needed. assess the companys current and future network needs using scalable systems. responsible for all aspects of e-mail group. oversee the design, development, release, and maintenance of e-mail application systems. responsible for all aspects (software and hardware) of organizations network systems. recommend, implement, and maintain network architectures (lan and wan). assist in the development and maintenance of network communications. use knowledge of lan/wan systems to help plan and install internal and external networks. test and evaluate network systems to eliminate problems and make improvements. network administrator , 01/1997 to 01/2001 company name ï¼ city , state network administration install, configure and maintain organizations network. build networks and maintain external and internal web presence; administer the networks. perform system backups on its internal and external web network servers. design and support server systems and supporting software. support, monitor, test and troubleshoot hardware and software problems pertaining to lan. install, configure and repair workstations. provide end users support for all lan-based applications. education bachelor of arts : geography state university of new york at stony brook ï¼ city , state , us , certifications  affiliations bachelor of arts - sociology bachelor of science - biochemistry associates - geography state university of new york at stony brook, stony brook, new york certifications microsoft certified systems engineer certified information systems security professional cissp certified ethical hacker (ceh) v8 information technology infrastructure library foundations goodwill industries international, executive development program graduate mobile enterprise executive panelist gartner summit panelist enterprise cio forum contributor wall street journal cio contributor (candidate) skills business continuity, technology infrastructure, file, lan, architecture, business process improvement, cdm, cisco, contracts, ecommerce, fulfillment, network security, opex, process improvement, procurement, provisioning, retail, retail marketing, security, case management, copy machine, disaster recovery, document management, enterprise resource planning, increase, lending, operations, roi, server virtualization, virtualization, active directory, databases, directory service, engineer, exchange, lan/wan, maintenance, microsoft exchange, netware, novell, outlook, backups, its, network administration, workstations, certified information systems security professional, cissp, information technology infrastructure library, itil, journal, systems engineer, systems security, biochemistry",
    "metadata": {
      "has_education": true
    },
    "sections": {},
    "keywords": [
      "technology",
      "network",
      "system",
      "business",
      "information",
      "service",
      "process",
      "company",
      "state",
      "management",
      "development",
      "cio",
      "security",
      "improve",
      "enterprise",
      "various",
      "city",
      "application",
      "improvement",
      "support",
      "infrastructure",
      "designed",
      "engineer",
      "server",
      "directory",
      "chief",
      "area",
      "name",
      "industry",
      "goodwill"
    ]
  },
  "file_path": "/Users/proxim/Desktop/Automated-First-Screener-and-AI-Job-Matching-NLP-WebEngine/data/raw/resumes/r6f008.pdf"
}