{
  "id": "r71f69",
  "filename": "24083609.pdf",
  "upload_time": "17:35:20",
  "document_type": "resume",
  "original_text": "INFORMATION TECHNOLOGY SPECIALIST (INFOSEC)\nSummary\nRetired Information Assurance Systems Security Certification Specialist responsible for managing and monitoring information systems and network\nsecurity, and information systems security programs in support of the Information Security/Information Assurance mission for U.S. Army Medical\nCommand and Defense Health Agency. Also, served as a clerk typist and secretary.\nHighlights\nSelf-directed\nResults-oriented\nTime management\nStrong interpersonal skills\nDedicated team player\nLabor relations\nAccomplishments\nIncreased office organization by developing more efficient filing system and customer database protocols.\nExperience\nINFORMATION TECHNOLOGY SPECIALIST (INFOSEC)\n \n01/2012\n \nto \n11/2015\n \nCompany Name\n \nCity\n \n, \nState\nInterpreted scan results, implemented corrective action, and prepared reports of findings in support of the \nnetwork infrastructure.\nWorked in coordination with Army Cyber Command and Regional Computer Emergency Response (Army \nCyber and RCERT) to support\nComputer Networks Attacks (CNA) and Computer Network Defense (CND) \nefforts.\nChief Steward\n \n01/2000\n \nto \n01/2012\n \nCompany Name\n \nCity\n \n, \nState\nDefended the interest of the federal employees at Fort Sam Houston, TX.\nÂ Assigned cases to stewards based on their skill sets\nÂ Managed the receptionist area, including greeting visitors and Â responding to telephone and in-person requests for information.\nÂ Prepared employee's rebuttal to grievances.\nÂ Organized files, developed spreadsheets, faxed reports and scanned Â  Â documents.\nÂ Participated in arbitrations, mediations, and Alternate dispute resolutions.\nEducation\nAssociate of Science\n \n: \nBusiness Administration\n \n1980\n \nRichard Bland College\n \nCity\n \n, \nState\n \nBusiness Administration\nSkills\nExcellent attention to detail\nFast Learner\nAbility to work under pressure\nExcellent problem-solving abilities",
  "processed": {
    "clean_text": "information technology specialist (infosec) summary retired information assurance systems security certification specialist responsible for managing and monitoring information systems and network security, and information systems security programs in support of the information security/information assurance mission for u.s. army medical command and defense health agency. also, served as a clerk typist and secretary. highlights self-directed results-oriented time management strong interpersonal skills dedicated team player labor relations accomplishments increased office organization by developing more efficient filing system and customer database protocols. experience information technology specialist (infosec) 01/2012 to 11/2015 company name city , state interpreted scan results, implemented corrective action, and prepared reports of findings in support of the network infrastructure. worked in coordination with army cyber command and regional computer emergency response (army cyber and rcert) to support computer networks attacks (cna) and computer network defense (cnd) efforts. chief steward 01/2000 to 01/2012 company name city , state defended the interest of the federal employees at fort sam houston, tx. â assigned cases to stewards based on their skill sets â managed the receptionist area, including greeting visitors and â responding to telephone and in-person requests for information. â prepared employees rebuttal to grievances. â organized files, developed spreadsheets, faxed reports and scanned â â documents. â participated in arbitrations, mediations, and alternate dispute resolutions. education associate of science : business administration 1980 richard bland college city , state business administration skills excellent attention to detail fast learner ability to work under pressure excellent problem-solving abilities",
    "metadata": {
      "has_education": true
    },
    "sections": {},
    "keywords": [
      "information",
      "system",
      "network",
      "specialist",
      "security",
      "support",
      "army",
      "skill",
      "city",
      "state",
      "computer",
      "technology",
      "infosec",
      "assurance",
      "command",
      "defense",
      "01/2012",
      "company",
      "name",
      "prepared",
      "report",
      "cyber",
      "steward",
      "employee",
      "business",
      "administration",
      "excellent",
      "ability",
      "summary",
      "retired"
    ]
  },
  "file_path": "/Users/proxim/Desktop/Automated-First-Screener-and-AI-Job-Matching-NLP-WebEngine/data/raw/resumes/r71f69.pdf"
}