{
  "id": "r7d620",
  "filename": "23666211.pdf",
  "upload_time": "17:35:20",
  "document_type": "resume",
  "original_text": "TRAINING MANAGER\nExecutive Summary\nQualified Training Manager offering a record of successful job performance with proven problem solving ability and experience developing and\nimplementing innovative solutions. Experienced Leadership and Development Professional with over 10 years' experience in various Training\nenvironments. Intermediate/Expert level in all MS applications. Strong Training, Management, Learning/Development, Administrative and\nConsultative skills. Client, organizational and task oriented problem solver with the ability to rapidly adapt to new situations.\nCore Qualifications\nTraining and Development\nSupervision and training\nPolicy/program development\nCertified Train the Trainer (T3)\nManagement of remote employees\nCurriculum Development\nTalent development\nMilitary & Civilian Training\nMaster Black Belt Instructor\nOperations management\nCross-functional team management\nTraining manual contributor\nCall center management experience\nCustomer service management expertise\nProfessional Experience\nCompany Name\n \nCity\n \n, \nState\n \nTraining Manager\n \n08/2011\n \nto \n09/2015\nCreating and implementing training programs and overseeing the development of careers.\nSet performance metrics, evaluate productivity, and help workers create long-term career plans within an organization.\nDevelop, implement, and monitor training programs within an organization.\nSupervise technical training for staff.\nConduct orientation sessions.\nCreate training materials and develop multimedia visual aids and presentations.\nCreate testing and evaluation processes.\nEvaluate needs of company and plan training programs accordingly.\nConduct performance evaluations.\nProvide classroom training, demonstrations, on-the-job training, meetings, conferences, and workshops.\nManage staff of 70 classroom facilitators in multiple locations..\nConduct continuing education training.\nProvide leadership development education.\nProvide logistical support, course development, delivery, evaluation, process measurements, and cost management.\nPlan the implementation and facilitation of activities and events, budget spending, material production and distribution, and other resources to\nensure that operations are managed within authorized budgets.\nCompany Name\n \nCity\n \n, \nState\n \nOwner/Partner Defense Contractor\n \n10/2006\n \nto \n07/2011\nTop Secret Facility Clearance.\nSupervised, and trained employees for high level security Military Intelligence operations, recruited quality personnel for special assignments,\nconducted high level briefings and debriefing for various security level investigations at Federal locations to Military, civilian and\nCongressional personnel.\nDeveloped business plans, budgets, cost proposals, task schedules, cost analysis and projections; issued status/quality control plans and\nreports.\nDeveloped specific scenarios and created specific characters per U.S.Military specifications adhering to strict government guidelines.\nProvided experienced instructors/role players who educate and assist Military and civilian personnel prior to deployment.\nCreated comprehensive lesson plans to instruct Military and civilian personnel.\nDeveloped customized programs to support and enhance the security agencies of the United States government.\nCompany Name\n \nCity\n \n, \nState\n \nProgram Administrator II, Project Manager. Training Specialist II: US Army (CISAC)\n \n01/2004\n \nto \n09/2006\nConsultant and liaison to the Department of Interior (DOI) and Department of Defense (DOD) to effectively modernize inventory/\ncataloging processes for sensitive and classified files, material and property.\nSingle point of contact for project scheduling and changes.\nCapture Manager: Contract Acquisition: Procure, write and implement new and existing Request for Purchase/Quotes opportunities\nRFP/RFQ)\nProvided instruction to students enrolled in the CISAC 35L/97B course, using various methods, to include: formal platform instruction,\npractical exercises, demonstrations, automated presentations, test administration, test reviews.\nRetest-Retrain Team: Consultant to DA Branch Chief of 35L/97B Intelligence School.\nAssigned to retrain and coach Officers, Soldiers and Instructors who needed additional training to perform to their full potential as\nCounterintelligence Agents.\nRole Player.\n\nCompany Name\n \nCity\n \n, \nState\n \nRole Player\n \n01/2003\n \nto \n01/2004\nProvided services as a role player in support of CISAC for US Army Intelligence Center.\nResearch & Development: Created new scenarios for Field Training Exercises (FTX) Cadre and teams, used world events as guidelines.\nExecuted quality assurance programs.\nPrepared standard operating procedures.\nAnalyzed program data to assist in strategic decision-making.\nEducation\nBachelor of Arts (Equivalent)\n \n:\n \nTheology\n \n2007\n \nUniversity of the South \n, \nCity\n \n, \nState\n \n, \nUSA\nGraduated\nAssociates (Equivalent)\n \n:\n \nOffice Automation/Computer Specialist\n \n1989\n \nColeman University\n \n, \nCity\n \n, \nState\n \n, \nUSA\nValedictorian\nInterests\nSaint Stephen's Episcopal Church Vestry Member and Youth Minister, (Extensive information available upon request) Lay Eucharist Minister,\nCoaching and Playing softball, Umpire for Little League, Volunteer for Special Olympics, Arizona Business and Professional Women (past\nPresident), Stand for Children, Member GCKT, A humanitarian organization with Non-Governmental Organizational (NGO) status with the\nUnited Nations. Responsible for training members for International Response Team (IRT) preparedness techniques for natural disasters, Provide\nservices to Wounded Warrior (US) programs and Help for Heroes (UK). Promote Acts of Random Kindness (ARK) - inspiring others to be\nextraordinary.\nAffiliations\nLeadership Development Program, Tracy's Karate Studio Master Black Belt Association, American Kenpo Karate Association.\nSkills\nAdministrative, Consultant, Course Development, Client, DC, delivery, Instructor, \nleadership development, Leadership and Development,\nCurriculum Development, Trainer workshops (T3),",
  "processed": {
    "clean_text": "training manager executive summary qualified training manager offering a record of successful job performance with proven problem solving ability and experience developing and implementing innovative solutions. experienced leadership and development professional with over 10 years experience in various training environments. intermediate/expert level in all ms applications. strong training, management, learning/development, administrative and consultative skills. client, organizational and task oriented problem solver with the ability to rapidly adapt to new situations. core qualifications training and development supervision and training policy/program development certified train the trainer (t3) management of remote employees curriculum development talent development military  civilian training master black belt instructor operations management cross-functional team management training manual contributor call center management experience customer service management expertise professional experience company name city , state training manager 08/2011 to 09/2015 creating and implementing training programs and overseeing the development of careers. set performance metrics, evaluate productivity, and help workers create long-term career plans within an organization. develop, implement, and monitor training programs within an organization. supervise technical training for staff. conduct orientation sessions. create training materials and develop multimedia visual aids and presentations. create testing and evaluation processes. evaluate needs of company and plan training programs accordingly. conduct performance evaluations. provide classroom training, demonstrations, on-the-job training, meetings, conferences, and workshops. manage staff of 70 classroom facilitators in multiple locations.. conduct continuing education training. provide leadership development education. provide logistical support, course development, delivery, evaluation, process measurements, and cost management. plan the implementation and facilitation of activities and events, budget spending, material production and distribution, and other resources to ensure that operations are managed within authorized budgets. company name city , state owner/partner defense contractor 10/2006 to 07/2011 top secret facility clearance. supervised, and trained employees for high level security military intelligence operations, recruited quality personnel for special assignments, conducted high level briefings and debriefing for various security level investigations at federal locations to military, civilian and congressional personnel. developed business plans, budgets, cost proposals, task schedules, cost analysis and projections; issued status/quality control plans and reports. developed specific scenarios and created specific characters per u.s.military specifications adhering to strict government guidelines. provided experienced instructors/role players who educate and assist military and civilian personnel prior to deployment. created comprehensive lesson plans to instruct military and civilian personnel. developed customized programs to support and enhance the security agencies of the united states government. company name city , state program administrator ii, project manager. training specialist ii: us army (cisac) 01/2004 to 09/2006 consultant and liaison to the department of interior (doi) and department of defense (dod) to effectively modernize inventory/ cataloging processes for sensitive and classified files, material and property. single point of contact for project scheduling and changes. capture manager: contract acquisition: procure, write and implement new and existing request for purchase/quotes opportunities rfp/rfq) provided instruction to students enrolled in the cisac 35l/97b course, using various methods, to include: formal platform instruction, practical exercises, demonstrations, automated presentations, test administration, test reviews. retest-retrain team: consultant to da branch chief of 35l/97b intelligence school. assigned to retrain and coach officers, soldiers and instructors who needed additional training to perform to their full potential as counterintelligence agents. role player. company name city , state role player 01/2003 to 01/2004 provided services as a role player in support of cisac for us army intelligence center. research  development: created new scenarios for field training exercises (ftx) cadre and teams, used world events as guidelines. executed quality assurance programs. prepared standard operating procedures. analyzed program data to assist in strategic decision-making. education bachelor of arts (equivalent) : theology 2007 university of the south , city , state , usa graduated associates (equivalent) : office automation/computer specialist 1989 coleman university , city , state , usa valedictorian interests saint stephens episcopal church vestry member and youth minister, (extensive information available upon request) lay eucharist minister, coaching and playing softball, umpire for little league, volunteer for special olympics, arizona business and professional women (past president), stand for children, member gckt, a humanitarian organization with non-governmental organizational (ngo) status with the united nations. responsible for training members for international response team (irt) preparedness techniques for natural disasters, provide services to wounded warrior (us) programs and help for heroes (uk). promote acts of random kindness (ark) - inspiring others to be extraordinary. affiliations leadership development program, tracys karate studio master black belt association, american kenpo karate association. skills administrative, consultant, course development, client, dc, delivery, instructor, leadership development, leadership and development, curriculum development, trainer workshops (t3),",
    "metadata": {
      "has_education": true,
      "years_experience": 10
    },
    "sections": {},
    "keywords": [
      "training",
      "development",
      "program",
      "management",
      "state",
      "city",
      "plan",
      "manager",
      "leadership",
      "military",
      "company",
      "experience",
      "level",
      "civilian",
      "team",
      "name",
      "provide",
      "personnel",
      "player",
      "performance",
      "professional",
      "various",
      "new",
      "instructor",
      "operation",
      "service",
      "create",
      "within",
      "organization",
      "conduct"
    ]
  },
  "file_path": "/Users/proxim/Desktop/Automated-First-Screener-and-AI-Job-Matching-NLP-WebEngine/data/raw/resumes/r7d620.pdf"
}