{
  "id": "r899c9",
  "filename": "52618188.pdf",
  "upload_time": "17:35:11",
  "document_type": "resume",
  "original_text": "INFORMATION TECHNOLOGY HELP DESK SPECIALIST\nHighlights\nMicrosoft Windows Operating Systems 95, 98, 2000, ME, XP and Windows 7 along with expert knowledge in several\nother Applications such as Microsoft Active Directory, Microsoft Works, Microsoft Office, and Microsoft Outlook, SAP,\nCRM, ERP, Oracle, JD Edwards, Remedy, Great Plains, PeopleSoft, SharePoint, Avaya, Blue Pumpkin, Verint, Novell,\nVDI Platforms and Cognos.\nBusiness\nprocess\nimprovement\nCost-benefit\nanalysis\nForecasting\nand planning\nAdvanced\nExcel\nmodeling\nBusiness\nsystems\nanalysis\nSAP\nBusiness\nrequirements\nmatrixes\nProject\nmanagement\nSuperb\ncommunication\nskills\nAdvanced\nproblem\nsolving abilities\nCritical\nthinking\nDecisive\nExperience\nInformation Technology Help Desk Specialist\n \nAugust 2014\n \nto \nCurrent\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nDiagnose and resolve technical hardware and software issues for incoming phone calls and emails while ensuring detailed documentation on\nall activity and communication with customers regarding their issue Display the ability to understand and communicate complex and technical\ninformation clearly and concisely Demonstrate proficiency in product knowledge and call handling skills Maintain accurate customer records\n& process changes Display the ability to work in a fast paced environment, providing efficient productivity while simultaneously providing\nsuperior quality service Research questions using available information resources and advise user on appropriate action Log all help desk\ninteractions Identify and escalate situations requiring urgent attention Track and route problems and requests and document resolutions\nMaintain ticketing system and route all tickets to appropriate parties.\nQuality Assurance IT Analyst\n \nSeptember 2011\n \nto \nJanuary 2014\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nDisplay working ability to organize and follow complex and detailed technical procedures Responsible for establishing and implementing\nquality assurance and compliance processes for the IT organization by defining, documenting, measuring, analyzing, and improving\nprocesses Serve as process owner for document/record control, corrective/preventive action, internal auditing and KPI tracking Display\nconsistent project management and team leadership skills Display advanced Microsoft Excel utilization skills to create extensive graphs and\ncharts, pivot tables, v-look ups and extensive complex formula familiarity Train and mentor others in the use of quality tools and statistical\nmethods for problem solving and decision making Extract raw data from varied sources and transform into useful summary charts, graphs,\nand reports and use data to identify trends to improve performance and produce weekly Power Point presentation for upper management\nteam reflecting group productivity on a daily, weekly, monthly and quarterly breakdown Establishes metrics to measure deployment of new\nproject or process solutions Document measurement approaches and key findings and variability in results Work with production and\ndevelopment teams to implement new methodologies into reporting solutions Consults with Information Technology and business leaders on\nthe development and implementation of strategic business solutions through research, audit, and analysis of data and/or business process\nDisplay ability to successfully work and interact with all levels of management.\nBusiness Operations Analyst /Metrics Analyst /Department Administrative Support/ Supply Chain Assistant\n \nSeptember 2008\n \nto \nJanuary 2011\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nResponsible for providing accurate and detailed reporting to executive management daily monthly and quarterly metrics and reporting as\nwell as any other requests from the team or other organizations.\nImporting and exporting data from SAP and Sharepoint and manipulating and compiling data to create weekly Power Point presentation for\nexecutive management team.\n\nMeasurements include shipments, order cycle time, aged orders, inventory, forecasting, etc.\nDisplay advanced Microsoft Excel utilization skills to create extensive graphs and charts, pivot tables, v-look ups and extensive complex\nformula familiarity Implement changes and create effective metric management tools and maintain databases such as SAP and Share Point\nand provide training to team on utilization of new tools Support the department by providing standard daily, monthly and quarterly metrics\nand reporting as well as any other requests from the team or other organizations.\nWork with other business organizations and vendors to resolve any data or system issues.\nProvide visibility to department metrics by maintaining current information on HP's internal site.\nProduce weekly Power Point presentation for upper management team reflecting group productivity on a daily, weekly, monthly and\nquarterly breakdown Display the ability to understand and communicate complex and technical information clearly and concisely Assist\nBuyers in Procurement/Supply Chain duties Updating and ensuring all inventory accurately built, loaded, in stock and up to date in database\nas required for forecasting and projected orders Assist with creating, confirming and maintaining Purchase Orders and Invoices Responsible\nfor assisting to ensure all daily inventory efforts are met including adjustments, approvals, reservations, transportation and distribution\nMonitor and resolve any shipping and logistic issues in transporting inventory Act as administrative support to department manager\nEffectively organize and coordinate department meetings daily Maintain and order department supplies Calendar maintenance for\ndepartment management Preparing/editing presentations for management and/or compiling data for reports Making travel arrangements as\nneeded for management and prospective clients/vendors.\nCustomer Service Professional\n \nMarch 2007\n \nto \nAugust 2008\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nAnswers incoming customer telephone calls in a courteous and professional manner.\nResponds to and investigates customer inquiries, concerns, orders and issues received via phone, fax, email, Shell Source, and EDI in a\ntimely and courteous manner.\nResponsible for entering orders and resolving customer issues for many different products using the SAP/CRM and Remedy tool.\nResearches and resolves customer complaints and/or ordering issues and determines effective method of distribution to satisfy customer\nneeds.\nAssign, escalate, and notify appropriate agents/managers of customer issues to ensure fast and effective support delivery and resolutions\nusing Remedy Maintain relationship with sales team, customers and manufacturing and suppliers.\nEducation\nBBA\n \n: \nBusiness Administration\n \n, \n2015\n \nSam Houston State University \nï¼​ \nCity\n \n, \nState\n \n, \nUSA\nSkills\nActive Directory, administrative support, attention to detail, auditing, Avaya, business process, business solutions, charts, Cognos, hardware,\nCRM, clients, customer service, databases, database, decision making, delivery, documentation, editing, EDI, email, ERP, executive management,\nfast, fax, forecasting, graphs, Great Plains, help desk, HP, Information Technology, inventory, JD Edwards, team leadership, meetings, mentor,\nMicrosoft Excel, Microsoft Office, Microsoft Outlook, Power Point, Windows 7, Microsoft Windows, 2000, 98, Microsoft Works, Novell,\nOperating Systems, Oracle, PeopleSoft, presentations, problem solving, processes, Procurement, project management, quality, quality assurance,\nreporting, Research, sales, SAP, Shell, shipping, strategic, Supply Chain, tables, telephone, phone, transportation, travel arrangements",
  "processed": {
    "clean_text": "information technology help desk specialist highlights microsoft windows operating systems 95, 98, 2000, me, xp and windows 7 along with expert knowledge in several other applications such as microsoft active directory, microsoft works, microsoft office, and microsoft outlook, sap, crm, erp, oracle, jd edwards, remedy, great plains, peoplesoft, sharepoint, avaya, blue pumpkin, verint, novell, vdi platforms and cognos. business process improvement cost-benefit analysis forecasting and planning advanced excel modeling business systems analysis sap business requirements matrixes project management superb communication skills advanced problem solving abilities critical thinking decisive experience information technology help desk specialist august 2014 to current company name ï¼ city , state diagnose and resolve technical hardware and software issues for incoming phone calls and emails while ensuring detailed documentation on all activity and communication with customers regarding their issue display the ability to understand and communicate complex and technical information clearly and concisely demonstrate proficiency in product knowledge and call handling skills maintain accurate customer records  process changes display the ability to work in a fast paced environment, providing efficient productivity while simultaneously providing superior quality service research questions using available information resources and advise user on appropriate action log all help desk interactions identify and escalate situations requiring urgent attention track and route problems and requests and document resolutions maintain ticketing system and route all tickets to appropriate parties. quality assurance it analyst september 2011 to january 2014 company name ï¼ city , state display working ability to organize and follow complex and detailed technical procedures responsible for establishing and implementing quality assurance and compliance processes for the it organization by defining, documenting, measuring, analyzing, and improving processes serve as process owner for document/record control, corrective/preventive action, internal auditing and kpi tracking display consistent project management and team leadership skills display advanced microsoft excel utilization skills to create extensive graphs and charts, pivot tables, v-look ups and extensive complex formula familiarity train and mentor others in the use of quality tools and statistical methods for problem solving and decision making extract raw data from varied sources and transform into useful summary charts, graphs, and reports and use data to identify trends to improve performance and produce weekly power point presentation for upper management team reflecting group productivity on a daily, weekly, monthly and quarterly breakdown establishes metrics to measure deployment of new project or process solutions document measurement approaches and key findings and variability in results work with production and development teams to implement new methodologies into reporting solutions consults with information technology and business leaders on the development and implementation of strategic business solutions through research, audit, and analysis of data and/or business process display ability to successfully work and interact with all levels of management. business operations analyst /metrics analyst /department administrative support/ supply chain assistant september 2008 to january 2011 company name ï¼ city , state responsible for providing accurate and detailed reporting to executive management daily monthly and quarterly metrics and reporting as well as any other requests from the team or other organizations. importing and exporting data from sap and sharepoint and manipulating and compiling data to create weekly power point presentation for executive management team. measurements include shipments, order cycle time, aged orders, inventory, forecasting, etc. display advanced microsoft excel utilization skills to create extensive graphs and charts, pivot tables, v-look ups and extensive complex formula familiarity implement changes and create effective metric management tools and maintain databases such as sap and share point and provide training to team on utilization of new tools support the department by providing standard daily, monthly and quarterly metrics and reporting as well as any other requests from the team or other organizations. work with other business organizations and vendors to resolve any data or system issues. provide visibility to department metrics by maintaining current information on hps internal site. produce weekly power point presentation for upper management team reflecting group productivity on a daily, weekly, monthly and quarterly breakdown display the ability to understand and communicate complex and technical information clearly and concisely assist buyers in procurement/supply chain duties updating and ensuring all inventory accurately built, loaded, in stock and up to date in database as required for forecasting and projected orders assist with creating, confirming and maintaining purchase orders and invoices responsible for assisting to ensure all daily inventory efforts are met including adjustments, approvals, reservations, transportation and distribution monitor and resolve any shipping and logistic issues in transporting inventory act as administrative support to department manager effectively organize and coordinate department meetings daily maintain and order department supplies calendar maintenance for department management preparing/editing presentations for management and/or compiling data for reports making travel arrangements as needed for management and prospective clients/vendors. customer service professional march 2007 to august 2008 company name ï¼ city , state answers incoming customer telephone calls in a courteous and professional manner. responds to and investigates customer inquiries, concerns, orders and issues received via phone, fax, email, shell source, and edi in a timely and courteous manner. responsible for entering orders and resolving customer issues for many different products using the sap/crm and remedy tool. researches and resolves customer complaints and/or ordering issues and determines effective method of distribution to satisfy customer needs. assign, escalate, and notify appropriate agents/managers of customer issues to ensure fast and effective support delivery and resolutions using remedy maintain relationship with sales team, customers and manufacturing and suppliers. education bba : business administration , 2015 sam houston state university ï¼ city , state , usa skills active directory, administrative support, attention to detail, auditing, avaya, business process, business solutions, charts, cognos, hardware, crm, clients, customer service, databases, database, decision making, delivery, documentation, editing, edi, email, erp, executive management, fast, fax, forecasting, graphs, great plains, help desk, hp, information technology, inventory, jd edwards, team leadership, meetings, mentor, microsoft excel, microsoft office, microsoft outlook, power point, windows 7, microsoft windows, 2000, 98, microsoft works, novell, operating systems, oracle, peoplesoft, presentations, problem solving, processes, procurement, project management, quality, quality assurance, reporting, research, sales, sap, shell, shipping, strategic, supply chain, tables, telephone, phone, transportation, travel arrangements",
    "metadata": {
      "has_education": true
    },
    "sections": {},
    "keywords": [
      "management",
      "microsoft",
      "business",
      "customer",
      "team",
      "process",
      "information",
      "issue",
      "display",
      "data",
      "order",
      "work",
      "skill",
      "ability",
      "state",
      "quality",
      "daily",
      "department",
      "system",
      "sap",
      "city",
      "complex",
      "maintain",
      "weekly",
      "point",
      "presentation",
      "metric",
      "reporting",
      "inventory",
      "technology"
    ]
  },
  "file_path": "/Users/proxim/Desktop/Automated-First-Screener-and-AI-Job-Matching-NLP-WebEngine/data/raw/resumes/r899c9.pdf"
}