{
  "id": "r8bd5f",
  "filename": "24020470.pdf",
  "upload_time": "17:35:20",
  "document_type": "resume",
  "original_text": "INFORMATION TECHNOLOGY SPECIALIST\nSummary\nOver twelve years of experience providing high quality consulting and technical assistance to home and business end users. As a field service\ntechnician since late 2004, I am able to install, repair and maintain many types of Point of Sale register equipment as well as servers, networking\nand related peripherals.\nWith an ability to integrate computer skills, customer support experience and related education I thrive to exceed technical, business, and customer\nexpectations. A long time hobby of mine is demonstrating electronics in retail stores. I really enjoy in-store demonstrations, direct sales and training\nsessions with employees.\nContinuing to improve myself is very important to me. I feel being professionally certified by CompTIA, Lexmark, Hewlett Packard, Microsoft,\nFujitsu, ICÂ³, the ETA, FEMA and other bodies allows me to think outside the box and create a custom solution that best fits the client's needs.\nHighlights\nExceptional telephone etiquette\nVast technical knowledge\nTroubleshooting proficiency\nDHCP/DNS Ethernet and Firewall proficient\nCompTIA A+, Net+\nAccomplished with mobile devices\nTechnical help desk experience\nDatabase servers\nExcellent problem solving skills\nMicrosoft Office Specialist\nDrive duplication and imaging knowledge\nAdept at Troubleshooting\nAccomplishments\nMultiple technical awards for work performance.Consistently received a 100% rate of customer satisfaction.Oversaw a decrease in average daily\nHelp Desk tickets by almost 100%\nWork Experience\nInformation Technology Specialist\n \n02/2012\n \nto \nCurrent\n \nCompany Name\n \nCity\n \n, \nState\nService and maintain numerous makes, models and types of equipment, including client servers, workstations, laptops and peripherals.\nInstall and maintain CCTV-DVR Camera systems, Servers, network racks/patch panels, VoIP, BDR data recovery systems of which I am\nfamiliar with StorageCraft, Datto, VEEAM and Intronis, and business class cloud backup solutions.\nOffer business assessments ranging from DLP best practices to Wired / Wireless Network Infrastructure Audits to FINRA/HIPPA/PCI\nCompliance audit and testing.\nCurrently provide support for more than 480 Windows based devices and 44 Windows/VMware servers.\nIT Systems Administrator\n \n09/2008\n \nto \n05/2012\n \nCompany Name\n \nCity\n \n, \nState\nResponsible for all maintenance on 55 Windows variant based workstations, Dell Precision server, IBM xSeries Blade server, the\ntelephony/VOIP/POTS systems, T1/network troubleshooting in a multi-building environment as well as providing end user assistance and\ntraining to sales, service and management teams.\nManage Windows Server 2003 with Active Directory and policies.\nMaintain AutoBase CRM database and Reynolds & Reynolds Repair Order writing system.\nMaintained a WiFi network for the technicians to use Toyota Technical Services.\nPerformed all preventative maintenance on laser and dot matrix printers.\nResponsible to coordinate, purchase and install all new technology and assist outside vendors with technology related needs.\nI assisted the Used Car Manager with taking photographs and uploading to website & overlay of information on photos.\nField Service Technician II\n \n12/2009\n \nto \n10/2011\n \nCompany Name\n \nCity\n \n, \nState\nPerform field service work on IBM servers, IBM/Lenovo desktops and IBM Point-of-Sale POS) equipment as well as repair Lexmark\nmonochrome and color laser printers.\nResponsible for repairs and diagnosis on other brands such as Linksys, Symbol, Nortel, Baystack, Zebra, Datalogic, Kronos, HP, IVR\nSystems & Ateb Rx.\nResponsible to install and troubleshoot networking equipment ranging from wired switches to wireless access points,setup &\ntroubleshoot/repair IBM pSeries RS/6000 servers and peripherals.\nBreak/Fix technician, no escalation.\nResponsible for company vehicle, maintenance scheduling, RMA returns, numerous SLA contracts and full van inventory.\n24/7 On-call position with overnight priority calls.\nI was the territory Senior Technician and successfully trained a new employee.\nKodak Imaging Expert / Field Marketing Specialist\n \n03/2006\n \nto \n12/2009\n \nCompany Name\n \nCity\n \n, \nState\nI was responsible to engage and train sales associates and customers in large retail stores by organizing training events, presentations and\n\nI was responsible to engage and train sales associates and customers in large retail stores by organizing training events, presentations and\nrole playing demonstrations.\nTasked with increasing consumer brand awareness by selling and demonstrating Kodak products, merchandising and organizing Kodak\ncamera and peripheral displays, and assisting with fourth quarter \"Black Friday\" sales events.\nI was rewarded each year after the sales figures were totaled for surpassing my sales goals.\nI enjoyed demonstrating Kodak because everyone knows Kodak, and the products were simple to use, yet produced superior\nphotographs, prints and images.\nMerchandising / Marketing Specialist\n \n10/2005\n \nto \n12/2007\n \nCompany Name\n \nCity\n \n, \nState\nWorked for several divisions of ActionLink concurrently: Merchandising, Marketing and Training.\nIn-Store marketing, merchandising and sales of technical hardware and services, such as Dell, Sprint, Logitech and Garmin.\nSet up plan-o-grams (POG), live units and security for sensitive equipment.\nSelf-managed, drove own vehicle, recorded mileage.\nReceived shipments at home and position required extensive planning before set up could begin.\nDigital Imaging Specialist\n \n08/2005\n \nto \n03/2006\n \nCompany Name\n \nCity\n \n, \nState\nRetail sales of digital, 35mm, and DSLR cameras and accessories.\nHelped promote brand awareness for targeted brands, and new features of the cameras.\nTrained customers on digital camera features and specifications, provided hands-on demonstrations and short photo seminars for anyone\ninterested.\nI assisted in prepping store for \"Black Friday\" sale promotions, starting at 3:30am.\nI always completed the sale by walking customer to register, thanking them for the business and inviting them to come back with their\npurchase and show it off; many did! Seasonal position for Q4 and overstock through March.\nBusiness Machines Sales Associate\n \n09/2002\n \nto \n07/2005\n \nCompany Name\n \nCity\n \n, \nState\nRetail sales of computers, office supplies, electronics and related peripherals.\nAssisted.\ncustomers with printers, monitors, desktop & laptop computers, GPS and digital cameras.\nI was able to assist in in all departments of the store, ran the Copy Center when associates called out, made cardboard bales and used\npallet jacks.\nI was responsible for repairing customer computers in-store and worked as store computer technician before the Easy Tech program was\nrolled out.\nI was asked by management to assist in taking a proper inventory in a nearby store plagued with inventory discrepancies, and later was\ntasked by district management to assist in the final stages of building, \"plan-o-gramming\" and stocking the Monticello, NY Staples location.\nI received numerous \"S\" pins which signify outstanding customer service being reported to corporate.\nEducation\nGE - Residential Energy Auditor , Energy Management and Systems Technology/Technician\n \n: \nTechnology\n \n2014\n \nAshworth College\n \nCity\n \n, \nState\n \n,\nUSA\n \nGPA: \nDelta Epsilon Tau Honor Society, Alumni Society\nDelta Epsilon Tau Honor Society, Alumni Society\nUndergraduate Certificate in Computer Information Management , Computer Technology/Computer Systems Technology Online Courses\n \n:\nTechnology\n \n2010\n \nAshworth College\n \nCity\n \n, \nState\n \n, \nUSA\nAssociate of Arts and Sciences (A.A.S\n \n: \nBusiness Administration, Management and Operations Business Management Club\n \n2009\n \nSUNY Orange\nCity\n \n, \nState\n \n, \nUSA\nBusiness Administration, Management and Operations Business Management Club\nSkills\nSales Software: Salesforce.com, TapScan\nCMS: \nJoomla, WordPress\nDesktop Publishing Software: Photoshop, Illustrator\nPlethora of hardware repair and diagnostic skills\nExperienced Desktop Support and trainer",
  "processed": {
    "clean_text": "information technology specialist summary over twelve years of experience providing high quality consulting and technical assistance to home and business end users. as a field service technician since late 2004, i am able to install, repair and maintain many types of point of sale register equipment as well as servers, networking and related peripherals. with an ability to integrate computer skills, customer support experience and related education i thrive to exceed technical, business, and customer expectations. a long time hobby of mine is demonstrating electronics in retail stores. i really enjoy in-store demonstrations, direct sales and training sessions with employees. continuing to improve myself is very important to me. i feel being professionally certified by comptia, lexmark, hewlett packard, microsoft, fujitsu, icâ³, the eta, fema and other bodies allows me to think outside the box and create a custom solution that best fits the clients needs. highlights exceptional telephone etiquette vast technical knowledge troubleshooting proficiency dhcp/dns ethernet and firewall proficient comptia a, net accomplished with mobile devices technical help desk experience database servers excellent problem solving skills microsoft office specialist drive duplication and imaging knowledge adept at troubleshooting accomplishments multiple technical awards for work performance.consistently received a 100 rate of customer satisfaction.oversaw a decrease in average daily help desk tickets by almost 100 work experience information technology specialist 02/2012 to current company name city , state service and maintain numerous makes, models and types of equipment, including client servers, workstations, laptops and peripherals. install and maintain cctv-dvr camera systems, servers, network racks/patch panels, voip, bdr data recovery systems of which i am familiar with storagecraft, datto, veeam and intronis, and business class cloud backup solutions. offer business assessments ranging from dlp best practices to wired / wireless network infrastructure audits to finra/hippa/pci compliance audit and testing. currently provide support for more than 480 windows based devices and 44 windows/vmware servers. it systems administrator 09/2008 to 05/2012 company name city , state responsible for all maintenance on 55 windows variant based workstations, dell precision server, ibm xseries blade server, the telephony/voip/pots systems, t1/network troubleshooting in a multi-building environment as well as providing end user assistance and training to sales, service and management teams. manage windows server 2003 with active directory and policies. maintain autobase crm database and reynolds  reynolds repair order writing system. maintained a wifi network for the technicians to use toyota technical services. performed all preventative maintenance on laser and dot matrix printers. responsible to coordinate, purchase and install all new technology and assist outside vendors with technology related needs. i assisted the used car manager with taking photographs and uploading to website  overlay of information on photos. field service technician ii 12/2009 to 10/2011 company name city , state perform field service work on ibm servers, ibm/lenovo desktops and ibm point-of-sale pos) equipment as well as repair lexmark monochrome and color laser printers. responsible for repairs and diagnosis on other brands such as linksys, symbol, nortel, baystack, zebra, datalogic, kronos, hp, ivr systems  ateb rx. responsible to install and troubleshoot networking equipment ranging from wired switches to wireless access points,setup  troubleshoot/repair ibm pseries rs/6000 servers and peripherals. break/fix technician, no escalation. responsible for company vehicle, maintenance scheduling, rma returns, numerous sla contracts and full van inventory. 24/7 on-call position with overnight priority calls. i was the territory senior technician and successfully trained a new employee. kodak imaging expert / field marketing specialist 03/2006 to 12/2009 company name city , state i was responsible to engage and train sales associates and customers in large retail stores by organizing training events, presentations and i was responsible to engage and train sales associates and customers in large retail stores by organizing training events, presentations and role playing demonstrations. tasked with increasing consumer brand awareness by selling and demonstrating kodak products, merchandising and organizing kodak camera and peripheral displays, and assisting with fourth quarter black friday sales events. i was rewarded each year after the sales figures were totaled for surpassing my sales goals. i enjoyed demonstrating kodak because everyone knows kodak, and the products were simple to use, yet produced superior photographs, prints and images. merchandising / marketing specialist 10/2005 to 12/2007 company name city , state worked for several divisions of actionlink concurrently: merchandising, marketing and training. in-store marketing, merchandising and sales of technical hardware and services, such as dell, sprint, logitech and garmin. set up plan-o-grams (pog), live units and security for sensitive equipment. self-managed, drove own vehicle, recorded mileage. received shipments at home and position required extensive planning before set up could begin. digital imaging specialist 08/2005 to 03/2006 company name city , state retail sales of digital, 35mm, and dslr cameras and accessories. helped promote brand awareness for targeted brands, and new features of the cameras. trained customers on digital camera features and specifications, provided hands-on demonstrations and short photo seminars for anyone interested. i assisted in prepping store for black friday sale promotions, starting at 3:30am. i always completed the sale by walking customer to register, thanking them for the business and inviting them to come back with their purchase and show it off; many did seasonal position for q4 and overstock through march. business machines sales associate 09/2002 to 07/2005 company name city , state retail sales of computers, office supplies, electronics and related peripherals. assisted. customers with printers, monitors, desktop  laptop computers, gps and digital cameras. i was able to assist in in all departments of the store, ran the copy center when associates called out, made cardboard bales and used pallet jacks. i was responsible for repairing customer computers in-store and worked as store computer technician before the easy tech program was rolled out. i was asked by management to assist in taking a proper inventory in a nearby store plagued with inventory discrepancies, and later was tasked by district management to assist in the final stages of building, plan-o-gramming and stocking the monticello, ny staples location. i received numerous s pins which signify outstanding customer service being reported to corporate. education ge - residential energy auditor , energy management and systems technology/technician : technology 2014 ashworth college city , state , usa gpa: delta epsilon tau honor society, alumni society delta epsilon tau honor society, alumni society undergraduate certificate in computer information management , computer technology/computer systems technology online courses : technology 2010 ashworth college city , state , usa associate of arts and sciences (a.a.s : business administration, management and operations business management club 2009 suny orange city , state , usa business administration, management and operations business management club skills sales software: salesforce.com, tapscan cms: joomla, wordpress desktop publishing software: photoshop, illustrator plethora of hardware repair and diagnostic skills experienced desktop support and trainer",
    "metadata": {
      "has_education": true
    },
    "sections": {},
    "keywords": [
      "sale",
      "business",
      "server",
      "customer",
      "city",
      "state",
      "management",
      "service",
      "company",
      "system",
      "responsible",
      "technology",
      "technical",
      "computer",
      "store",
      "name",
      "specialist",
      "technician",
      "camera",
      "repair",
      "equipment",
      "peripheral",
      "retail",
      "training",
      "kodak",
      "associate",
      "information",
      "experience",
      "field",
      "install"
    ]
  },
  "file_path": "/Users/proxim/Desktop/Automated-First-Screener-and-AI-Job-Matching-NLP-WebEngine/data/raw/resumes/r8bd5f.pdf"
}