{
  "id": "r98c1b",
  "filename": "48037995.pdf",
  "upload_time": "17:35:12",
  "document_type": "resume",
  "original_text": "STAFF PHARMACIST\nSummary\nPatient and professional excellence oriented Pharmacist with Doctor of Pharmacy and Master in Science degrees. Nine years of retail experience\nproviding outstanding pharmacy services in a high-volume setting. Strong background in science and clinical pharmacology and excellent\ninterpersonal skills with a track record of establishing positive relationships with customers, co-workers, medical professionals, and insurance\nproviders. Enthusiastic about acquiring new clinical knowledge and experience in a hospital setting.\nCommitted to providing highest quality pharmaceutical services and personal patient care as an essential link in disease management. Dedicated to\ndeliver peak performance as well as fast and accurate medication dispensing. Capable and able to demonstrate versatility in adapting to every-\nincreasing complexity in the healthcare industry.\nHighlights\nStrong Diverse Science Background\nStrong Academic Skills\nStrong Decision-Making Ability\nPrescription Dispensing and Compounding\nDrug Interaction Assessment\nClinical Interventions\nProduct Safety and Quality Assurance\nExceptional Patient Care\nProficient with software (Word, Excel, PowerPoint,\nAccess)\nAbility to Identify and Solve Potential Problem\nHigh Personal and Professional Ethics\nCreative Cognitive Skills\nPharmaceutical Research and Data Analysis\nEfficient and Accurate\nExceptional Attention to Details\nExcellent Telephone Etiquette\nAbility to Listen and Communicate in a Articulate Manner\nHigh Level of Organizational and Personal Skills\nCustomer and Coworker Relationship Management on a Personal\nLevel\nAchievements\nRecognized for ability to manage a high volume of patient accounts.\nConsult with hundreds of physicians and patients to fill prescriptions, review side effects, discuss drug interactions and resolve medication\ndelivery problems.\nImproved drug-inventory management system to reduce waste and eliminate back orders.\nCultivated strong network in a community, resulting in a new patient enrollments.\nImproved morale of coworkers by rewarding good work performance, leading by example and using humor to diffuse stressful situations.\nTranslated pharmacy communications for Russian speaking customers and recruited new customers.\nProfessional Experience\n12/2002\n \nto \n04/2009\nStaff Pharmacist\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nManage ancillary staff in fulfilling more than 1,500 prescriptions weekly. Consult with physicians and patients with regard to medication dosage,\ndrug interactions, medical equipment, disease management and potential side effects of prescription and OTC medications.\nDispense and compound prescriptions, and maintain accurate patient records, dosing information and directions for use. Interact with HMOs and\nother insurance providers concerning billing/reimbursement issues. Keep abreast of new developments within the pharmaceutical industry.\nProficiently processed and dispensed written, oral and electronic prescriptions.\nConducted drug utilization reviews, drug interventions and therapy management.\nProvided critical information and advice to customers regarding possible drug interactions, side effects, dosage and proper medication\nstorage.\nStrictly maintained customer and patient confidentiality.\nMaintained proper storage and security conditions for all drugs.\nMastered HEB Pharmacy Standard Operating Procedures (SOPS).\nMaintained updated records such as pharmacy files, patient profiles, charge system files, inventories and poison or controlled drug registries.\nCalculated, weighed, measured and mixed ingredients with expert precision.\nAdvised customers on the selection of over the counter products, healthcare supplies, dietary and herbal supplements.\nConsistently upheld proper pharmacy and general safety procedures and standards.\nOversaw the pharmacy technicians' drug preparation and distribution activities to provide safe, efficient care for patients.\nFollowed state and federal record keeping guidelines \nfor legend drugs and controlled substances.\nAppropriately resolved customer issues, complaints and questions.\nManaged pharmacy inventory through proper medication ordering, returns and inter-store transfers.\n\n01/1998\n \nto \n11/2002\nPharmacy Intern\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\n12/1995\n \nto \n09/1998\nPharmacy technician\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\n01/1990\n \nto \n11/1993\nElectronics Technician\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nWorked closely with team of engineers and technician\nMaintained \nand troubleshoot electronic and computer based equipment.\nRecorded precision measurements from electronic devices during the test\nCompleted database, created graphics and checked final reports for accuracy\nSupported engineering team as a customer service representative\n01/1990\n \nto \n04/1991\nTeaching Assistant/ Laboratory Supervisor\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nSupervised and helped students during laboratory experiments\nSoldered and assembled laboratory equipment\nMaintained proper laboratory and general safety procedures and standards, including department cleanliness.\nEducation\n2002\nDoctor of Pharmacy\n \n: \nPharmaceutics\n \nMassachusetts College of Pharmacy and Health Science\n \nï¼​ \nCity\n \n, \nState\n \n, \nUSA\nClinical rotations at :\nBeth Israel Deaconess Medical Center (Infectious Disease),\nBoston Children's Hospital (Center for Poison Control and Prevention),\nBeverly Hospital (Inpatient and Ambulatory care),\nBoston Dialysis Center .\n1992\nMaster of Science\n \n: \nHardware Engineering \nUniversity of Information Technology, Mechanics and Optics\n \nï¼​ \nCity\n \nRussia\nCertifications\nIn good standing with the Massachusetts Board of Pharmacy\nSkills\nIntegrity and Honesty\nCompassion and Courtesy\nExcellent Interpersonal Skills\nHigh Level of Analytical and Cognitive Skills\nSelf-Disciplined and Self-Motivated",
  "processed": {
    "clean_text": "staff pharmacist summary patient and professional excellence oriented pharmacist with doctor of pharmacy and master in science degrees. nine years of retail experience providing outstanding pharmacy services in a high-volume setting. strong background in science and clinical pharmacology and excellent interpersonal skills with a track record of establishing positive relationships with customers, co-workers, medical professionals, and insurance providers. enthusiastic about acquiring new clinical knowledge and experience in a hospital setting. committed to providing highest quality pharmaceutical services and personal patient care as an essential link in disease management. dedicated to deliver peak performance as well as fast and accurate medication dispensing. capable and able to demonstrate versatility in adapting to every- increasing complexity in the healthcare industry. highlights strong diverse science background strong academic skills strong decision-making ability prescription dispensing and compounding drug interaction assessment clinical interventions product safety and quality assurance exceptional patient care proficient with software (word, excel, powerpoint, access) ability to identify and solve potential problem high personal and professional ethics creative cognitive skills pharmaceutical research and data analysis efficient and accurate exceptional attention to details excellent telephone etiquette ability to listen and communicate in a articulate manner high level of organizational and personal skills customer and coworker relationship management on a personal level achievements recognized for ability to manage a high volume of patient accounts. consult with hundreds of physicians and patients to fill prescriptions, review side effects, discuss drug interactions and resolve medication delivery problems. improved drug-inventory management system to reduce waste and eliminate back orders. cultivated strong network in a community, resulting in a new patient enrollments. improved morale of coworkers by rewarding good work performance, leading by example and using humor to diffuse stressful situations. translated pharmacy communications for russian speaking customers and recruited new customers. professional experience 12/2002 to 04/2009 staff pharmacist company name ï¼ city , state manage ancillary staff in fulfilling more than 1,500 prescriptions weekly. consult with physicians and patients with regard to medication dosage, drug interactions, medical equipment, disease management and potential side effects of prescription and otc medications. dispense and compound prescriptions, and maintain accurate patient records, dosing information and directions for use. interact with hmos and other insurance providers concerning billing/reimbursement issues. keep abreast of new developments within the pharmaceutical industry. proficiently processed and dispensed written, oral and electronic prescriptions. conducted drug utilization reviews, drug interventions and therapy management. provided critical information and advice to customers regarding possible drug interactions, side effects, dosage and proper medication storage. strictly maintained customer and patient confidentiality. maintained proper storage and security conditions for all drugs. mastered heb pharmacy standard operating procedures (sops). maintained updated records such as pharmacy files, patient profiles, charge system files, inventories and poison or controlled drug registries. calculated, weighed, measured and mixed ingredients with expert precision. advised customers on the selection of over the counter products, healthcare supplies, dietary and herbal supplements. consistently upheld proper pharmacy and general safety procedures and standards. oversaw the pharmacy technicians drug preparation and distribution activities to provide safe, efficient care for patients. followed state and federal record keeping guidelines for legend drugs and controlled substances. appropriately resolved customer issues, complaints and questions. managed pharmacy inventory through proper medication ordering, returns and inter-store transfers. 01/1998 to 11/2002 pharmacy intern company name ï¼ city , state 12/1995 to 09/1998 pharmacy technician company name ï¼ city , state 01/1990 to 11/1993 electronics technician company name ï¼ city , state worked closely with team of engineers and technician maintained and troubleshoot electronic and computer based equipment. recorded precision measurements from electronic devices during the test completed database, created graphics and checked final reports for accuracy supported engineering team as a customer service representative 01/1990 to 04/1991 teaching assistant/ laboratory supervisor company name ï¼ city , state supervised and helped students during laboratory experiments soldered and assembled laboratory equipment maintained proper laboratory and general safety procedures and standards, including department cleanliness. education 2002 doctor of pharmacy : pharmaceutics massachusetts college of pharmacy and health science ï¼ city , state , usa clinical rotations at : beth israel deaconess medical center (infectious disease), boston childrens hospital (center for poison control and prevention), beverly hospital (inpatient and ambulatory care), boston dialysis center . 1992 master of science : hardware engineering university of information technology, mechanics and optics ï¼ city russia certifications in good standing with the massachusetts board of pharmacy skills integrity and honesty compassion and courtesy excellent interpersonal skills high level of analytical and cognitive skills self-disciplined and self-motivated",
    "metadata": {
      "has_education": true
    },
    "sections": {},
    "keywords": [
      "pharmacy",
      "patient",
      "drug",
      "customer",
      "skill",
      "city",
      "state",
      "medication",
      "prescription",
      "science",
      "strong",
      "management",
      "company",
      "name",
      "proper",
      "maintained",
      "professional",
      "clinical",
      "record",
      "new",
      "personal",
      "care",
      "ability",
      "interaction",
      "high",
      "technician",
      "laboratory",
      "staff",
      "pharmacist",
      "experience"
    ]
  },
  "file_path": "/Users/proxim/Desktop/Automated-First-Screener-and-AI-Job-Matching-NLP-WebEngine/data/raw/resumes/r98c1b.pdf"
}