{
  "id": "r9b345",
  "filename": "37764298.pdf",
  "upload_time": "17:35:13",
  "document_type": "resume",
  "original_text": "INFORMATION TECHNOLOGY CONSULTANT\nHighlights\nSoftware: \nMS Word, Outlook, PowerPoint, Excel, Access, CRM, Adobe Acrobat XI\nProfessional, Snag-ItTM, Hot Docs (legal document generation software), MS\nWindows XP/Vista/7/8, MS Windows Server 2000/2003.\nHardware: Build, repair and upgrade desktop\ncomputers. \nRepair and upgrade laptop computers.\nInstall and setup servers, printers and routers.\nExperience\nInformation Technology Consultant\n \n, \n12/2009\n \nto \n02/2016\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nBasic computer network setup and troubleshooting.\nInstall software and printers.\nComputer repair and upgrade for individuals.\nMicrosoft Excel spreadsheet creation.\nAccomplishments: Setup network for small non-profit organization.\nCreated organizational spreadsheets for daily operations and marketing for small businesses.\nUpgraded SQL and Time Matters for Edward S.Clay, P.A.\nOffice Administrator/Billing Assistant\n \n, \n08/2015\n \nto \n01/2016\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nAssisted with administrative duties in the operations departments.\nCreated airtime spreadsheets and assists with revenue reporting.\nAssisted with data entry into an internal billing system (UCAP).\nAssisted with downloading various airtime carrier's invoices and data files.\nAssisted with monthly airtime billing using UCAP.\nAssisted with the activation/deactivation of SIMs/devices.\nRan usage and airtime reports as requested by the customer.\nReconciled each carrier's charges to UCAP output.\nPlaced orders, received and shipped packages.\nFunding & Settlement Coordinator/Office Manager\n \n, \n08/2011\n \nto \n08/2015\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nResponsible for getting clients' assets re-titled into their respective trusts.\nEnter client data onto database and legal document generation software.\nBuild long-term relationships with trust maintenance clients.\nOrder office supplies and legal document supplies.\nAnswer phones.\nAssist clients with questions, problems and concerns.\nGreet clients when visiting office for a meeting.\nSchedule appointments.\nManage attorney's calendar.\nPrint legal documents and prepare delivery binders.\nReview legal documents for formatting errors and missing information.\nWitness clients' signatures on legal documents.\nNotarize certain signatures.\nGenerate funding instructions for trust clients both Family Legacy and \"Documents Only\" clients.\nTroubleshoot and maintain computer network and workstations.\nAccomplishments: Develop great working relationships with trust maintenance clients.\nGrowth in client base of 73% during employment period.\nManage the probate process for multiple estates at the same time while also overseeing the funding of assets to new and existing clients for\nrevenue generation.\nManage the office, performed Client Services Coordinator tasks and handled Funding & Settlement Coordinator tasks alone on a daily\nbasis.\nStudent Operations Specialist\n \n, \n01/2002\n \nto \n12/2009\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nPrepared student reports for multiple state regulatory agencies and national accreditation agency, ACCET (Accrediting Council for\nContinuing Education and Training.) Answered phones.\nData entry of new enrollments and materials assigned to each.\nReported inventory and distribution of student classroom materials data to CFO on a monthly basis.\nDeveloped complex spreadsheets to analyze qualitative and quantitative data using Excel and Visual Basic.\nPublished & updated student policy catalog.\nResponsible for protecting students' privacy when records were requested by third parties.\nManaged course scheduling for all 25 schools as well as all student records and transcripts.\nReviewed feedback from potential students after first visit to school for quality control purposes.\nMaintained records of complaints.\nCollaborated on written responses.\nAccomplishments: Saved company over $4 million by strengthening controls on textbook inventory.\n\nDeveloped system of student records collection and storage electronically on company database through collaboration with programmers.\nCreated process and form for third-parties to request student records in accordance with FERPA (Federal Education Right to Privacy Act).\nManaged the class schedules in all 25 schools using MS Excel advanced formulas and Visual Basic programming.\nInformation Technology Coordinator\n \n, \n05/1996\n \nto \n05/2001\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nResponsible for installation and troubleshooting Windows 2000 workstations, hardware, printers, peripherals, and software.\nManaged telecommunications system administration, programming, and troubleshooting.\nTrained brokers and new employees on system and applications.\nProcessed stock certificates and checks for deposit into respective client account.\nAnswered main phone and directed calls to requested personnel.\nSupervised Operations staff of two cashiers and one receptionist.\nMaintained records for annual audits and SEC regulation compliance.\nResolved trade errors committed by brokers.\nBalanced error accounts for all branches.\nEarned series of fast-track promotions from New Accounts Clerk, Lead Cashier, Operations Manager, to IT Coordinator.\nEntrusted with maintaining accuracy and credit/debit balance of millions of dollars in client accounts.\nBecame primary technical troubleshooter and \"go to\" person for entire Lutherville branch (93 work stations) as well as 6 remote satellite\noffices.\nEducation\nCertificate of Completion, Microsoft Certified Systems Engineer Training, ComputerTraining.Com\n \n:\n \nJanuary 2002\nB.S\n \n:\n \nBusiness Finance\n \n,\n \nJanuary 1991\n \nTowson University\n \nï¼​ \nCity\n \n, \nState\n \nBusiness Finance\nMaryland Notary Public (Commission Expires August 26, 2018) \nMicrosoft Certified Systems Engineer\n \n:\n \nFebruary 2002\nSkills\nadministrative duties, Adobe Acrobat, Schedule appointments, asset management, agency, attorney, balance, Basic, billing, billing system, Cashier,\ncatalog, Com, Computer repair and upgrade, Hardware, Council, credit, CRM, Client, clients, Data entry, database, debit, delivery, fast, financial,\ninformation technology, inventory, laptop computers, Law, legal, legal documents, marketing, materials, Access, Microsoft Certified Systems\nEngineer, Microsoft Excel, MS Excel, Excel, office, Outlook, PowerPoint, MS Windows, Windows 2000, 2000, MS Windows XP, MS Word,\nnetwork setup, network, Notary Public, Order office supplies, organizational, peripherals, personnel, printers, profit, programming, quality control,\nreceptionist, reporting, routers, scheduling, servers, SIMs, Software engineering, Install software, spreadsheets, spreadsheet, SQL, system\nadministration, telecommunications, phones, phone, Answer phones, Troubleshoot, troubleshooting, upgrade, Vista, Visual Basic, Visual Basic\nprogramming, written",
  "processed": {
    "clean_text": "information technology consultant highlights software: ms word, outlook, powerpoint, excel, access, crm, adobe acrobat xi professional, snag-ittm, hot docs (legal document generation software), ms windows xp/vista/7/8, ms windows server 2000/2003. hardware: build, repair and upgrade desktop computers. repair and upgrade laptop computers. install and setup servers, printers and routers. experience information technology consultant , 12/2009 to 02/2016 company name ï¼ city , state basic computer network setup and troubleshooting. install software and printers. computer repair and upgrade for individuals. microsoft excel spreadsheet creation. accomplishments: setup network for small non-profit organization. created organizational spreadsheets for daily operations and marketing for small businesses. upgraded sql and time matters for edward s.clay, p.a. office administrator/billing assistant , 08/2015 to 01/2016 company name ï¼ city , state assisted with administrative duties in the operations departments. created airtime spreadsheets and assists with revenue reporting. assisted with data entry into an internal billing system (ucap). assisted with downloading various airtime carriers invoices and data files. assisted with monthly airtime billing using ucap. assisted with the activation/deactivation of sims/devices. ran usage and airtime reports as requested by the customer. reconciled each carriers charges to ucap output. placed orders, received and shipped packages. funding  settlement coordinator/office manager , 08/2011 to 08/2015 company name ï¼ city , state responsible for getting clients assets re-titled into their respective trusts. enter client data onto database and legal document generation software. build long-term relationships with trust maintenance clients. order office supplies and legal document supplies. answer phones. assist clients with questions, problems and concerns. greet clients when visiting office for a meeting. schedule appointments. manage attorneys calendar. print legal documents and prepare delivery binders. review legal documents for formatting errors and missing information. witness clients signatures on legal documents. notarize certain signatures. generate funding instructions for trust clients both family legacy and documents only clients. troubleshoot and maintain computer network and workstations. accomplishments: develop great working relationships with trust maintenance clients. growth in client base of 73 during employment period. manage the probate process for multiple estates at the same time while also overseeing the funding of assets to new and existing clients for revenue generation. manage the office, performed client services coordinator tasks and handled funding  settlement coordinator tasks alone on a daily basis. student operations specialist , 01/2002 to 12/2009 company name ï¼ city , state prepared student reports for multiple state regulatory agencies and national accreditation agency, accet (accrediting council for continuing education and training.) answered phones. data entry of new enrollments and materials assigned to each. reported inventory and distribution of student classroom materials data to cfo on a monthly basis. developed complex spreadsheets to analyze qualitative and quantitative data using excel and visual basic. published  updated student policy catalog. responsible for protecting students privacy when records were requested by third parties. managed course scheduling for all 25 schools as well as all student records and transcripts. reviewed feedback from potential students after first visit to school for quality control purposes. maintained records of complaints. collaborated on written responses. accomplishments: saved company over 4 million by strengthening controls on textbook inventory. developed system of student records collection and storage electronically on company database through collaboration with programmers. created process and form for third-parties to request student records in accordance with ferpa (federal education right to privacy act). managed the class schedules in all 25 schools using ms excel advanced formulas and visual basic programming. information technology coordinator , 05/1996 to 05/2001 company name ï¼ city , state responsible for installation and troubleshooting windows 2000 workstations, hardware, printers, peripherals, and software. managed telecommunications system administration, programming, and troubleshooting. trained brokers and new employees on system and applications. processed stock certificates and checks for deposit into respective client account. answered main phone and directed calls to requested personnel. supervised operations staff of two cashiers and one receptionist. maintained records for annual audits and sec regulation compliance. resolved trade errors committed by brokers. balanced error accounts for all branches. earned series of fast-track promotions from new accounts clerk, lead cashier, operations manager, to it coordinator. entrusted with maintaining accuracy and credit/debit balance of millions of dollars in client accounts. became primary technical troubleshooter and go to person for entire lutherville branch (93 work stations) as well as 6 remote satellite offices. education certificate of completion, microsoft certified systems engineer training, computertraining.com : january 2002 b.s : business finance , january 1991 towson university ï¼ city , state business finance maryland notary public (commission expires august 26, 2018) microsoft certified systems engineer : february 2002 skills administrative duties, adobe acrobat, schedule appointments, asset management, agency, attorney, balance, basic, billing, billing system, cashier, catalog, com, computer repair and upgrade, hardware, council, credit, crm, client, clients, data entry, database, debit, delivery, fast, financial, information technology, inventory, laptop computers, law, legal, legal documents, marketing, materials, access, microsoft certified systems engineer, microsoft excel, ms excel, excel, office, outlook, powerpoint, ms windows, windows 2000, 2000, ms windows xp, ms word, network setup, network, notary public, order office supplies, organizational, peripherals, personnel, printers, profit, programming, quality control, receptionist, reporting, routers, scheduling, servers, sims, software engineering, install software, spreadsheets, spreadsheet, sql, system administration, telecommunications, phones, phone, answer phones, troubleshoot, troubleshooting, upgrade, vista, visual basic, visual basic programming, written",
    "metadata": {
      "has_education": true
    },
    "sections": {},
    "keywords": [
      "client",
      "system",
      "student",
      "legal",
      "document",
      "software",
      "excel",
      "computer",
      "company",
      "state",
      "office",
      "data",
      "window",
      "city",
      "basic",
      "spreadsheet",
      "phone",
      "record",
      "information",
      "upgrade",
      "name",
      "network",
      "microsoft",
      "operation",
      "assisted",
      "technology",
      "repair",
      "setup",
      "printer",
      "troubleshooting"
    ]
  },
  "file_path": "/Users/proxim/Desktop/Automated-First-Screener-and-AI-Job-Matching-NLP-WebEngine/data/raw/resumes/r9b345.pdf"
}