{
  "id": "ra71c7",
  "filename": "29051656.pdf",
  "upload_time": "17:35:16",
  "document_type": "resume",
  "original_text": "INFORMATION TECHNOLOGY SPECIALIST\nSummary\nAn organized DBA professional with over 6years hands-on experience supporting Oracle databases, Sql Server databases and AWS\ninfrastructure. Equipped with excellent communication and interpersonal skills; a highly organized individual and team player who possesses strong\nanalytical and problem solving skills, and is who is committed in delivering quality services to customers/clients.\nExperience\nInformation Technology Specialist\n \n03/2018\n \nto \nCurrent\n \nCompany Name\n \nCity\n \n, \nState\nÂ Primary responsibilities include production support, installation and configuration, migration, backup and recovery, performance tuning,\ncloning, security, upgrades, and patches.\nPlanned, installed and upgraded multiple Oracle databases from 11.2.0.4 to 12.2.0.\nAdded targets to OEM 13c and used OEM 13c to monitored databases.\nCreated rules, security profiles using OEM 13c.\nPerformed Hot/Cold Backup, Recovery and Cloning of databases using RMAN\nPlanned and implemented Backup strategies, used RMAN and Crontab to schedule backup.\nInstalled and upgraded databases from MySQL 5.6 to 5.7 and implemented mysqld_multi for better performance.\nMigrated databases from on-premise to AWS using Database migration services.\nLaunched and maintained RDS and EC2 instances in AWS.\nCreated Snapshots, Elastic IPs, EBS Volumes, Security Groups per clients/costumers request.\nPerformed cross region replication with S3.\nCreated security groups to manage inbound and outbound rules.\nDatabase Administrator\n \n12/2014\n \nto \nCurrent\n \nCompany Name\n \nCity\n \n, \nState\nTroubleshot and resolved web application issues escalated from customer support and other departments with a 100% success rate.\nWorked with clients to analyze computing and network needs and implemented appropriate solutions within each department's budget.\nAnalyzed performance monitoring/tuning/troubleshooting - Oracle database performance tuning services with EXPLAIN PLAN, TKPROF,\nSTATSPACK, AWR and SQL TRACE.\nInstalled, configured and maintained Physical, Logical, Active standby databases supported by Data guard on Oracle 11g, and 10g RAC\nservers for the purpose of disaster recovery procedures.\nGenerated ASH, ADDM and AWR Reports using OEM from Oracle 10g, 11g and 12c database and analyzed the reports for Oracle wait\nevents, time consuming SQL queries, tablespace growth, and database growth.\nImplemented database re-organizations as required to improved performance and ensure maximum up-time of the database; implemented\nSQL Access and SQL Tuning advisers recommendations.\nLaunched and maintained RDS and EC2 instances in AWS.\nCreated Snapshots, Elastic IPs, EBS Volumes, Security Groups per clients/costumers request.\nPlanned and implemented high availability solutions such as Real Application Cluster (RAC) in Oracle 11gR2 Grid and 10g on ASM and\nACFS file systems.\nMigrated multiple stand-alone databases to RAC databases using Rconfig, RMAN and OEM.\nMigrated single instance databases from NON-ASM to ASM file system to improve performance.\nInstalled Oracle 10g, 11g and 12c software and created multiple databases including Plug-able and container databases in oracle 12c.\nImplemented TDE, Data Redaction and database Auditing to improved data integrity and security.\nApplied PSU on standalone TEST environment using OPatch and same PSU (Grid and RDBMS Patching) on production cluster using\nOPatch Auto.\nReplicated data in real time using Oracle Golden Gate and Oracle streams.\nAnalyzed, interpreted and troubleshot Golden Gate related issues.\nDesigned and implemented different backup strategies like Cold, Hot backup using RMAN with Flash Recovery Area and Logical Backups\nwith EXPDP/IMPDP.\nScheduled RMAN backups, purge jobs, Maintenance Jobs using DBMS_JOBS, DBMS_SCHEDULER, Crontab and OEM.\nImplemented and managed logical backup/recovery with Datapump and Export/Import utilities.\nCloned databases using RMAN and Manually using scripts.\nImplemented Point In Time Recovery on one or more tablespaces to recover lost of a table(s) while eliminating down time for the database.\nInstalled SQL Server EE 2012 on windows and created databases, triggers, tables, procedures, functions and database diagrams.\nUpgraded databases from 10g to 11g and to 12c using DBUA, Datapump, Manually, Transportable Tablespace and Oracle Dataguard.\nOracle Database Administrator\n \n07/2012\n \nto \n10/2014\n \nCompany Name\n \nCity\n \n, \nState\nPrepared technical architecture proposals for enhancements and migrated an existing standalone database to RAC database.\nProvided senior technical support to Developers and troubleshot performance issues and maintained high availability and security of\ndatabases.\nAnalyzed and tuned the Database to identify potential database bottle necks such as response delay, locking contention, wait event using\ntools like STATSPACK, EXPLAIN PLAN, and TKPROF.\nCollaborated and worked together with development and operations staff and resolved problems quickly and efficiently.\nMaintained Physical, Logical, Active standby databases supported by Data guard on Oracle 11g, and 10g RAC servers for the purpose of\ndisaster recovery procedures.\nInstalled, configured, deployed and monitored different databases and application servers using Oracle OEM 12c Grid Control.\n\nWorked efficiently in Database administration activities such as User management, Space management, Monitoring, Creating Database,\nManaging Oracle Instance and Database security and Materialized views.\nMaintained and administered \nhigh availability solutions such as Real Application Cluster (RAC) in Oracle 11gR2 Grid and 10g on ASM file\nsystem.\nPlanned and applied PSU/CPU patches and upgraded multiple databases from 10g to 11g.\nReplicated data in real time using oracle Golden Gate.\nIncreased data security; implemented TDE and database auditing and created threshold on database metrics and set alert for a more\nstronger security.\nMaintained Active Data guard, creating both Logical and Physical Standby databases for data disaster recovery solutions.\nWorked on 24/7 environments, supported, monitored, managed and troubleshot database related issues over 300 oracle 10g, 11g and 12c\ndatabases with sizes from 300G to 2TB.\nImplemented backup strategies used RMAN for incremental/full backup and Datapump to backup logical components.\nEducation and Training\nBachelor of Science\n \n: \nCivil Engineering\n \nUniversity Of Buea\n \nCity\n \n, \nState\n \n, \nCameroon\n \nCivil Engineering\nTechnical Environment\nDatabases:\n Oracle 10g, 11g, 12c, MySQL 5.6, 5.7, Sql Server 2008, 2012\nPlatforms:\n \nOracle Enterprise Linux 5.11, 6.7, 7, HP-UX 10.x, 11.x. Sun Solaris 2.5, 2.6, Windows Server 2008\nTools\n : TKPROF, EXPLAIN PLAN, STATSPACK, AWR, and ADDM Toad, Putty, X-wing32, WinSCP.Â \nDatabase Utilities\n : Oracle Enterprise Manager, Real Application Cluster, ASM, Transportable Tablespaces, SQL*Loader, RMAN,\nDataPump, Export, Import\nLanguages\n :Â  \nÂ·SQL*PLUS, PL/SQL, UNIX Shell Scripting, Ksh, bash",
  "processed": {
    "clean_text": "information technology specialist summary an organized dba professional with over 6years hands-on experience supporting oracle databases, sql server databases and aws infrastructure. equipped with excellent communication and interpersonal skills; a highly organized individual and team player who possesses strong analytical and problem solving skills, and is who is committed in delivering quality services to customers/clients. experience information technology specialist 03/2018 to current company name city , state â primary responsibilities include production support, installation and configuration, migration, backup and recovery, performance tuning, cloning, security, upgrades, and patches. planned, installed and upgraded multiple oracle databases from 11.2.0.4 to 12.2.0. added targets to oem 13c and used oem 13c to monitored databases. created rules, security profiles using oem 13c. performed hot/cold backup, recovery and cloning of databases using rman planned and implemented backup strategies, used rman and crontab to schedule backup. installed and upgraded databases from mysql 5.6 to 5.7 and implemented mysqld_multi for better performance. migrated databases from on-premise to aws using database migration services. launched and maintained rds and ec2 instances in aws. created snapshots, elastic ips, ebs volumes, security groups per clients/costumers request. performed cross region replication with s3. created security groups to manage inbound and outbound rules. database administrator 12/2014 to current company name city , state troubleshot and resolved web application issues escalated from customer support and other departments with a 100 success rate. worked with clients to analyze computing and network needs and implemented appropriate solutions within each departments budget. analyzed performance monitoring/tuning/troubleshooting - oracle database performance tuning services with explain plan, tkprof, statspack, awr and sql trace. installed, configured and maintained physical, logical, active standby databases supported by data guard on oracle 11g, and 10g rac servers for the purpose of disaster recovery procedures. generated ash, addm and awr reports using oem from oracle 10g, 11g and 12c database and analyzed the reports for oracle wait events, time consuming sql queries, tablespace growth, and database growth. implemented database re-organizations as required to improved performance and ensure maximum up-time of the database; implemented sql access and sql tuning advisers recommendations. launched and maintained rds and ec2 instances in aws. created snapshots, elastic ips, ebs volumes, security groups per clients/costumers request. planned and implemented high availability solutions such as real application cluster (rac) in oracle 11gr2 grid and 10g on asm and acfs file systems. migrated multiple stand-alone databases to rac databases using rconfig, rman and oem. migrated single instance databases from non-asm to asm file system to improve performance. installed oracle 10g, 11g and 12c software and created multiple databases including plug-able and container databases in oracle 12c. implemented tde, data redaction and database auditing to improved data integrity and security. applied psu on standalone test environment using opatch and same psu (grid and rdbms patching) on production cluster using opatch auto. replicated data in real time using oracle golden gate and oracle streams. analyzed, interpreted and troubleshot golden gate related issues. designed and implemented different backup strategies like cold, hot backup using rman with flash recovery area and logical backups with expdp/impdp. scheduled rman backups, purge jobs, maintenance jobs using dbms_jobs, dbms_scheduler, crontab and oem. implemented and managed logical backup/recovery with datapump and export/import utilities. cloned databases using rman and manually using scripts. implemented point in time recovery on one or more tablespaces to recover lost of a table(s) while eliminating down time for the database. installed sql server ee 2012 on windows and created databases, triggers, tables, procedures, functions and database diagrams. upgraded databases from 10g to 11g and to 12c using dbua, datapump, manually, transportable tablespace and oracle dataguard. oracle database administrator 07/2012 to 10/2014 company name city , state prepared technical architecture proposals for enhancements and migrated an existing standalone database to rac database. provided senior technical support to developers and troubleshot performance issues and maintained high availability and security of databases. analyzed and tuned the database to identify potential database bottle necks such as response delay, locking contention, wait event using tools like statspack, explain plan, and tkprof. collaborated and worked together with development and operations staff and resolved problems quickly and efficiently. maintained physical, logical, active standby databases supported by data guard on oracle 11g, and 10g rac servers for the purpose of disaster recovery procedures. installed, configured, deployed and monitored different databases and application servers using oracle oem 12c grid control. worked efficiently in database administration activities such as user management, space management, monitoring, creating database, managing oracle instance and database security and materialized views. maintained and administered high availability solutions such as real application cluster (rac) in oracle 11gr2 grid and 10g on asm file system. planned and applied psu/cpu patches and upgraded multiple databases from 10g to 11g. replicated data in real time using oracle golden gate. increased data security; implemented tde and database auditing and created threshold on database metrics and set alert for a more stronger security. maintained active data guard, creating both logical and physical standby databases for data disaster recovery solutions. worked on 24/7 environments, supported, monitored, managed and troubleshot database related issues over 300 oracle 10g, 11g and 12c databases with sizes from 300g to 2tb. implemented backup strategies used rman for incremental/full backup and datapump to backup logical components. education and training bachelor of science : civil engineering university of buea city , state , cameroon civil engineering technical environment databases: oracle 10g, 11g, 12c, mysql 5.6, 5.7, sql server 2008, 2012 platforms: oracle enterprise linux 5.11, 6.7, 7, hp-ux 10.x, 11.x. sun solaris 2.5, 2.6, windows server 2008 tools : tkprof, explain plan, statspack, awr, and addm toad, putty, x-wing32, winscp.â database utilities : oracle enterprise manager, real application cluster, asm, transportable tablespaces, sqlloader, rman, datapump, export, import languages :â âsqlplus, pl/sql, unix shell scripting, ksh, bash",
    "metadata": {
      "has_education": true
    },
    "sections": {},
    "keywords": [
      "database",
      "oracle",
      "using",
      "implemented",
      "backup",
      "security",
      "10g",
      "data",
      "rman",
      "11g",
      "sql",
      "server",
      "recovery",
      "performance",
      "oem",
      "created",
      "maintained",
      "12c",
      "installed",
      "logical",
      "rac",
      "application",
      "time",
      "real",
      "aws",
      "city",
      "state",
      "planned",
      "upgraded",
      "multiple"
    ]
  },
  "file_path": "/Users/proxim/Desktop/Automated-First-Screener-and-AI-Job-Matching-NLP-WebEngine/data/raw/resumes/ra71c7.pdf"
}