{
  "id": "rc00da",
  "filename": "15297298.pdf",
  "upload_time": "17:35:26",
  "document_type": "resume",
  "original_text": "PRACTICE MANAGER\nExecutive Summary\nStrategic, motivational, and solutions-focused leader with an MBA and with extensive experience in analyzing systems/processes and implementing\nmission-critical infrastructure improvements Broad based experience in the healthcare industry including regulatory/corporate compliance, strategic\nplanning, and contract negotiations. Craft and implement key quality improvements to enhance quality patient care and secure regulatory\ncompliance Proven track record of success in developing solutions which significantly improve the efficiency of business operations; experience\ndeveloping and implementing multi-year budgets and operational plans. Excel in corporate environments across diverse industries with the ability to\ncollaborate effectively with colleagues, executives, and client groups.\nCore Qualifications\nProficient in Windows 2000/XP/7;Novell NetWare 4.x/5.x/6.x; EMR (Allscripts and McKesson); TCP/IP Enterprise Networks; Enterprise\nVirus Protection; Asset Management/ITIL; Arcserve/Backup Exec/Net Backup; Symantec Ghost; Cable Installation/Management; LANDesk;\nWindow Server 2000/2003/2008; HIPAA/HITEC\nProfessional Experience\nPractice Manager\n \nAug 2014\n \nto \nCurrent\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nDevelop annual planning, budgeting and productivity levels for corporate accounting.\nPrepare detailed business and financial activity reports and use financial ratios and statistical trending for market-wide growth.\nImprovements to top line growth by 39.4% through building an effective hospital team, ensuring a safe and engaging environment, and\nimproving medical quality and business performance.\nResponsible for cost containment, cash control/banking, asset protection, loss prevention, inventory management, Federal and DEA\ncompliance.\nDevelop and deploy new hospital initiatives including training physician partners, implementing an efficient patient workflow from intake to\ndischarge and community marketing/outreach campaigns.\nBuild client base by providing extraordinary service to existing clients and by initiating new marketing plans.\nInformation Technology Manager\n \nFeb 2012\n \nto \nSep 2013\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nEnsured regulatory compliance and integrity of health information systems.\nProvided support during surveys, ADR, and internal audits.\nMentored and ensured the professional development of new clinical employees by providing onsite educational programs and supported\nseasoned clinical staff by making field visits.\nMember of the Performance Improvement committee and oversaw compliance department operations.\nInformation Technology Manager\n \nSep 2008\n \nto \nMay 2011\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nRevised technology initiatives, and developed strategic/operations plans to drive business operations.\nProvided all technical support for EMR (Allscripts) projects.\nDeveloped, authored, distributed, and enhanced processes and improved procedural manuals/policies Standardized purchasing,\nprocurement, inventory, and network operations.\nChampioned mission-critical operational changes which required new system, network, and telecommunication system training and\nemployee development.\nRecognized developing teams and processes that boosted growth, profitability, and efficiency.\nRevised clinical training collateral, delivered classroom instruction, and conducted clinical visits to ensure all field staff competencies in EMR\nsystem.\nMarketing Director\n \nFeb 2007\n \nto \nSep 2008\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nLed marketing initiatives including service packaging, advertising campaigns, seminar rollouts agency placements, endorsements, media\nactivities, service reviews, and website referrals.\nOversaw communication and 3rd part public relations.\nDirector of Information Systems\n \nJan 2004\n \nto \nFeb 2007\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nImplemented the agency's first disaster recovery plan to minimize productivity loss.\nEstablished equipment lifecycles to maximize use of technology throughout the organization.\nCreated and delivered agency computer/security training collateral and instruction to increase end user knowledge and minimize agency\nrisks.\nBoosted user satisfaction by doubling bandwidth at 2 remote sites and tripling bandwidth at the corporate site, and ensuring usage of VoIP\nin future projects.\nReduced maintenance costs, improved productivity, increased employee security, and decreased travel expenses by implementing Verizon\ncell phone plan to replace pagers, and included the Field Force Manager that Integrated into backend clinical system to do scheduling.\n\nEducation\nMaster of Business Administration (MBA)\n \nKeller Graduate School of Management\n \nï¼​ \nCity\n \n, \nState\nBachelor of Science\n \n, \nTelecommunications Management\n \nDeVry University\n \nï¼​ \nCity\n \n, \nState\nCertifications\nCisco Certified Network Associate (CCNA/CCAI) Leadership Training ITIL Foundations Certification Sniffer University - Sniffer Distributed\nTraining Certified Novell Administrator (CNA 5.1) HIPAA/HITECH Regulation\nSkills\nADR, advertising, Arcserve, Asset Management, agency, Backup Exec, Backup, banking, Budget Management, budgeting, business operations,\nCable, CCNA, Cisco Certified Network Associate, CNA 5.1, Change Management, Conflict Resolution, corporate accounting, client, clients,\nCustomer Relations, disaster recovery, educational programs, Employee Relations, financial, Ghost, information systems, Innovation, instruction,\ninternal audits, inventory management, inventory, ITIL, Leadership Training, regulatory compliance, loss prevention, marketing plans, marketing,\nmarket, Window, Windows 2000, 2000, Enterprise, network, Networks, Novell NetWare 4.x, Certified Novell Administrator, packaging,\nPerformance Management, Policies, processes, procurement, Project Management - Leadership, public relations, purchasing, quality, scheduling,\nStaff Development, strategic, Strategic Planning, surveys, Symantec, TCP/IP, technical support, telecommunication, phone, employee\ndevelopment, VoIP, website, workflow",
  "processed": {
    "clean_text": "practice manager executive summary strategic, motivational, and solutions-focused leader with an mba and with extensive experience in analyzing systems/processes and implementing mission-critical infrastructure improvements broad based experience in the healthcare industry including regulatory/corporate compliance, strategic planning, and contract negotiations. craft and implement key quality improvements to enhance quality patient care and secure regulatory compliance proven track record of success in developing solutions which significantly improve the efficiency of business operations; experience developing and implementing multi-year budgets and operational plans. excel in corporate environments across diverse industries with the ability to collaborate effectively with colleagues, executives, and client groups. core qualifications proficient in windows 2000/xp/7;novell netware 4.x/5.x/6.x; emr (allscripts and mckesson); tcp/ip enterprise networks; enterprise virus protection; asset management/itil; arcserve/backup exec/net backup; symantec ghost; cable installation/management; landesk; window server 2000/2003/2008; hipaa/hitec professional experience practice manager aug 2014 to current company name ï¼ city , state develop annual planning, budgeting and productivity levels for corporate accounting. prepare detailed business and financial activity reports and use financial ratios and statistical trending for market-wide growth. improvements to top line growth by 39.4 through building an effective hospital team, ensuring a safe and engaging environment, and improving medical quality and business performance. responsible for cost containment, cash control/banking, asset protection, loss prevention, inventory management, federal and dea compliance. develop and deploy new hospital initiatives including training physician partners, implementing an efficient patient workflow from intake to discharge and community marketing/outreach campaigns. build client base by providing extraordinary service to existing clients and by initiating new marketing plans. information technology manager feb 2012 to sep 2013 company name ï¼ city , state ensured regulatory compliance and integrity of health information systems. provided support during surveys, adr, and internal audits. mentored and ensured the professional development of new clinical employees by providing onsite educational programs and supported seasoned clinical staff by making field visits. member of the performance improvement committee and oversaw compliance department operations. information technology manager sep 2008 to may 2011 company name ï¼ city , state revised technology initiatives, and developed strategic/operations plans to drive business operations. provided all technical support for emr (allscripts) projects. developed, authored, distributed, and enhanced processes and improved procedural manuals/policies standardized purchasing, procurement, inventory, and network operations. championed mission-critical operational changes which required new system, network, and telecommunication system training and employee development. recognized developing teams and processes that boosted growth, profitability, and efficiency. revised clinical training collateral, delivered classroom instruction, and conducted clinical visits to ensure all field staff competencies in emr system. marketing director feb 2007 to sep 2008 company name ï¼ city , state led marketing initiatives including service packaging, advertising campaigns, seminar rollouts agency placements, endorsements, media activities, service reviews, and website referrals. oversaw communication and 3rd part public relations. director of information systems jan 2004 to feb 2007 company name ï¼ city , state implemented the agencys first disaster recovery plan to minimize productivity loss. established equipment lifecycles to maximize use of technology throughout the organization. created and delivered agency computer/security training collateral and instruction to increase end user knowledge and minimize agency risks. boosted user satisfaction by doubling bandwidth at 2 remote sites and tripling bandwidth at the corporate site, and ensuring usage of voip in future projects. reduced maintenance costs, improved productivity, increased employee security, and decreased travel expenses by implementing verizon cell phone plan to replace pagers, and included the field force manager that integrated into backend clinical system to do scheduling. education master of business administration (mba) keller graduate school of management ï¼ city , state bachelor of science , telecommunications management devry university ï¼ city , state certifications cisco certified network associate (ccna/ccai) leadership training itil foundations certification sniffer university - sniffer distributed training certified novell administrator (cna 5.1) hipaa/hitech regulation skills adr, advertising, arcserve, asset management, agency, backup exec, backup, banking, budget management, budgeting, business operations, cable, ccna, cisco certified network associate, cna 5.1, change management, conflict resolution, corporate accounting, client, clients, customer relations, disaster recovery, educational programs, employee relations, financial, ghost, information systems, innovation, instruction, internal audits, inventory management, inventory, itil, leadership training, regulatory compliance, loss prevention, marketing plans, marketing, market, window, windows 2000, 2000, enterprise, network, networks, novell netware 4.x, certified novell administrator, packaging, performance management, policies, processes, procurement, project management - leadership, public relations, purchasing, quality, scheduling, staff development, strategic, strategic planning, surveys, symantec, tcp/ip, technical support, telecommunication, phone, employee development, voip, website, workflow",
    "metadata": {
      "has_education": true
    },
    "sections": {},
    "keywords": [
      "management",
      "network",
      "city",
      "state",
      "training",
      "system",
      "compliance",
      "business",
      "plan",
      "manager",
      "operation",
      "client",
      "company",
      "name",
      "marketing",
      "information",
      "clinical",
      "employee",
      "agency",
      "strategic",
      "experience",
      "implementing",
      "improvement",
      "quality",
      "corporate",
      "window",
      "novell",
      "inventory",
      "new",
      "technology"
    ]
  },
  "file_path": "/Users/proxim/Desktop/Automated-First-Screener-and-AI-Job-Matching-NLP-WebEngine/data/raw/resumes/rc00da.pdf"
}