{
  "id": "rcc62c",
  "filename": "27058381.pdf",
  "upload_time": "17:35:18",
  "document_type": "resume",
  "original_text": "SYSTEM ADMINISTRATOR\nExperience\n03/2009\n \nCompany Name\n21674 SKSIT Security and the Wireless Environment \n11/05/12 18640 SKSIT Securing WLANs \n10/30/12 27481 SKSIT Building and\nSecuring VoIP Networks \n03/20/12 36542 SKSIT Protecting Windows 7 Against \nMalware and Vulnerabilities \n03/13/12 30688 SKSIT\nPhysical Security \n02/03/12 14766 SKSIT FIREWALLS AND VPNS \n01/23/12 34601 KISAM Service Manager (SM) Overview\n09/27/11 31699 Adding of Assets in KISAM Asset Manager \n09/26/11 31856 Windows Server 2008 System Administration \n04/01/11\n28902 STAN - Security Configurations for Windows 2003 Servers \n01/31/11 28801 \"EOps Test Planning Procedures OS, Databases and\nCOTS\" \n01/20/11 14763 SKSIT (ANS) ENCRYPTION TECHNOLOGIES \n04/09/10 23796 SKSIT Intrusion Detection and Response\nin Networked Environments \n03/22/10 21797 SKSIT Introducing Voice Over IP \n04/15/09 21674 SKSIT Security and the Wireless\nEnvironment \n04/14/09 17090 SKSIT Wireless Communication Basics \n04/10/09 17623 SKSIT Auditing and Monitoring \n05/01/08 21597\nSKSIT (ANS) The Fundamentals of Networking \n04/25/08 18287 SKSIT ITIL: Problem and Change Management \n04/24/08 18054\nKARTA Introduction to the Certification & Accreditation Process \n04/12/07 18064 KARTA Information Security Awareness - Beginner\n04/11/07 13085 SKSBS BUILDING RELATIONSHIPS TO GET RESULTS \n08/03/06 14115 SKSIT INTERNET SECURITY:\nFIREWALL PRINCIPLES \n08/02/06 14025 SKSIT CISCO ROUTERS, FIREWALLS, AND PERIMETER SECURITY \n07/31/06\n14780 SKSIT Wireless Security \n07/31/06 15248 WINDOWS SERVER 2003 ACTIVE DIRECTORY SERVICES \n04/07/06 17633\nSKSIT Malicious Code \n03/24/06 18035 KARTA Technical Controls \n03/23/06 18041 KARTA Risk Management \n03/22/06 18034\nKARTA Operational Controls \n03/17/06 18004 KARTA Principles of Operating Systems Security \n03/17/06 18033 KARTA Management\nControls \n03/16/06 17996 KARTA IT Security Awareness - Intermediate \n03/15/06 18076 KARTA FISMA: Establishing Security Metrics\n03/14/06 18064 KARTA Information Security Awareness - Beginner \n03/14/06 18060 KARTA Implementing Physical Security \n03/14/06\n15225 Firewalls and Internet Security \n12/16/05.\nSystem Administrator\n \n, \n07/2005\n \nto \nCurrent\n \nCompany Name\nHours per week: 40 + Ogden, UT 84201 \nSeries: 2210 Pay Plan: GS Grade: 12 \nInformation Technology Computer (This is a federal job)\nSupervisor Peter C Morgan 304-264-5413 \nMay Contact Supervisor: Yes As the 12 Computer Systems Administrator the EOps-ECC-\nWSSB-BSS-CIS group, my job function is varied and requires multi-tasking as a standard.\nI have acted as the CIS section supervisor.\nI am a trainer for new employee's coming into the group on details and 4 new permanent employees into the CIS group.\nI am required a basic working understanding of 7 projects and to be able to step in for other SA's at a moment's notice of well over 500\nservers.\nThe work involves analyzing customer requirements, developing specifications for new or modified systems, planning and coordinating the\ndesign, development, testing, installation, and support of new and modified systems, including hardware and software, and serving as the\nprimary liaison with customer organizations on all IT-related matters.\nThe work may involve developing and presenting training on the operation and maintenance of new systems to the IRS IT staff including IT\nspecialists in other specialty areas, to insure that new systems are properly managed.\nThe employee may adapt and implement systems diagnostic and maintenance tools to ensure the availability and functionality of systems\nrequired to support organizational Objectives and evaluate and recommend selection of new systems diagnostic tools.\nThis work affects the availability of IRS IT systems needed to meets the mission requirements.\nRegular contacts include employees in the same or related units, employees and managers within IRS and contractors/vendors at several\nlevels of the agency (campuses, headquarters or field offices); and individuals or groups from outside the agency, including consultants,\ncontractors, vendors, or representatives of professional.\nMy main duties are to maintain server's operation, security, and analyze and diagnose system hardware and software components.\nI also write up problem tickets with server's hardware and software and get clearance for vendors to have access to the servers for\nhardware repair as well as scheduling times with local I.R.S.\npersonal and vendor to accomplish the repairs.\nI \nmake sure when new server are to be put on the Domain I do all of the appropriate paper work which includes requesting \nUWR's,\nKISAM asset management to include all of the new servers information from serial numbers, bar code, make, model and location just to\nname few of them.\nI also file out the Server Compliance checklist, software license forms.\nIn addition, I image or re-image server with the proper Windows Operating System and software needed to run the server e.g.\nContact Recording, Contact Analytics, TOS, RTS among other servers.\nI also monitor and respond to KISAM Tickets I also monitor HIDS, Symantec Anti-Virus programs are up to date and operational.\nInsure all Microsoft Windows patches are installed on servers.\nI make sure Altiris is installed and the endpoint is healthy and if not I make the necessary corrections.\nI run Windows Policy Checker to insure the server stays with IRS and Cyber Security Compliance.\nIf there are any that is not in compliance, I make the necessary changes to bring them back into compliance.\nI create documents in Word and Power Point in referencing to problems that I have encountered during trouble shooting a situation for\nother's in my group in case they have similar situations or problems and put them in our group shared location on the network for all to read.\nI also have done short training on things that I have encountered or I had more knowledge than others in my group via OSC in sharing on\nmy conference calls.\nTPF Operations Server (TOS) I am the main system administrator and my accomplishments that I achieved was to set up a single sign on\nBAG group, single sign on to the IMM, from un-secure \nIMM Web page to a secure Web page and brought it current with the Big Fix\npatching.\nInstalling and maintaining software and hardware, controlling current versions in use and future release of application software, and\n\ndocumenting the physical configuration of the system.\nOptimizing the functionality of servers systems using performance tuning tools and techniques.\nAnalyze and Diagnosing and recovering failed systems using systems diagnosis tools and fault identification techniques.\nPlanning and coordinating the installation of new products or equipment, resolving installation problems, identifying and mitigating security\nvulnerabilities and risks, and maintaining server integrity and availability.\nInitiating corrective or preventive actions, such as increasing disk or memory capacity to improve system performance.\n01/1989\n \nto \n04/2007\n \nCompany Name\nHours per week: 40 + Ogden, UT 84201 \nSeries:2210 Pay Plan: GS Grade: \nInformation Technology Computer System Administrator (This\nis a federal job) Supervisor Sandy Spiers (801-620-4555) May Contact Supervisor: Yes.\nMy responsibilities were to assist public electronic filing programmers by analyzing, diagnosing and making proposals on error in software to\ngetting there software to passing the IRS standards for electronic filing.\nI did this by using IRS IRM and thereby have them transmit standard test returns then I would have to print out there transmitted test returns\nand analyses and determine where there programming error's \nwere and call them and \ncommunicate to them where the error occurred.\nThey would make the correction and it would be accepted as an Electronic Filing Software Program.\nI also work closely with the electronic filing Tax Examiners in assisting the transmitters in problem solving their situation.\nAnother responsibility I had was to have all of the data copied to a nine-track tape and processed on the mainframe computer from that\noutput then we had to drain the information on to an archival system that allowed the authorized I.R.S \nemployees to access the returns if a\ntaxpayer had questions about their returns.\nI also helped my group to maintain our network and desktop computers.\nThere were times we would lose connection to the network and we would have to use a network sniffer that would assist us on the type and\nlocation of the problem that needed to be fixed.\nI also would install updates to the workstations, as they became available to us thru download transmittal.\nJob Related Training:.\nItem Item Description \nCompletion Date.\nInformation Technology Specialist\n \n, \n01/2013\nWithin my first 7 years I was able to go from a GS 3 Clerk position to the level of Systems Administrator GS -12 I achieved was to set up a\nsingle sign on BAG group, single sign on to the IMM, from un-secure \nIMM Web page to a secure Web page and brought it current with the\nBig Fix patching.\nPersonal Interests: Riding Motorcycles, Walks, Hiking, riding bicycles, Camping, Spending quality time with family and friends Tracking the\nStock Market.\nEducation\nBS\n \n:\n \nSociology and Social Work Psychology\n \n,\n \n1983\n \nWeber State University\n \nSociology and Social Work Psychology My education background\nhas provided me with several abilities that has allowed for an easy transition to any job that I\nCultural Competence and Effective Communication \n04/06/16 27931 \"SKSIT Monitoring, Backups, and Recovery in Windows Server 2008\"\n03/02/16 31818 SKSIT Software Updates and Compliance Management in \nMicrosoft Windows Server 2008\n \n:\n \n02/17/16\nSKSIT Patch Management and Securing and Monitoring Servers in Windows Server 2008 \n12/18/15 36545 SKSBS IT Project Management\nEssentials: Monitoring and Controlling IT Projects \n12/11/15 36544 SKSBS IT Project Management Essentials: Executing IT Projects \n12/11/15\n36543 SKSBS IT Project Management Essentials: Initiating and Planning IT Projects 12/11/15 36546 SKSBS IT Project Management\nEssentials: Managing Risks in an IT Project 12/11/15 36541 SKSBS IT Project Management Essentials: Introduction to IT Project Management\n12/10/15 27225 SKSBS Troubleshooting and Closing the Project \n12/10/15 60476 SKS-LLPKG PM Lite - A Blended Approach \n12/10/15\n27236 SKSBS Managing a Project \n12/09/15 27234 SKSBS Transitioning into a Project Management Role \n11/27/15 27233 SKSBS Project\nManagement Fundamentals \n11/13/15 27235 SKSBS Initiating and Planning a Project \n11/12/15 31813 SKSIT Windows Server 2008 Backup\nand Recovery \n11/10/15 31586 SKSIT Setting up and Securing Windows 7 \n01/14/15 57785 PSTR - FISMA Continuous Monitoring - ASCA\nTraining \n01/07/15 43943 SKSIT SSCP Domain: Malicious Code \n10/16/14 23279 Configuration Management (CM) Overview (CBT) \n01/07/14\n43161 Change Management Process Overview \n01/07/14 31813 SKSIT Windows Server 2008 Backup and Recovery \n12/10/13 53407 SKSIT\nCisco IINS 2.0: VPN Technologies and Public Key Infrastructure \n12/06/13 23796 SKSIT Intrusion Detection and Response in Networked\nEnvironments \n12/05/13 23464 SKSIT 3G Communication Systems \n11/23/12\nSkills\nComputers trouble shooting Microsoft Access Microsoft Excel Microsoft PowerPoint Microsoft Word Computer Security Anti Hacking \nHIDS\nMicrosoft Event logging Adobe\nAdditional Information\nAwards or recognitions Performance Award August 2013 Performance Award August 2012 Performance Award August 2011\nPerformance Award August 2010 Performance Award August 2009 Performance Award August 2008 Special Act award April 2008",
  "processed": {
    "clean_text": "system administrator experience 03/2009 company name 21674 sksit security and the wireless environment 11/05/12 18640 sksit securing wlans 10/30/12 27481 sksit building and securing voip networks 03/20/12 36542 sksit protecting windows 7 against malware and vulnerabilities 03/13/12 30688 sksit physical security 02/03/12 14766 sksit firewalls and vpns 01/23/12 34601 kisam service manager (sm) overview 09/27/11 31699 adding of assets in kisam asset manager 09/26/11 31856 windows server 2008 system administration 04/01/11 28902 stan - security configurations for windows 2003 servers 01/31/11 28801 eops test planning procedures os, databases and cots 01/20/11 14763 sksit (ans) encryption technologies 04/09/10 23796 sksit intrusion detection and response in networked environments 03/22/10 21797 sksit introducing voice over ip 04/15/09 21674 sksit security and the wireless environment 04/14/09 17090 sksit wireless communication basics 04/10/09 17623 sksit auditing and monitoring 05/01/08 21597 sksit (ans) the fundamentals of networking 04/25/08 18287 sksit itil: problem and change management 04/24/08 18054 karta introduction to the certification  accreditation process 04/12/07 18064 karta information security awareness - beginner 04/11/07 13085 sksbs building relationships to get results 08/03/06 14115 sksit internet security: firewall principles 08/02/06 14025 sksit cisco routers, firewalls, and perimeter security 07/31/06 14780 sksit wireless security 07/31/06 15248 windows server 2003 active directory services 04/07/06 17633 sksit malicious code 03/24/06 18035 karta technical controls 03/23/06 18041 karta risk management 03/22/06 18034 karta operational controls 03/17/06 18004 karta principles of operating systems security 03/17/06 18033 karta management controls 03/16/06 17996 karta it security awareness - intermediate 03/15/06 18076 karta fisma: establishing security metrics 03/14/06 18064 karta information security awareness - beginner 03/14/06 18060 karta implementing physical security 03/14/06 15225 firewalls and internet security 12/16/05. system administrator , 07/2005 to current company name hours per week: 40  ogden, ut 84201 series: 2210 pay plan: gs grade: 12 information technology computer (this is a federal job) supervisor peter c morgan 304-264-5413 may contact supervisor: yes as the 12 computer systems administrator the eops-ecc- wssb-bss-cis group, my job function is varied and requires multi-tasking as a standard. i have acted as the cis section supervisor. i am a trainer for new employees coming into the group on details and 4 new permanent employees into the cis group. i am required a basic working understanding of 7 projects and to be able to step in for other sas at a moments notice of well over 500 servers. the work involves analyzing customer requirements, developing specifications for new or modified systems, planning and coordinating the design, development, testing, installation, and support of new and modified systems, including hardware and software, and serving as the primary liaison with customer organizations on all it-related matters. the work may involve developing and presenting training on the operation and maintenance of new systems to the irs it staff including it specialists in other specialty areas, to insure that new systems are properly managed. the employee may adapt and implement systems diagnostic and maintenance tools to ensure the availability and functionality of systems required to support organizational objectives and evaluate and recommend selection of new systems diagnostic tools. this work affects the availability of irs it systems needed to meets the mission requirements. regular contacts include employees in the same or related units, employees and managers within irs and contractors/vendors at several levels of the agency (campuses, headquarters or field offices); and individuals or groups from outside the agency, including consultants, contractors, vendors, or representatives of professional. my main duties are to maintain servers operation, security, and analyze and diagnose system hardware and software components. i also write up problem tickets with servers hardware and software and get clearance for vendors to have access to the servers for hardware repair as well as scheduling times with local i.r.s. personal and vendor to accomplish the repairs. i make sure when new server are to be put on the domain i do all of the appropriate paper work which includes requesting uwrs, kisam asset management to include all of the new servers information from serial numbers, bar code, make, model and location just to name few of them. i also file out the server compliance checklist, software license forms. in addition, i image or re-image server with the proper windows operating system and software needed to run the server e.g. contact recording, contact analytics, tos, rts among other servers. i also monitor and respond to kisam tickets i also monitor hids, symantec anti-virus programs are up to date and operational. insure all microsoft windows patches are installed on servers. i make sure altiris is installed and the endpoint is healthy and if not i make the necessary corrections. i run windows policy checker to insure the server stays with irs and cyber security compliance. if there are any that is not in compliance, i make the necessary changes to bring them back into compliance. i create documents in word and power point in referencing to problems that i have encountered during trouble shooting a situation for others in my group in case they have similar situations or problems and put them in our group shared location on the network for all to read. i also have done short training on things that i have encountered or i had more knowledge than others in my group via osc in sharing on my conference calls. tpf operations server (tos) i am the main system administrator and my accomplishments that i achieved was to set up a single sign on bag group, single sign on to the imm, from un-secure imm web page to a secure web page and brought it current with the big fix patching. installing and maintaining software and hardware, controlling current versions in use and future release of application software, and documenting the physical configuration of the system. optimizing the functionality of servers systems using performance tuning tools and techniques. analyze and diagnosing and recovering failed systems using systems diagnosis tools and fault identification techniques. planning and coordinating the installation of new products or equipment, resolving installation problems, identifying and mitigating security vulnerabilities and risks, and maintaining server integrity and availability. initiating corrective or preventive actions, such as increasing disk or memory capacity to improve system performance. 01/1989 to 04/2007 company name hours per week: 40  ogden, ut 84201 series:2210 pay plan: gs grade: information technology computer system administrator (this is a federal job) supervisor sandy spiers (801-620-4555) may contact supervisor: yes. my responsibilities were to assist public electronic filing programmers by analyzing, diagnosing and making proposals on error in software to getting there software to passing the irs standards for electronic filing. i did this by using irs irm and thereby have them transmit standard test returns then i would have to print out there transmitted test returns and analyses and determine where there programming errors were and call them and communicate to them where the error occurred. they would make the correction and it would be accepted as an electronic filing software program. i also work closely with the electronic filing tax examiners in assisting the transmitters in problem solving their situation. another responsibility i had was to have all of the data copied to a nine-track tape and processed on the mainframe computer from that output then we had to drain the information on to an archival system that allowed the authorized i.r.s employees to access the returns if a taxpayer had questions about their returns. i also helped my group to maintain our network and desktop computers. there were times we would lose connection to the network and we would have to use a network sniffer that would assist us on the type and location of the problem that needed to be fixed. i also would install updates to the workstations, as they became available to us thru download transmittal. job related training:. item item description completion date. information technology specialist , 01/2013 within my first 7 years i was able to go from a gs 3 clerk position to the level of systems administrator gs -12 i achieved was to set up a single sign on bag group, single sign on to the imm, from un-secure imm web page to a secure web page and brought it current with the big fix patching. personal interests: riding motorcycles, walks, hiking, riding bicycles, camping, spending quality time with family and friends tracking the stock market. education bs : sociology and social work psychology , 1983 weber state university sociology and social work psychology my education background has provided me with several abilities that has allowed for an easy transition to any job that i cultural competence and effective communication 04/06/16 27931 sksit monitoring, backups, and recovery in windows server 2008 03/02/16 31818 sksit software updates and compliance management in microsoft windows server 2008 : 02/17/16 sksit patch management and securing and monitoring servers in windows server 2008 12/18/15 36545 sksbs it project management essentials: monitoring and controlling it projects 12/11/15 36544 sksbs it project management essentials: executing it projects 12/11/15 36543 sksbs it project management essentials: initiating and planning it projects 12/11/15 36546 sksbs it project management essentials: managing risks in an it project 12/11/15 36541 sksbs it project management essentials: introduction to it project management 12/10/15 27225 sksbs troubleshooting and closing the project 12/10/15 60476 sks-llpkg pm lite - a blended approach 12/10/15 27236 sksbs managing a project 12/09/15 27234 sksbs transitioning into a project management role 11/27/15 27233 sksbs project management fundamentals 11/13/15 27235 sksbs initiating and planning a project 11/12/15 31813 sksit windows server 2008 backup and recovery 11/10/15 31586 sksit setting up and securing windows 7 01/14/15 57785 pstr - fisma continuous monitoring - asca training 01/07/15 43943 sksit sscp domain: malicious code 10/16/14 23279 configuration management (cm) overview (cbt) 01/07/14 43161 change management process overview 01/07/14 31813 sksit windows server 2008 backup and recovery 12/10/13 53407 sksit cisco iins 2.0: vpn technologies and public key infrastructure 12/06/13 23796 sksit intrusion detection and response in networked environments 12/05/13 23464 sksit 3g communication systems 11/23/12 skills computers trouble shooting microsoft access microsoft excel microsoft powerpoint microsoft word computer security anti hacking hids microsoft event logging adobe additional information awards or recognitions performance award august 2013 performance award august 2012 performance award august 2011 performance award august 2010 performance award august 2009 performance award august 2008 special act award april 2008",
    "metadata": {
      "phones": [
        "304-264-5413",
        "801-620-4555"
      ],
      "has_education": true
    },
    "sections": {},
    "keywords": [
      "sksit",
      "system",
      "server",
      "security",
      "management",
      "project",
      "window",
      "karta",
      "sksbs",
      "software",
      "group",
      "new",
      "2008",
      "information",
      "also",
      "performance",
      "award",
      "problem",
      "computer",
      "work",
      "microsoft",
      "would",
      "administrator",
      "employee",
      "irs",
      "make",
      "august",
      "network",
      "planning",
      "technology"
    ]
  },
  "file_path": "/Users/proxim/Desktop/Automated-First-Screener-and-AI-Job-Matching-NLP-WebEngine/data/raw/resumes/rcc62c.pdf"
}