{
  "id": "rd0d78",
  "filename": "18187364.pdf",
  "upload_time": "17:35:24",
  "document_type": "resume",
  "original_text": "INFORMATION TECHNOLOGY SPECIALIST INFORMATION SECURITY OFFICER\nProfile\nblah, blah\nCore Qualifications\nOracle Certified Professional (OCP), versions 8.0, 8i, 9i, 10g, 11g\nCertified Information Systems Security Professional (CISSP) (ISC)2\nCertified Information Security Manager (CISM) ISACA\nUNIX/LINUX\nStrong collaborative skills\nPatch management\nDatabase servers\nProfessional Experience\nInformation Technology Specialist Information Security Officer\n \nOctober 2010\n \nto \nJuly 2015\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nInstalling and configuring Oracle software versions 10g-12c.\nScripting maintenance and monitoring tools.\nCreating Risk Assessment template based on NIST 800-30R1 to facilitate and evaluate secure software development practice.\nBuilding automated database risk/security models for quantifying degrees of database risk and enabling the standardization and prioritization\nof remediation efforts.\nManaging/mentoring support staff and participating in 24X7 production support and security monitoring rotation for large scale, mission\ncritical applications.\nDeveloping, implementing and supporting enterprise backup and recovery, change control, security and audit procedures.\nPerforming database, server and application performance and security monitoring and tuning.\nImplementing vendor and customized database auditing and analysis packages.\nDevelop pattern recognition triggers for Anti-Money laundering systems.\nWorking closely with Corporate Security to ensure that application and database server procedures and controls support all government\nregulations and corporate policies.\nDesigning and implementing least-privilege database administration model and application development templates.\nProviding support and guidance for the modeling, development and testing of enterprise applications to ensure that applications are secure,\nhighly available and fully meet the needs of our end user communities.\nDevelop ITS Enterprise Database installation, configuration, monitoring and security standards and procedures.\nTrain other Database Administrators in security best practices, change control, monitoring, account management and role-based user\nadministration.\nCreate and configure security templates for Oracle Enterprise Manager.\nAct as bureau security liaison and represented database security at conferences and meetings.\nDevelop and implement database security policies and procedures.\nCreate comprehensive and cross-referenced database security benchmark utilizing the CIS Oracle Security Benchmark, NIST and DoD.\nManaged IBM engagement for Guardium from proof of concept to procurement.\nProvide remediation roadmap for database and application security issues.\nIdentify and analyze data access rights that violate state law and memoranda of understanding.\nReplace manual terminal service audit reports with secure self-service, repeatable and audited process using PL/SQL and COGNOS.\nVice President\n \nApril 2002\n \nto \nSeptember 2010\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nPerform database penetration testing and regular server and database scanning for security vulnerabilities and compromised passwords.\nTechnical lead for database consolidation, backup software replacement, PeopleSoft upgrade and Anti-Money Laundering projects.\nResponsible for operational aspects of Oracle database administration activities including capacity planning, installation and configuration of\nthe Oracle RDBMS, Grid Control and ASM software, patches and supporting products, backup & recovery, database tuning, monitoring\nand troubleshooting utilizing TKPROF, OEM, STATSPACK, DBArtisan, Tivoli and custom SQL, PL/SQL and UNIX shell scripts.\nPlan and manage multi-location disaster recovery exercises.\nProvide operational 24X7 support of all corporate Oracle systems (341 databases, 65 servers, 5 versions of Oracle and 5 operating\nsystems).\nDeveloped and implemented procedures that reduced in-house database problem tickets by 60%, job failures by 80% and on-call support\nissues by 80%.\nCreated enterprise wide capacity planning, troubleshooting and performance monitoring models.\nCoordinated and supported application development, testing and performance improvement efforts including data model revisions, SQL\ntuning and client configurations.\nInstituted a series of workshops, classes and training programs for developers to expand their knowledge and understanding of SQL,\nOracle and data security.\nThis group is now self-sufficient.\nPerformed block-level data recovery that Oracle Corporation said was not possible, saving critical business data and minimizing impact to\nbusiness functions.\nDatabase Manager\n \n\nFebruary 2000\n \nto \nApril 2002\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nCreated and supported multi-instance spatial environments for internet startup company.\nGathered user requirements and designed and built logical and physical database structures.\nManaged Unix server farm to ensure proper sizing, organization, and recoverability.\nWrote PL/SQL, SQLLoader and custom routines to load and integrate data from various outside sources and to enforce data security,\nreliability and integrity.\nMonitored shared system resources and recommend improvements to application development staff.\nWrote database-monitoring scripts used to page DBA in the event of database problems.\nAutomated DBA functions for table restructuring, statistics, space management and backup.\nSenior Database Administrator\n \nJanuary 1999\n \nto \nFebruary 2000\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nTechnical liaison and support manager for international leasing company.\nTraveled abroad as needed.\nParticipated in due diligence audits of takeover candidate companies.\nWrote Oracle installation and configuration standards for Windows NT and UNIX.\nCreated DBA practice lab and developed practice lab exercises for other DBA staff to learn backup and recovery software.\nWorked closely with various vendors and development groups to improve application reliability and performance.\nDeveloped a Capability Maturity Model and created CMM training program for database administration.\nProvided 24X7support of international commercial leasing applications.\nSystem Staff Specialist/Database Administrator\n \nDecember 1997\n \nto \nJanuary 1999\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nDBA for telesales, signature verification, and electronic payment systems.\nParticipated in off-site disaster recovery exercises.\nReviewed schema, tuned queries and managed change control process.\nDeveloped Cost Based SQL Standards and trained development staff on SQL tuning.\nProvided database design consultation to other projects.\nDeveloped database installation and administration guidelines.\nSenior Database Administrator\n \nJune 1997\n \nto \nDecember 1997\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nConverted document management system from Sybase to Oracle.\nMentored and trained Oracle database administrators at client sites.\nMonitored and tuned Oracle system and applications to prevent resource shortages and shorten the execution time of long-running queries.\nConducted training in database concepts and SQL.\nDatabase Administrator\n \nSeptember 1996\n \nto \nJune 1997\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nImplemented and maintained critical high volume online and Internet server Oracle databases in UNIX environment.\nPerformed performance monitoring, capacity planning and application tuning.\nWorked closely with engineering consulting firm to trouble shoot database and applications, optimize system performance, ensure data\nintegrity and increase system reliability.\nWrote extensive SQL and PL/SQL programs to manage data and create ad hoc reports.\nDeveloped, implemented and enforced Oracle design and usage standards.\nAssociate Computer Programmer/Analyst\n \nJune 1991\n \nto \nSeptember 1996\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nTechnical lead responsible for Pavement and Bridge Management Systems development and production Oracle databases operating in\nclient/server environment.\nPrepared EDP sections of consulting contracts and budgets.\nManaging analyst for Pavement and Bridge Maintenance Systems jointly developed by Rensselaer Polytechnic Institute and the Thruway\nAuthority.\nDeveloped and maintained data standards and agency data dictionary system.\nEducation\nMaster of Science\n \n: \nManagement\n \nCollege of Saint Rose\n \nï¼​ \nCity\n \n, \nState\n \nManagement\nBachelor of Arts\n \n: \nMusic History\n \nCity\n \n, \nState\n \nMusic History\nSkills\naccount management, ad, analyst, application development, ASM, agency, audit reports, auditing, backup, budgets, c, Capability Maturity Model,\nCMM, capacity planning, client/server, COGNOS, concept, conferences, consultation, consulting, contracts, client, data dictionary system,\n\ndatabase and applications, database administration, DBA, databases, Database, database design, Designing, disaster recovery, document\nmanagement, due diligence, government regulations, IBM, Information Security, Information Systems, law, Managing, meetings, mentoring, access,\nMoney, Windows NT, modeling, Enterprise, operating systems, Oracle Enterprise Manager, Oracle, Oracle database, PL/SQL, page,\nPeopleSoft, policies, procurement, Oracle RDBMS, Risk Assessment, scanning, servers, scripts, Scripting, software development, SQL,\nSQLLoader, statistics, Sybase, Systems development, Tivoli, training programs, troubleshooting, UNIX, UNIX shell scripts, upgrade, workshops",
  "processed": {
    "clean_text": "information technology specialist information security officer profile blah, blah core qualifications oracle certified professional (ocp), versions 8.0, 8i, 9i, 10g, 11g certified information systems security professional (cissp) (isc)2 certified information security manager (cism) isaca unix/linux strong collaborative skills patch management database servers professional experience information technology specialist information security officer october 2010 to july 2015 company name ï¼ city , state installing and configuring oracle software versions 10g-12c. scripting maintenance and monitoring tools. creating risk assessment template based on nist 800-30r1 to facilitate and evaluate secure software development practice. building automated database risk/security models for quantifying degrees of database risk and enabling the standardization and prioritization of remediation efforts. managing/mentoring support staff and participating in 24x7 production support and security monitoring rotation for large scale, mission critical applications. developing, implementing and supporting enterprise backup and recovery, change control, security and audit procedures. performing database, server and application performance and security monitoring and tuning. implementing vendor and customized database auditing and analysis packages. develop pattern recognition triggers for anti-money laundering systems. working closely with corporate security to ensure that application and database server procedures and controls support all government regulations and corporate policies. designing and implementing least-privilege database administration model and application development templates. providing support and guidance for the modeling, development and testing of enterprise applications to ensure that applications are secure, highly available and fully meet the needs of our end user communities. develop its enterprise database installation, configuration, monitoring and security standards and procedures. train other database administrators in security best practices, change control, monitoring, account management and role-based user administration. create and configure security templates for oracle enterprise manager. act as bureau security liaison and represented database security at conferences and meetings. develop and implement database security policies and procedures. create comprehensive and cross-referenced database security benchmark utilizing the cis oracle security benchmark, nist and dod. managed ibm engagement for guardium from proof of concept to procurement. provide remediation roadmap for database and application security issues. identify and analyze data access rights that violate state law and memoranda of understanding. replace manual terminal service audit reports with secure self-service, repeatable and audited process using pl/sql and cognos. vice president april 2002 to september 2010 company name ï¼ city , state perform database penetration testing and regular server and database scanning for security vulnerabilities and compromised passwords. technical lead for database consolidation, backup software replacement, peoplesoft upgrade and anti-money laundering projects. responsible for operational aspects of oracle database administration activities including capacity planning, installation and configuration of the oracle rdbms, grid control and asm software, patches and supporting products, backup  recovery, database tuning, monitoring and troubleshooting utilizing tkprof, oem, statspack, dbartisan, tivoli and custom sql, pl/sql and unix shell scripts. plan and manage multi-location disaster recovery exercises. provide operational 24x7 support of all corporate oracle systems (341 databases, 65 servers, 5 versions of oracle and 5 operating systems). developed and implemented procedures that reduced in-house database problem tickets by 60, job failures by 80 and on-call support issues by 80. created enterprise wide capacity planning, troubleshooting and performance monitoring models. coordinated and supported application development, testing and performance improvement efforts including data model revisions, sql tuning and client configurations. instituted a series of workshops, classes and training programs for developers to expand their knowledge and understanding of sql, oracle and data security. this group is now self-sufficient. performed block-level data recovery that oracle corporation said was not possible, saving critical business data and minimizing impact to business functions. database manager february 2000 to april 2002 company name ï¼ city , state created and supported multi-instance spatial environments for internet startup company. gathered user requirements and designed and built logical and physical database structures. managed unix server farm to ensure proper sizing, organization, and recoverability. wrote pl/sql, sqlloader and custom routines to load and integrate data from various outside sources and to enforce data security, reliability and integrity. monitored shared system resources and recommend improvements to application development staff. wrote database-monitoring scripts used to page dba in the event of database problems. automated dba functions for table restructuring, statistics, space management and backup. senior database administrator january 1999 to february 2000 company name ï¼ city , state technical liaison and support manager for international leasing company. traveled abroad as needed. participated in due diligence audits of takeover candidate companies. wrote oracle installation and configuration standards for windows nt and unix. created dba practice lab and developed practice lab exercises for other dba staff to learn backup and recovery software. worked closely with various vendors and development groups to improve application reliability and performance. developed a capability maturity model and created cmm training program for database administration. provided 24x7support of international commercial leasing applications. system staff specialist/database administrator december 1997 to january 1999 company name ï¼ city , state dba for telesales, signature verification, and electronic payment systems. participated in off-site disaster recovery exercises. reviewed schema, tuned queries and managed change control process. developed cost based sql standards and trained development staff on sql tuning. provided database design consultation to other projects. developed database installation and administration guidelines. senior database administrator june 1997 to december 1997 company name ï¼ city , state converted document management system from sybase to oracle. mentored and trained oracle database administrators at client sites. monitored and tuned oracle system and applications to prevent resource shortages and shorten the execution time of long-running queries. conducted training in database concepts and sql. database administrator september 1996 to june 1997 company name ï¼ city , state implemented and maintained critical high volume online and internet server oracle databases in unix environment. performed performance monitoring, capacity planning and application tuning. worked closely with engineering consulting firm to trouble shoot database and applications, optimize system performance, ensure data integrity and increase system reliability. wrote extensive sql and pl/sql programs to manage data and create ad hoc reports. developed, implemented and enforced oracle design and usage standards. associate computer programmer/analyst june 1991 to september 1996 company name ï¼ city , state technical lead responsible for pavement and bridge management systems development and production oracle databases operating in client/server environment. prepared edp sections of consulting contracts and budgets. managing analyst for pavement and bridge maintenance systems jointly developed by rensselaer polytechnic institute and the thruway authority. developed and maintained data standards and agency data dictionary system. education master of science : management college of saint rose ï¼ city , state management bachelor of arts : music history city , state music history skills account management, ad, analyst, application development, asm, agency, audit reports, auditing, backup, budgets, c, capability maturity model, cmm, capacity planning, client/server, cognos, concept, conferences, consultation, consulting, contracts, client, data dictionary system, database and applications, database administration, dba, databases, database, database design, designing, disaster recovery, document management, due diligence, government regulations, ibm, information security, information systems, law, managing, meetings, mentoring, access, money, windows nt, modeling, enterprise, operating systems, oracle enterprise manager, oracle, oracle database, pl/sql, page, peoplesoft, policies, procurement, oracle rdbms, risk assessment, scanning, servers, scripts, scripting, software development, sql, sqlloader, statistics, sybase, systems development, tivoli, training programs, troubleshooting, unix, unix shell scripts, upgrade, workshops",
    "metadata": {
      "has_education": true
    },
    "sections": {},
    "keywords": [
      "database",
      "security",
      "oracle",
      "system",
      "application",
      "data",
      "company",
      "state",
      "development",
      "city",
      "management",
      "information",
      "server",
      "name",
      "monitoring",
      "sql",
      "developed",
      "support",
      "enterprise",
      "recovery",
      "software",
      "model",
      "backup",
      "performance",
      "administration",
      "administrator",
      "unix",
      "dba",
      "manager",
      "staff"
    ]
  },
  "file_path": "/Users/proxim/Desktop/Automated-First-Screener-and-AI-Job-Matching-NLP-WebEngine/data/raw/resumes/rd0d78.pdf"
}