{
  "id": "rd23b8",
  "filename": "68460556.pdf",
  "upload_time": "17:35:11",
  "document_type": "resume",
  "original_text": "INFORMATION TECHNOLOGY INTERN\nProfessional Profile\nTo obtain a full time in the Entry Level Information Technology Management field where I can utilize my education to contribute to company's\noperations and learning opportunities where I can maximize my skills, and advanced training development.\nQualifications\nMicrosoft Word, Power Point, and Excel\nExperience\n10/2014\n \nto \n05/2015\nCompany Name\n \nï¼​ \nCity\n \n, \nState\nProvided assistance to students with weak study areas.\nAnalyzed students in acquiring better understanding of specific weak areas within American Sign Language (ASL) courses.\nContributed students to improve their ASL receptive and expressive skills.\n06/2012\n \nto \n08/2012\nInformation Technology Intern\n \nCompany Name\n \nï¼​ \nCity\nParticipated in human and technology interaction management with supervisor.\nDeveloped an interface between website and databases via Excel that allowed House of Representatives and Senators more effective and\neasier access to information.\nCompleted several workshops and lectures about the history of the Library of Congress.\n02/2012\n \nto \n08/2012\nMedia Student Assistant\n \nCompany Name\n \nï¼​ \nCity\nSet up and maintained the Computer Aided Real-Time translation (CART) system in classrooms and various locations around campus,\nwhen needed.\nAssisted staff, faculty and students on a daily basis with equipment repairs, customer service and technology problems.\nVerified that each classroom had the appropriate equipment and technology needed for success daily.\nEducation\nDecember 2016\nInformation and Technology Management American Sign Language\n \nBloomsburg University of Pennsylvania\n \nï¼​ \nCity\n \n, \nState\n \nInformation and\nTechnology Management American Sign Language 3.35\nLanguages\nFluent in American Sign Language and English. Can navigate in multicultural situations.\nSkills\nAmerican Sign Language, Excellent communication, customer service, databases, English, access, Excel, Power Point, Microsoft Word, works,\nproblem solving skills, Real-Time, repairs, supervisor, translation, website, workshops\nAdditional Information\nAwards/Certificates: \n*Dean's list above 3.50 GPA \nSpring 2016 *Bloomsburg University Career Intensive Boot Camp \nSpring 2016\nActivities/Communities: \n*Chi Alpha Epsilon Honor Society \n2015 - 2016 *Delta Alpha Pi Honor Society \n2015 - 2016 *Phi Sigma Pi\nNational Honor Fraternity \n2015 - 2016 *Signify Club President \n2015 - 2016 *Delta Sigma Phi Fraternity Brother \n2012",
  "processed": {
    "clean_text": "information technology intern professional profile to obtain a full time in the entry level information technology management field where i can utilize my education to contribute to companys operations and learning opportunities where i can maximize my skills, and advanced training development. qualifications microsoft word, power point, and excel experience 10/2014 to 05/2015 company name ï¼ city , state provided assistance to students with weak study areas. analyzed students in acquiring better understanding of specific weak areas within american sign language (asl) courses. contributed students to improve their asl receptive and expressive skills. 06/2012 to 08/2012 information technology intern company name ï¼ city participated in human and technology interaction management with supervisor. developed an interface between website and databases via excel that allowed house of representatives and senators more effective and easier access to information. completed several workshops and lectures about the history of the library of congress. 02/2012 to 08/2012 media student assistant company name ï¼ city set up and maintained the computer aided real-time translation (cart) system in classrooms and various locations around campus, when needed. assisted staff, faculty and students on a daily basis with equipment repairs, customer service and technology problems. verified that each classroom had the appropriate equipment and technology needed for success daily. education december 2016 information and technology management american sign language bloomsburg university of pennsylvania ï¼ city , state information and technology management american sign language 3.35 languages fluent in american sign language and english. can navigate in multicultural situations. skills american sign language, excellent communication, customer service, databases, english, access, excel, power point, microsoft word, works, problem solving skills, real-time, repairs, supervisor, translation, website, workshops additional information awards/certificates: deans list above 3.50 gpa spring 2016 bloomsburg university career intensive boot camp spring 2016 activities/communities: chi alpha epsilon honor society 2015 - 2016 delta alpha pi honor society 2015 - 2016 phi sigma pi national honor fraternity 2015 - 2016 signify club president 2015 - 2016 delta sigma phi fraternity brother 2012",
    "metadata": {
      "has_education": true
    },
    "sections": {},
    "keywords": [
      "technology",
      "information",
      "2016",
      "language",
      "student",
      "american",
      "sign",
      "management",
      "company",
      "skill",
      "city",
      "2015",
      "excel",
      "name",
      "honor",
      "intern",
      "education",
      "microsoft",
      "word",
      "power",
      "point",
      "state",
      "weak",
      "area",
      "asl",
      "08/2012",
      "supervisor",
      "website",
      "database",
      "access"
    ]
  },
  "file_path": "/Users/proxim/Desktop/Automated-First-Screener-and-AI-Job-Matching-NLP-WebEngine/data/raw/resumes/rd23b8.pdf"
}