{
  "id": "rdaa7a",
  "filename": "25207620.pdf",
  "upload_time": "17:35:19",
  "document_type": "resume",
  "original_text": "INFORMATION TECHNOLOGY CERTIFIED TECHNICIAN\nSummary\nOver Nineteen years of experience in Information Technology.Information Technology professional with well-developed interpersonal,\ncommunication, organizational and presentation skills. \nSolutions-focused, team oriented Senior Technical Support Analyst with broad-based\nexperience and hands-on skills in the successful implementation of highly effective desktop support operations. A broad understanding of computer\nhardware and software, including installation, configuration, management, trouble-shooting, and support. Extensive experience with HP products to\ninclude Desktop, Laptop, high-end MFP devices and Web JetAdmin, Areas of direct expertise include Project Coordination & Design, In-depth\nTechnical Support, Corporate Desktop Support, Microsoft OS experience including installations-configuration-imaging, migration, and registry\nediting. Network and Citrix experience. Recommendations listed on \nRoz Arasmo - Estee Lauder Companies, Inc., Human Resources\nAdministrator It is with great pleasure do I take this opportunity to write this recommendation on such an extra ordinary individual who is not only\nan awesome person to know but a wonderful colleague as well. During the almost ten (10) years of knowing Bill, he has not only displayed a great\ntalent within the IT organization at Estee Lauder, but has distributed excellent skills and customer service to everyone throughout the company. He\nis extremely well thought of from every level of management to Senior management. His dedication and diligent to excellence has proven superior\ntime and time again. When called upon he demonstrates top support in a timely and professional manner not to mention that he completes his tasks\nthoroughly with accuracy never having to be called back again for the same issue. \nWe have been privileged to have such an awesome professional\nwithin our organization. ____________________________________________________________________________________________\nLorilee Dickson - Director, Change Management and Communications at Estee Lauder Bill is a diligent and hard-working professional with\nexcellent customer service skills and exceptional knowledge of the IT industry. Each time I requested support, he was quick to respond and\ncompleted each request completely and with urgency. His thorough approach and attention to detail are an added bonus to the computer support\nhe provides on a regular basis.\nSkills\nyears' experience) Security+ (Intermediate, 12 years' experience) Customer Service (Expert, 20+ years' experience) Networking (Intermediate,\n10 years' experience) Internet Explorer Symantec Antivirus (Intermediate, 9 years' experience) Windows 7 (Intermediate, 2 years' experience)\nSeries 7 (Beginner, 20+ years' experience) XP (Advanced, 6 years' experience) DOS (Intermediate, 20+ years' experience) Windows 8.1 (3\nyears 'experience), IP Mac OS (Beginner, 2 years' experience) iPhone (Intermediate, 2 years' experience) iPad (Intermediate, 2 years'\nexperience) User Interface Writing (Intermediate, 12 years' experience) Troubleshooting (Advanced, 20+ years' experience), \nIT Operations\n(Intermediate, 8 years' experience)\nAccomplishments\nJose Miguel Morales - \nVP Security Engineering \nJanuary 24, 2003 \nTo Whom It May Concern, \nThe intent of this letter is to express my\nprofessional regards for Mr.\nWilliam Hale.\nI have known Mr.\nHale for over \na year in \nacademic milieu.\nDuring this period I have had the pleasure of being associated with one of the finest people that anyone \ncould ever come in contact with.\nWilliam's technical and professional prowess has accorded him the highest regards from his peers.\nHe has a thorough \nunderstanding of the job requirements and how to accomplish corporate goals without sacrificing individual creativity.\nWilliam is not only a success in his career, but is always interested in the betterment of his fellow man.\nI have observed him many times in the process of accomplishing things that truly are representative of a person with a strong \nfamily and\nmoral convictions.\nWilliam is a man that can wear many hats, and his humbleness allows him to be a good server, \nand at times adapt to the position of a leader.\nI am deeply impressed by Mr.\nHale and recommend him unhesitatingly.\nI am confident that, if selected for your vacancy, he \nwould provide the same high level of service and commitment.\nSincerely \nYours, \nJose' M.\nMorales \n[Electronic Signature] \nJose Miguel Morales, VP Security Engineering \nhttp://www.semperfiglobal.com.\nExperience\nInformation Technology Certified Technician\n \n03/2010\n \nï¼​ \nCurrent\n \nCompany Name\nDesktop support, software/hardware installations and configurations for Manhattan area.\nSenior Technical Support Technician\n \n01/2006\n \nï¼​ \n01/2011\n \nCompany Name\nSenior Desktop Support Analyst\nresponsible for software & hardware assets for company.\nDedicated technician to 500+ end users.\nSenior Technician for SAP Project 2006-2010.\nEducation and Training\n2017\n \nComputer Career College - \nMCSE,CNA, A+,CNA, Information Technology\n \n:\n \nCity University of New York - CIS\n \n- \nComputer and\nInformation Systems Security / Information Assurance\n \nComputer and Information Systems Security / Information Assurance\n1987\n \nRollins College\n \n- \nFinance\n \nFinance\n1962\n \nCertifications MCSE, MCP, CNA, Comptia A+, A+Network, A+ Security, HIPPA, Series 7,63,24 Microsoft, Comptia, Novell, \nSEC\nSeries 7,63,24\n \n:\n \nHofstra College\n \n- \nBusiness Administration\n \nBusiness Administration\nCertifications\n\nTechnical Support (Advanced, 20+ years' experience) Training (Advanced, 15 years' experience) Microsoft Office (Advanced, 11 years'\nexperience) Hardware Support (Advanced, 20+ years' experience) Hardware Diagnostics (Advanced, 20+ years' experience) Hardware\nInstallation (Advanced, 20+ years' experience) Software Documentation (Advanced, 10 years' experience) Enterprise Software Organization\n(Intermediate) CompTIA A+ Certification (Advanced, 12\nSkills\nA+, A+ Certification, Antivirus, CNA, Hardware, Hardware Installation, Customer Service, DOS, Hardware Support, Information Technology,\nInternet Explorer, IP, Mac OS, MCP, MCSE, Microsoft Office, Windows 7, Windows 8.1, Enterprise, Network, Networking, Novell, SAP,\nSoftware Documentation, Symantec, Desktop support, Technical Support, Technician, Troubleshooting, User Interface",
  "processed": {
    "clean_text": "information technology certified technician summary over nineteen years of experience in information technology.information technology professional with well-developed interpersonal, communication, organizational and presentation skills. solutions-focused, team oriented senior technical support analyst with broad-based experience and hands-on skills in the successful implementation of highly effective desktop support operations. a broad understanding of computer hardware and software, including installation, configuration, management, trouble-shooting, and support. extensive experience with hp products to include desktop, laptop, high-end mfp devices and web jetadmin, areas of direct expertise include project coordination  design, in-depth technical support, corporate desktop support, microsoft os experience including installations-configuration-imaging, migration, and registry editing. network and citrix experience. recommendations listed on roz arasmo - estee lauder companies, inc., human resources administrator it is with great pleasure do i take this opportunity to write this recommendation on such an extra ordinary individual who is not only an awesome person to know but a wonderful colleague as well. during the almost ten (10) years of knowing bill, he has not only displayed a great talent within the it organization at estee lauder, but has distributed excellent skills and customer service to everyone throughout the company. he is extremely well thought of from every level of management to senior management. his dedication and diligent to excellence has proven superior time and time again. when called upon he demonstrates top support in a timely and professional manner not to mention that he completes his tasks thoroughly with accuracy never having to be called back again for the same issue. we have been privileged to have such an awesome professional within our organization. ____________________________________________________________________________________________ lorilee dickson - director, change management and communications at estee lauder bill is a diligent and hard-working professional with excellent customer service skills and exceptional knowledge of the it industry. each time i requested support, he was quick to respond and completed each request completely and with urgency. his thorough approach and attention to detail are an added bonus to the computer support he provides on a regular basis. skills years experience) security (intermediate, 12 years experience) customer service (expert, 20 years experience) networking (intermediate, 10 years experience) internet explorer symantec antivirus (intermediate, 9 years experience) windows 7 (intermediate, 2 years experience) series 7 (beginner, 20 years experience) xp (advanced, 6 years experience) dos (intermediate, 20 years experience) windows 8.1 (3 years experience), ip mac os (beginner, 2 years experience) iphone (intermediate, 2 years experience) ipad (intermediate, 2 years experience) user interface writing (intermediate, 12 years experience) troubleshooting (advanced, 20 years experience), it operations (intermediate, 8 years experience) accomplishments jose miguel morales - vp security engineering january 24, 2003 to whom it may concern, the intent of this letter is to express my professional regards for mr. william hale. i have known mr. hale for over a year in academic milieu. during this period i have had the pleasure of being associated with one of the finest people that anyone could ever come in contact with. williams technical and professional prowess has accorded him the highest regards from his peers. he has a thorough understanding of the job requirements and how to accomplish corporate goals without sacrificing individual creativity. william is not only a success in his career, but is always interested in the betterment of his fellow man. i have observed him many times in the process of accomplishing things that truly are representative of a person with a strong family and moral convictions. william is a man that can wear many hats, and his humbleness allows him to be a good server, and at times adapt to the position of a leader. i am deeply impressed by mr. hale and recommend him unhesitatingly. i am confident that, if selected for your vacancy, he would provide the same high level of service and commitment. sincerely yours, jose m. morales [electronic signature] jose miguel morales, vp security engineering http://www.semperfiglobal.com. experience information technology certified technician 03/2010 ï¼ current company name desktop support, software/hardware installations and configurations for manhattan area. senior technical support technician 01/2006 ï¼ 01/2011 company name senior desktop support analyst responsible for software  hardware assets for company. dedicated technician to 500 end users. senior technician for sap project 2006-2010. education and training 2017 computer career college - mcse,cna, a,cna, information technology : city university of new york - cis - computer and information systems security / information assurance computer and information systems security / information assurance 1987 rollins college - finance finance 1962 certifications mcse, mcp, cna, comptia a, anetwork, a security, hippa, series 7,63,24 microsoft, comptia, novell, sec series 7,63,24 : hofstra college - business administration business administration certifications technical support (advanced, 20 years experience) training (advanced, 15 years experience) microsoft office (advanced, 11 years experience) hardware support (advanced, 20 years experience) hardware diagnostics (advanced, 20 years experience) hardware installation (advanced, 20 years experience) software documentation (advanced, 10 years experience) enterprise software organization (intermediate) comptia a certification (advanced, 12 skills a, a certification, antivirus, cna, hardware, hardware installation, customer service, dos, hardware support, information technology, internet explorer, ip, mac os, mcp, mcse, microsoft office, windows 7, windows 8.1, enterprise, network, networking, novell, sap, software documentation, symantec, desktop support, technical support, technician, troubleshooting, user interface",
    "metadata": {
      "urls": [
        "http://www.semperfiglobal.com."
      ],
      "has_education": true,
      "years_experience": 12
    },
    "sections": {},
    "keywords": [
      "experience",
      "year",
      "support",
      "intermediate",
      "advanced",
      "information",
      "hardware",
      "technician",
      "professional",
      "skill",
      "technical",
      "desktop",
      "security",
      "technology",
      "senior",
      "computer",
      "software",
      "company",
      "service",
      "time",
      "installation",
      "management",
      "microsoft",
      "customer",
      "window",
      "cna",
      "certification",
      "estee",
      "lauder",
      "organization"
    ]
  },
  "file_path": "/Users/proxim/Desktop/Automated-First-Screener-and-AI-Job-Matching-NLP-WebEngine/data/raw/resumes/rdaa7a.pdf"
}