{
  "id": "rdbe92",
  "filename": "64017585.pdf",
  "upload_time": "17:35:11",
  "document_type": "resume",
  "original_text": "INFORMATION TECHNOLOGY CONSULTANT, MANAGING MEMBER\nSummary\nA versatile, analytic IT Specialist with a proven record of success within large institutions as well as entrepreneurial organizations. Thrives on\nchallenge and solves problems with creativity and persistence. A data-driven team leader skilled in both producing and communicating results.\nExperience\nInformation Technology Consultant, Managing Member\n \nJanuary 2017\n \nto \nCurrent\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nWorked with product designers and product managers to design user interactions in applications.\nEnvisioned inspired new products, features and flows.Â \nAnswered user inquiries regarding computer software and hardware operation.\nInstalled and performed repairs to hardware, software and peripheral equipment, following design and installation specifications.\nSet up equipment for employee use.Â \nConducted computer diagnostics to investigate and resolve problems and provide technical assistance and support.\nChief Technology Officer, Partner\n \nAugust 2015\n \nto \nJanuary 2017\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nSuccessfully re-branded established dealership, launched new eCommerce website, added six new lines of vehicles, and created new\ncustomer engagement strategies.\nDeveloped sales and marketing strategy and directly managed over 15 full-time and part-time staff.\nStreamlined processes in Sales and Service departments using new technology.\nManaged legal and security policies such as loss prevention and DMV compliance.\nNegotiated and secured corporate partnerships, including vehicle and trailer maintenance for FreshDirect.com's same-day product\n(FoodKick).Â \nCTO, Partner\n \nMay 2012\n \nto \nAugust 2015\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nProvided IT solutions targeting small andÂ medium sizeÂ businesses in the New York metro area.Â \nSolutions toÂ include:Â Infrastructure/ Network design andÂ impletation,Â server basedÂ technologies and remote support services.\nClients included: Bronx Museum of Arts, Cava Construction, Leftfield Pictures.\nIT Manager\n \nAugust 2010\n \nto \nMay 2012\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nManaged a staff of ten IT support staff, which provided support for all users employed within Ogilvy North American offices.\nConstantly \ndeveloping new standards and IT policy's to improve support reaction time.\nKey Accomplishment: Lead architect for migrating all Lotus \nNotes and MS Exchange users to Cloud (Google) Mail.\nGathered and analyzed performance metric data.Â \nEducation and Training\nBS\n \n: \nPrint Production, Graphic Design Computer Science\n \n, \n1993\n \nSt. John's University\n \nPrint Production, Graphic Design Computer Science\nTechnical Skills\nActive Directory, premiere, ads, Advertising, IBM AIX, Apple, architect, Arts, catalog, color, com, Clients, digital photography, digital video,\ndirect mail, disaster recovery, eCommerce, Final \nCut Pro, SGI Irix, IT support, legal, Linux, Logic, loss prevention, Lotus \nNotes, marketing\nstrategy, Marketing, Microsoft Exchange, MS Exchange, Mail, Network design, network, newspaper, policies, Prepress, print \nadvertising, print\nproduction, processes, Sales, upgrading, video post production, website",
  "processed": {
    "clean_text": "information technology consultant, managing member summary a versatile, analytic it specialist with a proven record of success within large institutions as well as entrepreneurial organizations. thrives on challenge and solves problems with creativity and persistence. a data-driven team leader skilled in both producing and communicating results. experience information technology consultant, managing member january 2017 to current company name ï¼ city , state worked with product designers and product managers to design user interactions in applications. envisioned inspired new products, features and flows.â answered user inquiries regarding computer software and hardware operation. installed and performed repairs to hardware, software and peripheral equipment, following design and installation specifications. set up equipment for employee use.â conducted computer diagnostics to investigate and resolve problems and provide technical assistance and support. chief technology officer, partner august 2015 to january 2017 company name ï¼ city , state successfully re-branded established dealership, launched new ecommerce website, added six new lines of vehicles, and created new customer engagement strategies. developed sales and marketing strategy and directly managed over 15 full-time and part-time staff. streamlined processes in sales and service departments using new technology. managed legal and security policies such as loss prevention and dmv compliance. negotiated and secured corporate partnerships, including vehicle and trailer maintenance for freshdirect.coms same-day product (foodkick).â cto, partner may 2012 to august 2015 company name ï¼ city , state provided it solutions targeting small andâ medium sizeâ businesses in the new york metro area.â solutions toâ include:â infrastructure/ network design andâ impletation,â server basedâ technologies and remote support services. clients included: bronx museum of arts, cava construction, leftfield pictures. it manager august 2010 to may 2012 company name ï¼ city , state managed a staff of ten it support staff, which provided support for all users employed within ogilvy north american offices. constantly developing new standards and it policys to improve support reaction time. key accomplishment: lead architect for migrating all lotus notes and ms exchange users to cloud (google) mail. gathered and analyzed performance metric data.â education and training bs : print production, graphic design computer science , 1993 st. johns university print production, graphic design computer science technical skills active directory, premiere, ads, advertising, ibm aix, apple, architect, arts, catalog, color, com, clients, digital photography, digital video, direct mail, disaster recovery, ecommerce, final cut pro, sgi irix, it support, legal, linux, logic, loss prevention, lotus notes, marketing strategy, marketing, microsoft exchange, ms exchange, mail, network design, network, newspaper, policies, prepress, print advertising, print production, processes, sales, upgrading, video post production, website",
    "metadata": {
      "has_education": true
    },
    "sections": {},
    "keywords": [
      "new",
      "design",
      "support",
      "technology",
      "company",
      "name",
      "city",
      "state",
      "product",
      "user",
      "computer",
      "print",
      "production",
      "august",
      "strategy",
      "sale",
      "marketing",
      "managed",
      "staff",
      "policy",
      "network",
      "exchange",
      "mail",
      "information",
      "consultant",
      "managing",
      "member",
      "within",
      "problem",
      "january"
    ]
  },
  "file_path": "/Users/proxim/Desktop/Automated-First-Screener-and-AI-Job-Matching-NLP-WebEngine/data/raw/resumes/rdbe92.pdf"
}