{
  "id": "re0bc6",
  "filename": "25959103.pdf",
  "upload_time": "17:35:19",
  "document_type": "resume",
  "original_text": "ADMINISTRATOR OF INFORMATION TECHNOLOGY\nSummary\nAdvanced Desktop Support Lead/Manager with 14 plus years of experience in the Information Technology field providing Tier II - III technical\nsupport. I have demonstrated highly advanced troubleshooting techniques in resolving end-user issues with swift efficiency and going above and\nbeyond SLA. 15 plus years of experience working with United Senate end-users across multiple technological platforms.\nExperience\nCompany Name\n \nAdministrator of Information Technology\n \nCity\nJanuary 17th 2007- Present).\nResearch, implement and support new technologies in support of developing public policy implement and support of 175-person\ninfrastructure upgrades Train technical and general staff in support processes and troubleshooting techniques Establishes system\nspecifications by conferring with users; analyzing workflow, access, information, and security requirements; designing system infrastructure.\nEstablishes system by planning and executing the selection, installation, configuration, and testing of PC and server hardware, software,\nLAN and WAN networks, and operating and system management systems; defining system and operational policies and procedures.\nMaintains system performance by performing system monitoring and analysis, and performance tuning; troubleshooting system hardware,\nsoftware, networks and operating and system management systems; designing and running system load/stress testing; escalating application\nproblems to vendor.\nSecures system by developing system access, monitoring, control, and evaluation; establishing and testing disaster recovery policies and\nprocedures; completing back-ups; maintaining documentation.\nPrepares users by designing and conducting training programs; providing references and support.\nUpgrades system by conferring with vendors and services; developing, testing, evaluating, and installing enhancements and new software.\nMeets financial requirements by submitting information for budgets; monitoring expenses for the entire Leadership conference.\nProtects organization's value by keeping information confidential.\nCompany Name\n \nUnited States Senate Network Support Engineer\n \nCity\nAugust 17th 20004 -2006).\nIntegrated, selected and developed procedures to support 3rd party.\nProvided support for software, printing, and network access issues to entire Senate community.\nProvided senior level support to internal Help Desk operations.\nWorked on integrating with 3rd party software.\nResponsible for installation, configuration and support of Capitol Correspond sql database.\nTrouble shooting with HP printer issues.\nWorked on connecting and configuring PC's, and NT servers to the network.\nAssure that H/W and software are working smoothly within the environment.\nProvide desktop support in a cross-platform environment Support the ongoing development and maintenance of local area network Support\neffective security systems.\nBack-up systems and updates.\nPerform special projects as needed.\nIdentify, research, and recommend solutions on technical issues as needed.\nCompany Name\n \nUnited States Senate Software Specialist\n \nCity\nAugust 15th 2000 -2004).\nProvides client site level 2 support of capitol Correspond database management software running on MS SQL database.\nResponsible for installation, configuration and support of Capitol Correspond SQL database.\nProvided client training for the use of Capitol Correspond Database.\nTrouble shooting with MS SQL, and troubleshooting printer issues.\nProvided client training for the use of Capitol Correspond Database.\nWorked on connecting and configuring PCs, and NT servers to the network.\nProvide desktop support in a cross-platform environment Support the ongoing development and maintenance of local area network Support\neffective security systems.\nBack-up systems and updates.\nPerform special projects as needed.\nIdentify, research, and recommend solutions on technical issues as needed.\nEducation\nAMERICAN MILITARY UNIVERSITY\n \n2014\n \nMaster of Arts\n \n: \nNational Security Studies Cyber Security\n \nNational Security Studies Cyber\nSecurity\nAIR FORCE AIR COMMAND AND STAFF COLLEGE\n \n2013\n \nState\n \nGraduate Certificate: Aerospace, Cyberspace and Joint Professional\nEducation.\nMARYMOUNT UNIVERSITY\n \n2007\n \nMaster\n \n: \nScience Computer Information Systems Management\n \nCity\n \n, \nState\n \nScience Computer Information\nSystems Management\n\nMARYMOUNT UNIVERSITY\n \n1999\n \nBachelor of Science\n \n: \nComputer Information Systems\n \nCity\n \n, \nState\n \nComputer Information Systems\nMCAFEE \nCYBER INSTITUTE\n \nCertified Cyber Intelligence Professional (CCIP). \n2016\nProfessional Affiliations\nMember of the Delta Epsilon Sigma Honor Society Member of Intelligence and National Security Alliance. Member of the Senate Information\nSecurity IT group. Member of Council for Emerging National Security Affairs. Member of Partnership for Secure America.\nPublications\nCongressional Scholar Certificate: Security Policy. CompTIA \nA+, Network+ \nSecurity+ (2016)\nLanguages\nArabic (fluent)\nSkills\nArabic, Back-up, budgets, hardware, client, Database, database management, designing, disaster recovery, documentation, financial, Help Desk,\nHP, local area network, LAN, Leadership, access, 2000, network, networks, NT servers, PC's, policies, printer, processes, Research, sql, MS\nSQL, desktop support, training programs, Trouble shooting, troubleshooting, Upgrades, WAN, workflow",
  "processed": {
    "clean_text": "administrator of information technology summary advanced desktop support lead/manager with 14 plus years of experience in the information technology field providing tier ii - iii technical support. i have demonstrated highly advanced troubleshooting techniques in resolving end-user issues with swift efficiency and going above and beyond sla. 15 plus years of experience working with united senate end-users across multiple technological platforms. experience company name administrator of information technology city january 17th 2007- present). research, implement and support new technologies in support of developing public policy implement and support of 175-person infrastructure upgrades train technical and general staff in support processes and troubleshooting techniques establishes system specifications by conferring with users; analyzing workflow, access, information, and security requirements; designing system infrastructure. establishes system by planning and executing the selection, installation, configuration, and testing of pc and server hardware, software, lan and wan networks, and operating and system management systems; defining system and operational policies and procedures. maintains system performance by performing system monitoring and analysis, and performance tuning; troubleshooting system hardware, software, networks and operating and system management systems; designing and running system load/stress testing; escalating application problems to vendor. secures system by developing system access, monitoring, control, and evaluation; establishing and testing disaster recovery policies and procedures; completing back-ups; maintaining documentation. prepares users by designing and conducting training programs; providing references and support. upgrades system by conferring with vendors and services; developing, testing, evaluating, and installing enhancements and new software. meets financial requirements by submitting information for budgets; monitoring expenses for the entire leadership conference. protects organizations value by keeping information confidential. company name united states senate network support engineer city august 17th 20004 -2006). integrated, selected and developed procedures to support 3rd party. provided support for software, printing, and network access issues to entire senate community. provided senior level support to internal help desk operations. worked on integrating with 3rd party software. responsible for installation, configuration and support of capitol correspond sql database. trouble shooting with hp printer issues. worked on connecting and configuring pcs, and nt servers to the network. assure that h/w and software are working smoothly within the environment. provide desktop support in a cross-platform environment support the ongoing development and maintenance of local area network support effective security systems. back-up systems and updates. perform special projects as needed. identify, research, and recommend solutions on technical issues as needed. company name united states senate software specialist city august 15th 2000 -2004). provides client site level 2 support of capitol correspond database management software running on ms sql database. responsible for installation, configuration and support of capitol correspond sql database. provided client training for the use of capitol correspond database. trouble shooting with ms sql, and troubleshooting printer issues. provided client training for the use of capitol correspond database. worked on connecting and configuring pcs, and nt servers to the network. provide desktop support in a cross-platform environment support the ongoing development and maintenance of local area network support effective security systems. back-up systems and updates. perform special projects as needed. identify, research, and recommend solutions on technical issues as needed. education american military university 2014 master of arts : national security studies cyber security national security studies cyber security air force air command and staff college 2013 state graduate certificate: aerospace, cyberspace and joint professional education. marymount university 2007 master : science computer information systems management city , state science computer information systems management marymount university 1999 bachelor of science : computer information systems city , state computer information systems mcafee cyber institute certified cyber intelligence professional (ccip). 2016 professional affiliations member of the delta epsilon sigma honor society member of intelligence and national security alliance. member of the senate information security it group. member of council for emerging national security affairs. member of partnership for secure america. publications congressional scholar certificate: security policy. comptia a, network security (2016) languages arabic (fluent) skills arabic, back-up, budgets, hardware, client, database, database management, designing, disaster recovery, documentation, financial, help desk, hp, local area network, lan, leadership, access, 2000, network, networks, nt servers, pcs, policies, printer, processes, research, sql, ms sql, desktop support, training programs, trouble shooting, troubleshooting, upgrades, wan, workflow",
    "metadata": {
      "has_education": true
    },
    "sections": {},
    "keywords": [
      "system",
      "support",
      "security",
      "network",
      "information",
      "software",
      "database",
      "issue",
      "management",
      "sql",
      "troubleshooting",
      "senate",
      "city",
      "policy",
      "state",
      "capitol",
      "correspond",
      "member",
      "technology",
      "desktop",
      "technical",
      "research",
      "access",
      "designing",
      "testing",
      "server",
      "training",
      "provided",
      "needed",
      "client"
    ]
  },
  "file_path": "/Users/proxim/Desktop/Automated-First-Screener-and-AI-Job-Matching-NLP-WebEngine/data/raw/resumes/re0bc6.pdf"
}