{
  "id": "re4a01",
  "filename": "16186411.pdf",
  "upload_time": "17:35:26",
  "document_type": "resume",
  "original_text": "DATABASE PROGRAMMER/ANALYST (.NET DEVELOPER)\nSummary\nSoftware Engineer with 2 years in Web Developer specializing in front end development. Proficient in Software Development Life Cycle (SDLC)\nand SCRUM AGILE methodologies of development process to produce software solutions by team. Involved in designing, planning, developing\nand implementing Microsoft .Net based solutions that meet quality and code standards. \nDeveloped web based applications using C#, ASP.Net,\nJavaScript, jQuery, CSS, Bootstrap CSS, HTML, XML and AJAX. Strong experience in data retrieval and manipulation using ADO.Net data\nobjects such as Dataset, Data Reader, Data list, Data Adaptor, Entity Frame work. Good experience in writing Class Library using C# , LINQ to\nSQL queries in Database Access layer to interface with SQL Database. Worked extensively with .Net Server Controls, Web User Controls, Data\nGrid, Web Control, Form Validation Controls and created Custom controls. Worked on creating and modifying Table Definitions, stored\nprocedures in SQL Database. Modified and written web services using C# to interact with the other applications so data can be served. Used Red\nGate SQL Compare to deploy database from one server to another server (Dev -> Test/QA).Worked on .NET security features such as Form-\nBased Authentication and Role-Based Authorization. Involved in bug fixes and production support. Worked closely with Scrum Master for\nbacklog catalogs, feature catalogs and prioritized the tasks Participated in daily scrums and weekly meetings with the project sponsors to meet\nexpectations and deadlines Interact with QA to ensure the defects are properly cleared to attain the quality standards Providing demos to the QA\nteam at the end of the sprint to push for its final stage. Worked with cross-functional teams to meet project.\nHighlights\nASP.Net, C#, \nJavaScript, jQuery, VB.Net, C, C++, Java\nNet Technologies: \n.Net Framework 4.0/4.5, ASP.Net, ASP.NET MVC, VB.Net, ADO.Net, Entity Framework, AJAX, Web Service,\nLINQ, \nEntity Framework, LINQ queries. ASP.Net, HTML, CSS, JavaScript, JQuery, Bootstrap CSS.\nIDE: \nVisual Studio, Eclipse, NetBeans, Dreamweaver\nDatabase: \nSQL, MySql\nOperating System: \nWindows\nVersion Controls : \nTortoise SVN, GitHub\nOthers: \nMicrosoft Word, Excel, Access, Power point\nProfessional Experience\nDatabase Programmer/Analyst (.NET Developer)\n \nJun 2014\n \nto \nFeb 2016\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nWorked as Graduate Research Assistant performing the duties of Database Programmer/Analyst at Application Development Network\n(ADN), DoIT which supports University of Missouri System faculty and students through agile and rapid creation of new applications.\nProjects: Atlas: Description: This project is all about requesting, scheduling the tutoring sessions.\nThere are three roles tied to application they are Tutee, Tutor, and Scheduler.\nA tutee requests for tutoring for the classes that he/she enrolled and gives availability apart from the class timing through Availability Grid and\nTutor submits availability.\nA scheduler will go through those availabilities and schedule time and location for tutoring.\nAlso, there are some set of rules for dropping the tutoring sessions which are incorporated in this project.\nThe other piece of this project is automated emails through Scheduled task which runs every day.\nResponsibilities: Created a Availability Calendar Grid.\nIn grid each cell represents time (1 hour span) and day of the week.\nClicking on the cell toggles the availability.\nAutomatically populated the course schedule which comes from different database(Worked with data warehouse team in order to get that\ndata) Developed C# Console Application for Scheduled email task.\nGot rid of data tables and table adapters in the main project as they are tightly coupled.\nCreated Class libraries out of the main project to access the database which can be used by both Console Application for Schedule task\nand web application.\nIntegrated Open Source HTML text editor CKEditor into the website.\nUsed jQuery for filtering, sorting and search the listview, JavaScript for clientside validations.\nUsed role based authorization for various pages.\nThe goal of the project to refractor the old application with new templates and replace the assemblies.\nAdding functionalities to upload pdf files.\nResponsilities: Created separate Login page for Administrator and Students.\nUsed Active Directory (AD Group) to restrict other department Students.\nDeveloped a web interface for Administrators to upload the pdf files into database which can be viewed by students.\nUpdated the entire application by using new Visual Studio 2013 template which make use of Bootstrap CSS by changing the master pages.\nModified the structure of database to login.\nUsed Redgate SQL Compare to copy the data from database from dev server to test sever.\nReplaced the old ADN Utilities assemblies with new DoIT Utilities assemblies.\nAppInventory: Description: The goal of the project to allow the admins, managers, scrum masters of the organization to keep track various\napplications which includes their developed, ongoing and future projects.\nFor every application there are application parameters which includes App Structure, Remedy group, User Departments etc.\nand each application has different version.\nFor each version the parameters are Prod, QA, test URL, DCL, Database, platforms, framework used to develop application, UAT dates\n\netc.\nScrum Masters can estimate the length and cost to build the application (Project Estimator) based on number of developers, Sprint length,\nweeks of UAT etc which they can share with clients.\nAfter starting the project they can keep track of current progress by budget, sprint burndown charts.\nResponsibilities: Entity Framework was used using Database first approach.\nLINQ was used in the DAL (Data Access Layer) to interact with the Database Consumed ADO.Net Entity Frame Work for Entity Data\nModel, Entities, Relationship Mapping, and Querying Data.\nConsole Application to import the data from CSV files to populate them into the system.\nAutomatic logout when user is idle for a specified time by using session parameters and JavaScript.\nUsed client side validations, onbeforeunload and onunload events in Javascript.\nWorked on agile environment.\nParticipated in daily scrum meetings to discuss the status of development, planning and estimating the points and UAT.\nGoAdmin: Description: GoMizzou is the University of Missouri flagship mobile application, designed to provide services to all possible users\nof the university.\nThe goal of this project is to allow GoMizzou Staff to edit the master tables involved with the GoMizzou webservices.\nThese master tables are the starting point for all window services (which feed the web services).\nProduction URL: https://appsprod.missouri.edu/GoAdmin Responsibilities: Developed Application using AJAX controls like modal popup,\nASP.Net server controls like listview, formview, worked on Clientside and Server side Validations and created Master Pages.\nFiltering of the data of listview based on the role.\nUsed n-Tier Architecture, Created the Business Logic Layer by using Class Libraries to interact with database.\nModified the existing webservices like SocialSpirit, News webservices, Events web and windows services.\nCreated ASP.Net User Controls to reduce the complexity of user interface design Created dynamic queries, stored procedures, Views and\ntriggers in SQL server for the database manipulation.\nMizzou Checkout: The goal of the project is to develop a web application for Checkout process similar to shopping cart for various\ndepartments who met the certain rules.\nResponsibilities: Used Smpt server to send emails Developed C# Class Library to import the data from the CSV file to system LIM Service\nfor late fee assessment Access to page based on the role (Role based authentication) Personalized Email for Outlook: The goal of the\nproject to give students to customize their outlook email.\nEducation\nMaster of Science\n \n, \nComputer Engineering\n \nPresent\n \nUniversity of Missouri\n \nï¼​ \nState\n \nGPA: \nGPA: 3.7\n \nComputer Engineering GPA: 3.7\nBachelor of Technology\n \n, \nElectrical and Electronics Engineering\n \nMay 2013\n \nJawaharlal Nehru Technological University\n \nIndia\n \nGPA: \nGPA: 3.65\nElectrical and Electronics Engineering GPA: 3.65\nSkills\nASP.NET, VB.Net, Active Directory, ADO.Net, Dreamweaver, \nWeb Development, AGILE, AJAX, \nHTML, IDE, Java, JavaScript, JQuery,\nAnalyst, Application Development, approach, budget, C, C++, catalogs, charts, CSS, Checkout process, client, clients, data warehouse,\nDatabase, DCL, Eclipse, edit, editor, Email, estimating, features, Frame, functional, , Logic, meetings, Access, C#, Excel, Outlook, Power point,\nWindows, window, Microsoft Word, Network, Operating System, page, pdf, Programmer, Programming, progress, quality, QA, Research,\nscheduling, Scrum, SDLC, Software Development, sorting, SQL, SQL server, tables, tutoring, user interface design, Utilities, validation, Visual\nStudio, website",
  "processed": {
    "clean_text": "database programmer/analyst (.net developer) summary software engineer with 2 years in web developer specializing in front end development. proficient in software development life cycle (sdlc) and scrum agile methodologies of development process to produce software solutions by team. involved in designing, planning, developing and implementing microsoft .net based solutions that meet quality and code standards. developed web based applications using c, asp.net, javascript, jquery, css, bootstrap css, html, xml and ajax. strong experience in data retrieval and manipulation using ado.net data objects such as dataset, data reader, data list, data adaptor, entity frame work. good experience in writing class library using c , linq to sql queries in database access layer to interface with sql database. worked extensively with .net server controls, web user controls, data grid, web control, form validation controls and created custom controls. worked on creating and modifying table definitions, stored procedures in sql database. modified and written web services using c to interact with the other applications so data can be served. used red gate sql compare to deploy database from one server to another server (dev - test/qa).worked on .net security features such as form- based authentication and role-based authorization. involved in bug fixes and production support. worked closely with scrum master for backlog catalogs, feature catalogs and prioritized the tasks participated in daily scrums and weekly meetings with the project sponsors to meet expectations and deadlines interact with qa to ensure the defects are properly cleared to attain the quality standards providing demos to the qa team at the end of the sprint to push for its final stage. worked with cross-functional teams to meet project. highlights asp.net, c, javascript, jquery, vb.net, c, c, java net technologies: .net framework 4.0/4.5, asp.net, asp.net mvc, vb.net, ado.net, entity framework, ajax, web service, linq, entity framework, linq queries. asp.net, html, css, javascript, jquery, bootstrap css. ide: visual studio, eclipse, netbeans, dreamweaver database: sql, mysql operating system: windows version controls : tortoise svn, github others: microsoft word, excel, access, power point professional experience database programmer/analyst (.net developer) jun 2014 to feb 2016 company name ï¼ city , state worked as graduate research assistant performing the duties of database programmer/analyst at application development network (adn), doit which supports university of missouri system faculty and students through agile and rapid creation of new applications. projects: atlas: description: this project is all about requesting, scheduling the tutoring sessions. there are three roles tied to application they are tutee, tutor, and scheduler. a tutee requests for tutoring for the classes that he/she enrolled and gives availability apart from the class timing through availability grid and tutor submits availability. a scheduler will go through those availabilities and schedule time and location for tutoring. also, there are some set of rules for dropping the tutoring sessions which are incorporated in this project. the other piece of this project is automated emails through scheduled task which runs every day. responsibilities: created a availability calendar grid. in grid each cell represents time (1 hour span) and day of the week. clicking on the cell toggles the availability. automatically populated the course schedule which comes from different database(worked with data warehouse team in order to get that data) developed c console application for scheduled email task. got rid of data tables and table adapters in the main project as they are tightly coupled. created class libraries out of the main project to access the database which can be used by both console application for schedule task and web application. integrated open source html text editor ckeditor into the website. used jquery for filtering, sorting and search the listview, javascript for clientside validations. used role based authorization for various pages. the goal of the project to refractor the old application with new templates and replace the assemblies. adding functionalities to upload pdf files. responsilities: created separate login page for administrator and students. used active directory (ad group) to restrict other department students. developed a web interface for administrators to upload the pdf files into database which can be viewed by students. updated the entire application by using new visual studio 2013 template which make use of bootstrap css by changing the master pages. modified the structure of database to login. used redgate sql compare to copy the data from database from dev server to test sever. replaced the old adn utilities assemblies with new doit utilities assemblies. appinventory: description: the goal of the project to allow the admins, managers, scrum masters of the organization to keep track various applications which includes their developed, ongoing and future projects. for every application there are application parameters which includes app structure, remedy group, user departments etc. and each application has different version. for each version the parameters are prod, qa, test url, dcl, database, platforms, framework used to develop application, uat dates etc. scrum masters can estimate the length and cost to build the application (project estimator) based on number of developers, sprint length, weeks of uat etc which they can share with clients. after starting the project they can keep track of current progress by budget, sprint burndown charts. responsibilities: entity framework was used using database first approach. linq was used in the dal (data access layer) to interact with the database consumed ado.net entity frame work for entity data model, entities, relationship mapping, and querying data. console application to import the data from csv files to populate them into the system. automatic logout when user is idle for a specified time by using session parameters and javascript. used client side validations, onbeforeunload and onunload events in javascript. worked on agile environment. participated in daily scrum meetings to discuss the status of development, planning and estimating the points and uat. goadmin: description: gomizzou is the university of missouri flagship mobile application, designed to provide services to all possible users of the university. the goal of this project is to allow gomizzou staff to edit the master tables involved with the gomizzou webservices. these master tables are the starting point for all window services (which feed the web services). production url: https://appsprod.missouri.edu/goadmin responsibilities: developed application using ajax controls like modal popup, asp.net server controls like listview, formview, worked on clientside and server side validations and created master pages. filtering of the data of listview based on the role. used n-tier architecture, created the business logic layer by using class libraries to interact with database. modified the existing webservices like socialspirit, news webservices, events web and windows services. created asp.net user controls to reduce the complexity of user interface design created dynamic queries, stored procedures, views and triggers in sql server for the database manipulation. mizzou checkout: the goal of the project is to develop a web application for checkout process similar to shopping cart for various departments who met the certain rules. responsibilities: used smpt server to send emails developed c class library to import the data from the csv file to system lim service for late fee assessment access to page based on the role (role based authentication) personalized email for outlook: the goal of the project to give students to customize their outlook email. education master of science , computer engineering present university of missouri ï¼ state gpa: gpa: 3.7 computer engineering gpa: 3.7 bachelor of technology , electrical and electronics engineering may 2013 jawaharlal nehru technological university india gpa: gpa: 3.65 electrical and electronics engineering gpa: 3.65 skills asp.net, vb.net, active directory, ado.net, dreamweaver, web development, agile, ajax, html, ide, java, javascript, jquery, analyst, application development, approach, budget, c, c, catalogs, charts, css, checkout process, client, clients, data warehouse, database, dcl, eclipse, edit, editor, email, estimating, features, frame, functional, , logic, meetings, access, c, excel, outlook, power point, windows, window, microsoft word, network, operating system, page, pdf, programmer, programming, progress, quality, qa, research, scheduling, scrum, sdlc, software development, sorting, sql, sql server, tables, tutoring, user interface design, utilities, validation, visual studio, website",
    "metadata": {
      "urls": [
        "https://appsprod.missouri.edu"
      ],
      "has_education": true
    },
    "sections": {},
    "keywords": [
      "application",
      "database",
      "data",
      "project",
      "web",
      "used",
      "using",
      "sql",
      "server",
      "control",
      "development",
      "based",
      "asp.net",
      "worked",
      "created",
      "master",
      "scrum",
      "javascript",
      "entity",
      "user",
      "service",
      ".net",
      "developed",
      "class",
      "access",
      "table",
      "availability",
      "email",
      "page",
      "gpa"
    ]
  },
  "file_path": "/Users/proxim/Desktop/Automated-First-Screener-and-AI-Job-Matching-NLP-WebEngine/data/raw/resumes/re4a01.pdf"
}