{
  "id": "reb8b0",
  "filename": "28897981.pdf",
  "upload_time": "17:35:16",
  "document_type": "resume",
  "original_text": "INFORMATION TECHNOLOGY SPECIALIST (WEB), GS-11\nCareer Overview\nObjective\n Â \nIT Specialist, GS-2210-9 (CUSTSPT)\nNOC Merit-2016-0031\nExperienced Systems Analyst with diverse industry experience in government, maritime, forestry, research and development. Professional expertise\nincludes systems applications, disaster recovery planning, customer services, including remote, phone and local one on one.\nQualifications\nExcellent communicator\nAdopts technology to business needs\nStays current with technology\nExcellent interpersonal skills\nMS SharePoint, MS Access\nMS Office, Adobe Suite\nOS(s) Windows, Linux, Mac\nSkype, WebEx, Adobe Connect, MS Lync\nTechnical Skills\nSkills\nExperience\nTotal Years\nLast Used\nLevel I, II and III customer Support\nRegional System Manager\n5\nSeptember 2014\nSystem installs and upgrades of agency software\nSystem Admin\n5\nSeptember 2015\nAccomplishments\nAwarded by the Forest Service, Pacific Northwest Research Station, for developing publishing innovations, multiple website support, and\nchampioning SharePoint. Also, awarded for superior performance during 2013.\nAwarded by the Forest Service, Pacific Northwest Research Station, for delivering superb computer assistance to the Communication Application\nProgram, and demonstrated outstanding support to the maintenance of the stations' websites, and demonstrating extra effort in updating research\nrelated databases, and for researching new media sources such as e-pubs for the station's publications.\nKey developer and supporter for a new Regional Examination Center(REC) Merchant Mariner database, which was widely adopted by several\nREC's across the United States, for the U.S. Coast Guard.\nWork Experience\nCompany Name\n \nCity\n \n, \nState\n \nInformation Technology Specialist (Web), GS-11\n \n08/2013\n \nto \n02/2016\nOver two years of planning, coordinating, and identifying business and research functions, resources and services working with the Forest\nServices' Climate Change Resource Center (CCRC).\nCoordinated testing and improvement of Chief of Information Office (CIO) Virtual Machine Primer training guide, for use by the Forest\nService IT specialist, to transform web services to a Content Management System, using Drupal with Linux platform.\nEstablished a prototype site for training web team members, in preparations for migration to a new content management system.\nInstrumental in researching, planning and collaborating with teams in the Forest Service to increase the knowledge base of Drupal,\nSharePoint and eBooks for PNWRS, R&D and members CIO/WO levels.\nApply federal, department, and agency web regulations and policies.\nTrained program departments to use MS SharePoint to collect files, data, publications, and agency policies into one central hub.\nEnsure that all material presented is in compliance with copyright requirements and section 508 of the Rehabilitation Act.\nCompany Name\n \nCity\n \n, \nState\n \nComputer Assistant, GS-5\n \n03/2010\n \nto \n08/2013\nManaged internet and intranet sites.\nCreated and modified publication database entries within the Forest Services' Research Information Tracking System (RITS).\nAdministered SharePoint sites.\nProvide group and one-on-one training to staff and new site owners.\nConverted print publications to eBook format for eReaders, \nincluding: embedding video and audio media clips.\nCompany Name\n \nCity\n \n, \nState\n \nComputer Department Intern\n \n09/2008\n \nto \n06/2009\nDesigned and proto-typed a web-based, IT assets inventory tracking system, using Linux, Apache, MySQL, PHP, HTML, and CSS.\nAssisted all levels of school districts technical staff, with projects and day to day operations.\nPlanned and deploying technology for teachers and students in the Camas School District, including software migration, computer and\nserver upgrades.\nEstablish a fleet of Linux OS laptops, that saved the school district over $250,000, by repurposing old laptops marked to be recycled.\n\nAssist with Citrix software, MS Office, Adobe Suite, Linux based Ubuntu and applications.\nInstalled, maintained and repaired network hardware/software on multiple-campuses.\nSetup over 80 media presentations carts with sound systems for classes, working after normal work hours and weekends to minimize\ndowntime for classrooms.\nCompany Name\n \nCity\n \n, \nState\n \nDatabase Intern\n \n06/2008\n \nto \n08/2009\nCreate a patient tracking system using MS Access relationship database to help market a naturopathic clinic.\nCompany Name\n \nCity\n \n, \nState\n \nOffice/Building Manager\n \n01/2005\n \nto \n10/2005\n32-hour work week\nManaged a church office, created correspondence and newsletters\nScheduled and setup satellite seminars and media presentations.\nCoordinated building use for Homelink River charter school, to provide a safe and functional classrooms and facilities.\nScheduled and supervised events for church and school.\nCompany Name\n \nCity\n \n, \nState\n \nGeek Squad Tech\n \n10/2004\n \nto \n12/2004\nGeek Squad Tech\nAssist customers with troubleshooting their computer problems, and technical questions.\nUpgrade hardware and software, removed viruses-spyware, \nsold computers and accessories, setup new computers to BestBuy\nspecifications for quick sales.\nCompany Name\n \nCity\n \n, \nState\n \nMarine Science Technician, E-6\n \n11/1984\n \nto \n05/2004\nProvided level I, II, and III IT support as a Regional System Manager for other 400 workstations, across multiple Coast Guard campus, at\nremote field stations, and for facilities on ships.\nProvided training a assistance to system operators at units in problem solving, daily operations, including system backups, user profile\nsetups, and user support.\nDisplayed courtesy and strong interpersonal skills with all customer interactions.\nBuilt and maintained successful relationships with service providers, dealers and consumers.\nAssisted customers with technical issues via email, live chat and telephone.\nCreated and supported multiple MS Access databases to track business needs.\nEducation and Training\nMaster of Science\n \n:\n \nManagement and Organizational Leadership\n \n08/2015\n \nWarner Pacific University\n \n, \nCity\n \n, \nState\n \n, \nUSA\nManagement and Organizational Leadership\nCertification\n \n:\n \nITIL Foundation\n \n2016\n \nNew Horizons\n \n, \nCity\n \n, \nState\n \n, \nUSA\nBachelor of Science\n \n:\n \nTechnology\n \n06/2009\n \nEastern Washington University\n \n, \nCity\n \n, \nState\n \n, \nUSA\nTechnology\nSite Builder and Theming\n \n:\n \nDrupal, Content Management\n \n08/2012\n \nOpenSourcery\n \n, \nCity\n \n, \nState\n \n, \nUSA\nAdditional Skills\nWeb, Content Management Systems, team collaborator/facilitator, innovator \ninspection, audits, presentations, researcher, self-starter,T1, problem\nsolver",
  "processed": {
    "clean_text": "information technology specialist (web), gs-11 career overview objective â it specialist, gs-2210-9 (custspt) noc merit-2016-0031 experienced systems analyst with diverse industry experience in government, maritime, forestry, research and development. professional expertise includes systems applications, disaster recovery planning, customer services, including remote, phone and local one on one. qualifications excellent communicator adopts technology to business needs stays current with technology excellent interpersonal skills ms sharepoint, ms access ms office, adobe suite os(s) windows, linux, mac skype, webex, adobe connect, ms lync technical skills skills experience total years last used level i, ii and iii customer support regional system manager 5 september 2014 system installs and upgrades of agency software system admin 5 september 2015 accomplishments awarded by the forest service, pacific northwest research station, for developing publishing innovations, multiple website support, and championing sharepoint. also, awarded for superior performance during 2013. awarded by the forest service, pacific northwest research station, for delivering superb computer assistance to the communication application program, and demonstrated outstanding support to the maintenance of the stations websites, and demonstrating extra effort in updating research related databases, and for researching new media sources such as e-pubs for the stations publications. key developer and supporter for a new regional examination center(rec) merchant mariner database, which was widely adopted by several recs across the united states, for the u.s. coast guard. work experience company name city , state information technology specialist (web), gs-11 08/2013 to 02/2016 over two years of planning, coordinating, and identifying business and research functions, resources and services working with the forest services climate change resource center (ccrc). coordinated testing and improvement of chief of information office (cio) virtual machine primer training guide, for use by the forest service it specialist, to transform web services to a content management system, using drupal with linux platform. established a prototype site for training web team members, in preparations for migration to a new content management system. instrumental in researching, planning and collaborating with teams in the forest service to increase the knowledge base of drupal, sharepoint and ebooks for pnwrs, rd and members cio/wo levels. apply federal, department, and agency web regulations and policies. trained program departments to use ms sharepoint to collect files, data, publications, and agency policies into one central hub. ensure that all material presented is in compliance with copyright requirements and section 508 of the rehabilitation act. company name city , state computer assistant, gs-5 03/2010 to 08/2013 managed internet and intranet sites. created and modified publication database entries within the forest services research information tracking system (rits). administered sharepoint sites. provide group and one-on-one training to staff and new site owners. converted print publications to ebook format for ereaders, including: embedding video and audio media clips. company name city , state computer department intern 09/2008 to 06/2009 designed and proto-typed a web-based, it assets inventory tracking system, using linux, apache, mysql, php, html, and css. assisted all levels of school districts technical staff, with projects and day to day operations. planned and deploying technology for teachers and students in the camas school district, including software migration, computer and server upgrades. establish a fleet of linux os laptops, that saved the school district over 250,000, by repurposing old laptops marked to be recycled. assist with citrix software, ms office, adobe suite, linux based ubuntu and applications. installed, maintained and repaired network hardware/software on multiple-campuses. setup over 80 media presentations carts with sound systems for classes, working after normal work hours and weekends to minimize downtime for classrooms. company name city , state database intern 06/2008 to 08/2009 create a patient tracking system using ms access relationship database to help market a naturopathic clinic. company name city , state office/building manager 01/2005 to 10/2005 32-hour work week managed a church office, created correspondence and newsletters scheduled and setup satellite seminars and media presentations. coordinated building use for homelink river charter school, to provide a safe and functional classrooms and facilities. scheduled and supervised events for church and school. company name city , state geek squad tech 10/2004 to 12/2004 geek squad tech assist customers with troubleshooting their computer problems, and technical questions. upgrade hardware and software, removed viruses-spyware, sold computers and accessories, setup new computers to bestbuy specifications for quick sales. company name city , state marine science technician, e-6 11/1984 to 05/2004 provided level i, ii, and iii it support as a regional system manager for other 400 workstations, across multiple coast guard campus, at remote field stations, and for facilities on ships. provided training a assistance to system operators at units in problem solving, daily operations, including system backups, user profile setups, and user support. displayed courtesy and strong interpersonal skills with all customer interactions. built and maintained successful relationships with service providers, dealers and consumers. assisted customers with technical issues via email, live chat and telephone. created and supported multiple ms access databases to track business needs. education and training master of science : management and organizational leadership 08/2015 warner pacific university , city , state , usa management and organizational leadership certification : itil foundation 2016 new horizons , city , state , usa bachelor of science : technology 06/2009 eastern washington university , city , state , usa technology site builder and theming : drupal, content management 08/2012 opensourcery , city , state , usa additional skills web, content management systems, team collaborator/facilitator, innovator inspection, audits, presentations, researcher, self-starter,t1, problem solver",
    "metadata": {
      "has_education": true
    },
    "sections": {},
    "keywords": [
      "system",
      "state",
      "city",
      "service",
      "technology",
      "computer",
      "company",
      "name",
      "web",
      "research",
      "forest",
      "database",
      "new",
      "management",
      "customer",
      "skill",
      "sharepoint",
      "linux",
      "support",
      "station",
      "training",
      "site",
      "school",
      "information",
      "specialist",
      "including",
      "office",
      "technical",
      "level",
      "software"
    ]
  },
  "file_path": "/Users/proxim/Desktop/Automated-First-Screener-and-AI-Job-Matching-NLP-WebEngine/data/raw/resumes/reb8b0.pdf"
}