{
  "id": "j4bdc2",
  "filename": "jobdescription.txt",
  "upload_time": "19:45:29",
  "document_type": "job_description",
  "original_text": "About the job\nWe are looking for a detail-oriented and analytical Data Analyst to join our team. The ideal candidate will be responsible for collecting, analyzing, and interpreting complex datasets to support data-driven decision-making across various business functions. This role requires a strong ability to translate raw data into meaningful insights that drive operational efficiency and business growth.\n\n\n\nResponsibilities:\n\n • Gather, clean, and preprocess data from multiple sources to ensure accuracy and reliability.\n\n • Conduct exploratory data analysis and generate insights to support business strategy.\n\n • Develop and maintain dashboards, reports, and visualizations using Tableau, Power BI, Looker, or similar BI tools.\n\n • Write and optimize SQL queries to extract, transform, and analyze large datasets.\n\n • Utilize Python, R, or Excel for statistical analysis, forecasting, and automation.\n\n • Work closely with cross-functional teams, including engineering, marketing, finance, and product teams, to provide actionable insights.\n\n • Identify trends, anomalies, and key performance indicators (KPIs) to inform business decisions.\n\n • Support A/B testing and data-driven experiments to optimize processes and improve performance.\n\n • Maintain documentation for data analysis processes, metrics definitions, and reporting standards.\n\n • Ensure compliance with data privacy regulations and security best practices.\n\n\n\nRequirements:\n\n • Bachelor’s or Master’s degree in Statistics, Data Science, Computer Science, Mathematics, Economics, or a related field.\n\n • Proficiency in SQL for data extraction and manipulation.\n\n • Hands-on experience with data visualization tools such as Tableau, Power BI, or Looker.\n\n • Strong analytical skills and the ability to interpret and present data-driven insights.\n\n • Experience with Python or R for data analysis, automation, and statistical modeling (preferred).\n\n • Understanding of data warehousing, ETL processes, and cloud-based data platforms (AWS, GCP, or Azure is a plus).\n\n • Knowledge of A/B testing, predictive analytics, and machine learning is a bonus.\n\n • Strong problem-solving skills, attention to detail, and ability to work with large datasets.\n\n • Excellent communication skills to translate technical insights for non-technical stakeholders.\n\n\n\nPreferred Qualifications:\n\n • Experience working with big data tools such as Spark, Hadoop, or Snowflake.\n\n • Familiarity with APIs and data automation processes.\n\n • Background in business intelligence, marketing analytics, financial analytics, or operations analytics.\n\n • Strong project management and stakeholder engagement experience.\n\n\n\nBenefits:\n\n • Competitive salary and performance-based bonuses.\n\n • Flexible work environment (remote or hybrid options available).\n\n • Professional development and training opportunities.\n\n • Health benefits, retirement plans, and other perks based on company policies.",
  "processed": {
    "clean_text": "about the job we are looking for a detail-oriented and analytical data analyst to join our team. the ideal candidate will be responsible for collecting, analyzing, and interpreting complex datasets to support data-driven decision-making across various business functions. this role requires a strong ability to translate raw data into meaningful insights that drive operational efficiency and business growth. responsibilities:  gather, clean, and preprocess data from multiple sources to ensure accuracy and reliability.  conduct exploratory data analysis and generate insights to support business strategy.  develop and maintain dashboards, reports, and visualizations using tableau, power bi, looker, or similar bi tools.  write and optimize sql queries to extract, transform, and analyze large datasets.  utilize python, r, or excel for statistical analysis, forecasting, and automation.  work closely with cross-functional teams, including engineering, marketing, finance, and product teams, to provide actionable insights.  identify trends, anomalies, and key performance indicators (kpis) to inform business decisions.  support a/b testing and data-driven experiments to optimize processes and improve performance.  maintain documentation for data analysis processes, metrics definitions, and reporting standards.  ensure compliance with data privacy regulations and security best practices. requirements:  bachelors or masters degree in statistics, data science, computer science, mathematics, economics, or a related field.  proficiency in sql for data extraction and manipulation.  hands-on experience with data visualization tools such as tableau, power bi, or looker.  strong analytical skills and the ability to interpret and present data-driven insights.  experience with python or r for data analysis, automation, and statistical modeling (preferred).  understanding of data warehousing, etl processes, and cloud-based data platforms (aws, gcp, or azure is a plus).  knowledge of a/b testing, predictive analytics, and machine learning is a bonus.  strong problem-solving skills, attention to detail, and ability to work with large datasets.  excellent communication skills to translate technical insights for non-technical stakeholders. preferred qualifications:  experience working with big data tools such as spark, hadoop, or snowflake.  familiarity with apis and data automation processes.  background in business intelligence, marketing analytics, financial analytics, or operations analytics.  strong project management and stakeholder engagement experience. benefits:  competitive salary and performance-based bonuses.  flexible work environment (remote or hybrid options available).  professional development and training opportunities.  health benefits, retirement plans, and other perks based on company policies.",
    "metadata": {
      "job_title": "requires a strong ability to translate raw data into meaningful insights that drive operational efficiency and business growth. responsibilities:  gather, clean, and preprocess data from multiple sources to ensure accuracy and reliability.  conduct exploratory data analysis and generate insights to support business strategy.  develop and maintain dashboards, reports, and visualizations using tableau, power bi, looker, or similar bi tools.  write and optimize sql queries to extract, transform, and analyze large datasets.  utilize python, r, or excel for statistical analysis, forecasting, and automation.  work closely with cross-functional teams, including engineering, marketing, finance, and product teams, to provide actionable insights.  identify trends, anomalies, and key performance indicators (kpis) to inform business decisions.  support a/b testing and data-driven experiments to optimize processes and improve performance.  maintain documentation for data analysis processes, metrics definitions, and reporting standards.  ensure compliance with data privacy regulations and security best practices. requirements:  bachelors or masters degree in statistics, data science, computer science, mathematics, economics, or a related field.  proficiency in sql for data extraction and manipulation.  hands-on experience with data visualization tools such as tableau, power bi, or looker.  strong analytical skills and the ability to interpret and present data-driven insights.  experience with python or r for data analysis, automation, and statistical modeling (preferred).  understanding of data warehousing, etl processes, and cloud-based data platforms (aws, gcp, or azure is a plus).  knowledge of a/b testing, predictive analytics, and machine learning is a bonus.  strong problem-solving skills, attention to detail, and ability to work with large datasets.  excellent communication skills to translate technical insights for non-technical stakeholders. preferred qualifications:  experience working with big data tools such as spark, hadoop, or snowflake.  familiarity with apis and data automation processes.  background in business intelligence, marketing analytics, financial analytics, or operations analytics.  strong project management and stakeholder engagement experience. benefits:  competitive salary and performance-based bonuses.  flexible work environment (remote or hybrid options available).  professional development and training opportunities.  health benefits, retirement plans, and other perks based on company policies.",
      "company": "policies."
    },
    "sections": {},
    "keywords": [
      "data",
      "business",
      "insight",
      "strong",
      "analysis",
      "process",
      "experience",
      "analytics",
      "team",
      "datasets",
      "support",
      "data-driven",
      "ability",
      "tool",
      "automation",
      "work",
      "skill",
      "analytical",
      "translate",
      "ensure",
      "maintain",
      "visualization",
      "tableau",
      "power",
      "looker",
      "optimize",
      "sql",
      "large",
      "python",
      "statistical"
    ]
  },
  "filepath": "/Users/proxim/Desktop/Automated-First-Screener-and-AI-Job-Matching-NLP-WebEngine/data/raw/job_descriptions/j4bdc2.txt"
}